[NoCoverage] BlockStatement
src/application/services/text-analysis.service.ts:228:78
 
       const passageText = fullText.substring(passage.start, passage.end).trim()
 
-      if (result.length + passageText.length + 10 > this.MAX_CONTEXT_LENGTH) {
-        break
-      }
+      if (result.length + passageText.length + 10 > this.MAX_CONTEXT_LENGTH) {}
 
       result += '\n\n---\n\n' + passageText
