[Killed] ConditionalExpression
src/infrastructure/config/env.config.ts:62:34
   static readonly ENCRYPTION_KEY = obscured.make(ENV.ENCRYPTION_KEY) || ''
   static readonly REFRESH_TOKEN_EXPIRATION = ENV.REFRESH_TOKEN_EXPIRATION ?? 604800 // 7 days in seconds
   static readonly ACCESS_TOKEN_BUFFER = ENV.ACCESS_TOKEN_BUFFER ?? 300 // 5 minutes in seconds
-  static readonly SERVICE_NAME = ENV.SERVICE_NAME || 'norberts-spark-backend'
+  static readonly SERVICE_NAME = false
   static readonly APP_VERSION = ENV.APP_VERSION || version
   static readonly REDIS_URL = obscured.make(ENV.REDIS_URL)
killedBy: UserRepository save should insert a new user into the database
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".
