[Killed] EqualityOperator
src/domain/value-objects/uuid.ts:36:9
     }
     // Validate the UUID version but return the UUID itself, not the version string
     const version = Uuid7Util.uuidVersionValidation(userUUID)
-    if (version !== 'v7') {
+    if (version === 'v7') {
       throw new Error(`Invalid userID UUID version: ${version}`)
     }
killedBy: UpdateCompanyDTO validate() - company.companyId validation should accept valid UUID v7 for companyId
statusReason: Invalid companyId: must be a valid UUID
