[Killed] StringLiteral
adapters/primary/http/ai.extract-data.ts:30:29
 /**
  * Allowed file extensions for upload
  */
-const ALLOWED_EXTENSIONS = ['pdf', 'zip']
+const ALLOWED_EXTENSIONS = ["", 'zip']
 
 /**
killedBy: AIExtractDataController generatePresignedUrls() successful operations should generate presigned URLs for valid PDF file
statusReason: expected "vi.fn()" to be called with arguments: [ 200 ]

Number of calls: 0

[Killed] StringLiteral
adapters/primary/http/ai.extract-data.ts:30:36
 /**
  * Allowed file extensions for upload
  */
-const ALLOWED_EXTENSIONS = ['pdf', 'zip']
+const ALLOWED_EXTENSIONS = ['pdf', ""]
 
 /**
killedBy: AIExtractDataController generatePresignedUrls() successful operations should generate presigned URLs for valid ZIP file
statusReason: expected "vi.fn()" to be called with arguments: [ 200 ]

Number of calls: 0

[Killed] StringLiteral
adapters/primary/http/ai.extract-data.ts:35:48
 /**
  * Allowed MIME types for upload
  */
-const ALLOWED_MIME_TYPES = ['application/pdf', 'application/zip', 'application/x-zip-compressed']
+const ALLOWED_MIME_TYPES = ['application/pdf', "", 'application/x-zip-compressed']
 
 /**
killedBy: AIExtractDataController generatePresignedUrls() successful operations should generate presigned URLs for valid ZIP file
statusReason: expected "vi.fn()" to be called with arguments: [ 200 ]

Number of calls: 0

[Killed] BlockStatement
adapters/primary/http/ai.extract-data.ts:81:46
     private readonly pdfUtils: PDFUtils
   ) {}
 
-  registerRoutes(app: FastifyInstance): void {
-    // Generate presigned URLs from file metadata (JSON) - no file upload needed
-    app.post(
-      '/ai/presigned-urls',
-      {
-        preHandler: [authMiddleware],
-      },
-      this.generatePresignedUrls.bind(this)
-    )
-    // Use AI to extract data after successful to pre-signed URLs {fileId}
-    app.get(
-      '/ai/extract-data/:fileId',
-      {
-        preHandler: [authMiddleware],
-      },
-      this.extractData.bind(this)
-    )
-  }
+  registerRoutes(app: FastifyInstance): void {}
 
   /**
killedBy: AIExtractDataController registerRoutes() should register POST /ai/presigned-urls route
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ObjectLiteral
adapters/primary/http/ai.extract-data.ts:85:7
     // Generate presigned URLs from file metadata (JSON) - no file upload needed
     app.post(
       '/ai/presigned-urls',
-      {
-        preHandler: [authMiddleware],
-      },
+      {},
       this.generatePresignedUrls.bind(this)
     )
killedBy: AIExtractDataController registerRoutes() should register POST /ai/presigned-urls route
statusReason: expected "vi.fn()" to be called with arguments: [ '/ai/presigned-urls', …(2) ]

Received:

  1st vi.fn() call:

  [
    "/ai/presigned-urls",

[Killed] ObjectLiteral
adapters/primary/http/ai.extract-data.ts:93:7
     // Use AI to extract data after successful to pre-signed URLs {fileId}
     app.get(
       '/ai/extract-data/:fileId',
-      {
-        preHandler: [authMiddleware],
-      },
+      {},
       this.extractData.bind(this)
     )
killedBy: AIExtractDataController registerRoutes() - GET route should register GET /ai/extract-data/:fileId route
statusReason: expected "vi.fn()" to be called with arguments: [ '/ai/extract-data/:fileId', …(2) ]

Received:

  1st vi.fn() call:

  [
    "/ai/extract-data/:fileId",

[Killed] ArrayDeclaration
adapters/primary/http/ai.extract-data.ts:94:21
     app.get(
       '/ai/extract-data/:fileId',
       {
-        preHandler: [authMiddleware],
+        preHandler: [],
       },
       this.extractData.bind(this)
killedBy: AIExtractDataController registerRoutes() - GET route should register GET route with auth middleware in preHandler
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
adapters/primary/http/ai.extract-data.ts:163:25
         userAgent: request.headers['user-agent'] ?? null,
       }
 
-      this.logger.debug('Audit context for extractData', auditContext)
+      this.logger.debug("", auditContext)
 
       const dto = ExtractDataDto.validate({ fileKey, bucketName: EnvConfig.BUCKET })
killedBy: AIExtractDataController extractData() PDF file extraction should log audit context in extractData
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
-   "Audit context for extractData",

[Killed] ObjectLiteral
adapters/primary/http/ai.extract-data.ts:165:43
 
       this.logger.debug('Audit context for extractData', auditContext)
 
-      const dto = ExtractDataDto.validate({ fileKey, bucketName: EnvConfig.BUCKET })
+      const dto = ExtractDataDto.validate({})
 
       const { buffer, fileType } = await this.extractDataUseCase.execute(dto, auditContext)
killedBy: AIExtractDataController extractData() PDF file extraction should stream extracted text for a PDF file and call raw.end()
statusReason: expected "vi.fn()" to be called with arguments: [ 'Content-Type', …(1) ]

Number of calls: 0

[Killed] StringLiteral
adapters/primary/http/ai.extract-data.ts:175:45
         const { pdfFiles } = await this.pdfUtils.extractFromBuffer(Buffer.from(buffer))
 
         // Set headers for streaming newline-delimited JSON
-        reply.raw.setHeader('Content-Type', 'application/x-ndjson; charset=utf-8')
+        reply.raw.setHeader('Content-Type', "")
         reply.raw.setHeader('Transfer-Encoding', 'chunked')
 
killedBy: AIExtractDataController extractData() ZIP file extraction should stream NDJSON lines for each PDF in a ZIP
statusReason: expected "vi.fn()" to be called with arguments: [ 'Content-Type', …(1) ]

Received:

  1st vi.fn() call:

  [
    "Content-Type",

[Killed] StringLiteral
adapters/primary/http/ai.extract-data.ts:176:29
 
         // Set headers for streaming newline-delimited JSON
         reply.raw.setHeader('Content-Type', 'application/x-ndjson; charset=utf-8')
-        reply.raw.setHeader('Transfer-Encoding', 'chunked')
+        reply.raw.setHeader("", 'chunked')
 
         for (const fileEntry of pdfFiles) {
killedBy: AIExtractDataController extractData() ZIP file extraction should set Transfer-Encoding chunked header for ZIP file
statusReason: expected "vi.fn()" to be called with arguments: [ 'Transfer-Encoding', 'chunked' ]

Received:

  1st vi.fn() call:

  [
-   "Transfer-Encoding",

[Killed] BooleanLiteral
adapters/primary/http/ai.extract-data.ts:189:31
               output: Output.object({ schema: pdfSchema }),
               experimental_telemetry: {
                 isEnabled: EnvConfig.SENTRY_ENABLED,
-                recordInputs: true,
+                recordInputs: false,
                 recordOutputs: true,
               },
killedBy: AIExtractDataController extractData() ZIP file extraction should call streamText with telemetry config including recordInputs and recordOutputs for ZIP
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BooleanLiteral
adapters/primary/http/ai.extract-data.ts:190:32
               experimental_telemetry: {
                 isEnabled: EnvConfig.SENTRY_ENABLED,
                 recordInputs: true,
-                recordOutputs: true,
+                recordOutputs: false,
               },
               messages: [
killedBy: AIExtractDataController extractData() ZIP file extraction should call streamText with telemetry config including recordInputs and recordOutputs for ZIP
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ArrayDeclaration
adapters/primary/http/ai.extract-data.ts:195:28
               messages: [
                 {
                   role: 'user',
-                  content: [
-                    {
-                      type: 'file',
-                      data: fileBuffer,
-                      mediaType: 'application/pdf',
-                    },
-                  ],
+                  content: [],
                 },
               ],
killedBy: AIExtractDataController extractData() ZIP file extraction should call streamText with correct messages including application/pdf mediaType for ZIP
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
adapters/primary/http/ai.extract-data.ts:204:91
                   ],
                 },
               ],
-              onFinish: ({ finishReason, response, sources, text, totalUsage, usage }) => {
-                // Called once when the full output is complete
-                // The reason the model finished generating the text.
-                // "stop" | "length" | "content-filter" | "tool-calls" | "error" | "other" | "unknown"
-                this.logger.debug('Stream finished', { finishReason })
-                this.logger.debug('Stream usage info', { usage, totalUsage })
-                this.logger.debug('streamText.onFinish')
-
-                this.logger.debug('Stream sources', { sources })
-
-                // 'response.messages' is an array of ToolModelMessage and AssistantModelMessage,
-                // which are the model messages that were generated during the stream.
-                // This is useful if you don't need UIMessages - for simpler applications.
-                this.logger.debug('Stream response', { response: JSON.stringify(response) })
-              },
+              onFinish: ({ finishReason, response, sources, text, totalUsage, usage }) => {},
               onError: ({ error }) => {
                 this.logger.error('Stream error', error as Error)
killedBy: AIExtractDataController extractData() ZIP file extraction should invoke onFinish callback and log debug messages for ZIP
statusReason: expected "vi.fn()" to be called with arguments: [ 'Stream finished', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "Stream finished",

[Killed] StringLiteral
adapters/primary/http/ai.extract-data.ts:208:35
                 // Called once when the full output is complete
                 // The reason the model finished generating the text.
                 // "stop" | "length" | "content-filter" | "tool-calls" | "error" | "other" | "unknown"
-                this.logger.debug('Stream finished', { finishReason })
+                this.logger.debug("", { finishReason })
                 this.logger.debug('Stream usage info', { usage, totalUsage })
                 this.logger.debug('streamText.onFinish')
killedBy: AIExtractDataController extractData() ZIP file extraction should invoke onFinish callback and log debug messages for ZIP
statusReason: expected "vi.fn()" to be called with arguments: [ 'Stream finished', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "Stream finished",

[Killed] StringLiteral
adapters/primary/http/ai.extract-data.ts:212:35
                 this.logger.debug('Stream usage info', { usage, totalUsage })
                 this.logger.debug('streamText.onFinish')
 
-                this.logger.debug('Stream sources', { sources })
+                this.logger.debug("", { sources })
 
                 // 'response.messages' is an array of ToolModelMessage and AssistantModelMessage,
killedBy: AIExtractDataController extractData() ZIP file extraction should invoke onFinish callback and log debug messages for ZIP
statusReason: expected "vi.fn()" to be called with arguments: [ 'Stream sources', { sources: [] } ]

Received:

  1st vi.fn() call:

  [
-   "Stream sources",

[Survived] StringLiteral
adapters/primary/http/ai.extract-data.ts:217:35
                 // 'response.messages' is an array of ToolModelMessage and AssistantModelMessage,
                 // which are the model messages that were generated during the stream.
                 // This is useful if you don't need UIMessages - for simpler applications.
-                this.logger.debug('Stream response', { response: JSON.stringify(response) })
+                this.logger.debug("", { response: JSON.stringify(response) })
               },
               onError: ({ error }) => {

[Killed] BlockStatement
adapters/primary/http/ai.extract-data.ts:219:39
                 // This is useful if you don't need UIMessages - for simpler applications.
                 this.logger.debug('Stream response', { response: JSON.stringify(response) })
               },
-              onError: ({ error }) => {
-                this.logger.error('Stream error', error as Error)
-              },
+              onError: ({ error }) => {},
             })
             // Stream extracted text to client as it arrives, then write NDJSON summary
killedBy: AIExtractDataController extractData() ZIP file extraction should invoke onError callback and log stream error for ZIP
statusReason: expected "vi.fn()" to be called with arguments: [ 'Stream error', Any<Error> ]

Number of calls: 0

[Killed] BlockStatement
adapters/primary/http/ai.extract-data.ts:225:61
             })
             // Stream extracted text to client as it arrives, then write NDJSON summary
             let extractedText = ''
-            for await (const textPart of result.textStream) {
-              extractedText += textPart
-            }
+            for await (const textPart of result.textStream) {}
 
             // Write result as NDJSON line
killedBy: AIExtractDataController extractData() ZIP file extraction should stream NDJSON lines for each PDF in a ZIP
statusReason: expected '' to be 'Invoice A data' // Object.is equality

[Killed] ObjectLiteral
adapters/primary/http/ai.extract-data.ts:230:41
             }
 
             // Write result as NDJSON line
-            const data = JSON.stringify({
-              fileName: fileEntry.path,
-              data: extractedText,
-              success: true,
-            })
+            const data = JSON.stringify({})
 
             this.logger.info('Extracted data from PDF', {
killedBy: AIExtractDataController extractData() ZIP file extraction should stream NDJSON lines for each PDF in a ZIP
statusReason: expected undefined to be defined

[Killed] BooleanLiteral
adapters/primary/http/ai.extract-data.ts:233:24
             const data = JSON.stringify({
               fileName: fileEntry.path,
               data: extractedText,
-              success: true,
+              success: false,
             })
 
killedBy: AIExtractDataController extractData() ZIP file extraction should stream NDJSON lines for each PDF in a ZIP
statusReason: expected false to be true // Object.is equality

[Survived] ObjectLiteral
adapters/primary/http/ai.extract-data.ts:236:57
               success: true,
             })
 
-            this.logger.info('Extracted data from PDF', {
-              data,
-            })
+            this.logger.info('Extracted data from PDF', {})
             reply.raw.write(data + '\n')
           } catch (pdfError) {

[Killed] StringLiteral
adapters/primary/http/ai.extract-data.ts:239:36
             this.logger.info('Extracted data from PDF', {
               data,
             })
-            reply.raw.write(data + '\n')
+            reply.raw.write(data + "")
           } catch (pdfError) {
             this.logger.error(
killedBy: AIExtractDataController extractData() ZIP file extraction should append newline to ZIP result NDJSON write calls
statusReason: expected '{"fileName":"invoice.pdf","data":"ZIP…' to match /\n$/

[Killed] BlockStatement
adapters/primary/http/ai.extract-data.ts:240:30
               data,
             })
             reply.raw.write(data + '\n')
-          } catch (pdfError) {
-            this.logger.error(
-              'Failed to process PDF',
-              pdfError instanceof Error ? pdfError : new Error(String(pdfError)),
-              { filePath: fileEntry.path }
-            )
-            // Stream error for this PDF
-            const errorLine = JSON.stringify({
-              fileName: fileEntry.path,
-              data: null,
-              success: false,
-              error: pdfError instanceof Error ? pdfError.message : String(pdfError),
-            })
-            reply.raw.write(errorLine + '\n')
-          }
+          } catch (pdfError) {}
         }
 
killedBy: AIExtractDataController extractData() ZIP file extraction should handle per-file error in ZIP and continue streaming
statusReason: expected undefined to be defined

[Killed] ObjectLiteral
adapters/primary/http/ai.extract-data.ts:244:15
             this.logger.error(
               'Failed to process PDF',
               pdfError instanceof Error ? pdfError : new Error(String(pdfError)),
-              { filePath: fileEntry.path }
+              {}
             )
             // Stream error for this PDF
killedBy: AIExtractDataController extractData() ZIP file extraction should log exact "Failed to process PDF" with filePath for ZIP per-file error
statusReason: expected "vi.fn()" to be called with arguments: [ 'Failed to process PDF', …(2) ]

Received:

  1st vi.fn() call:

  [
    "Failed to process PDF",

[Killed] BooleanLiteral
adapters/primary/http/ai.extract-data.ts:250:24
             const errorLine = JSON.stringify({
               fileName: fileEntry.path,
               data: null,
-              success: false,
+              success: true,
               error: pdfError instanceof Error ? pdfError.message : String(pdfError),
             })
killedBy: AIExtractDataController extractData() ZIP file extraction should handle per-file error in ZIP and continue streaming
statusReason: expected undefined to be defined

[Killed] EqualityOperator
adapters/primary/http/ai.extract-data.ts:262:11
         return
       }
 
-      if (fileType === 'pdf') {
+      if (fileType !== 'pdf') {
         // Validate PDF structure using the in-memory buffer.
         // Note: magic-byte detection already confirmed this is a PDF (via detectFileType
killedBy: AIExtractDataController extractData() PDF file extraction should stream extracted text for a PDF file and call raw.end()
statusReason: expected "vi.fn()" to be called with arguments: [ 'Content-Type', …(1) ]

Number of calls: 0

[Killed] ConditionalExpression
adapters/primary/http/ai.extract-data.ts:262:11
         return
       }
 
-      if (fileType === 'pdf') {
+      if (true) {
         // Validate PDF structure using the in-memory buffer.
         // Note: magic-byte detection already confirmed this is a PDF (via detectFileType
killedBy: AIExtractDataController extractData() PDF file extraction should return 422 for unknown fileType
statusReason: expected "vi.fn()" to be called with arguments: [ 422 ]

Received:

  1st vi.fn() call:

  [
-   422,

[Killed] StringLiteral
adapters/primary/http/ai.extract-data.ts:271:50
 
         // Set headers for streaming newline-delimited JSON
         reply.raw.setHeader('Content-Type', 'application/x-ndjson; charset=utf-8')
-        reply.raw.setHeader('Transfer-Encoding', 'chunked')
+        reply.raw.setHeader('Transfer-Encoding', "")
 
         this.logger.debug('Processing PDF file', { path: fileKey })
killedBy: AIExtractDataController extractData() PDF file extraction should stream extracted text for a PDF file and call raw.end()
statusReason: expected "vi.fn()" to be called with arguments: [ 'Transfer-Encoding', 'chunked' ]

Received:

  1st vi.fn() call:

  [
-   "Transfer-Encoding",

[Killed] ArrayDeclaration
adapters/primary/http/ai.extract-data.ts:285:23
               recordInputs: true,
               recordOutputs: true,
             },
-            messages: [
-              {
-                role: 'user',
-                content: [
-                  {
-                    type: 'file',
-                    data: Buffer.from(buffer),
-                    mediaType: 'application/pdf',
-                  },
-                ],
-              },
-            ],
+            messages: [],
             onFinish: ({ finishReason, response, sources, text, totalUsage, usage }) => {
               // Called once when the full output is complete
killedBy: AIExtractDataController extractData() PDF file extraction should call streamText with correct messages including application/pdf mediaType for PDF
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ArrayDeclaration
adapters/primary/http/ai.extract-data.ts:288:26
             messages: [
               {
                 role: 'user',
-                content: [
-                  {
-                    type: 'file',
-                    data: Buffer.from(buffer),
-                    mediaType: 'application/pdf',
-                  },
-                ],
+                content: [],
               },
             ],
killedBy: AIExtractDataController extractData() PDF file extraction should call streamText with correct messages including application/pdf mediaType for PDF
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] StringLiteral
adapters/primary/http/ai.extract-data.ts:292:32
                   {
                     type: 'file',
                     data: Buffer.from(buffer),
-                    mediaType: 'application/pdf',
+                    mediaType: "",
                   },
                 ],
killedBy: AIExtractDataController extractData() PDF file extraction should call streamText with correct messages including application/pdf mediaType for PDF
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
adapters/primary/http/ai.extract-data.ts:297:89
                 ],
               },
             ],
-            onFinish: ({ finishReason, response, sources, text, totalUsage, usage }) => {
-              // Called once when the full output is complete
-              // The reason the model finished generating the text.
-              // "stop" | "length" | "content-filter" | "tool-calls" | "error" | "other" | "unknown"
-              this.logger.debug('Stream finished', { finishReason })
-              this.logger.debug('Stream usage info', { usage, totalUsage })
-              this.logger.debug('streamText.onFinish')
-
-              this.logger.debug('Stream sources', { sources })
-
-              // 'response.messages' is an array of ToolModelMessage and AssistantModelMessage,
-              // which are the model messages that were generated during the stream.
-              // This is useful if you don't need UIMessages - for simpler applications.
-              this.logger.debug('Stream response', { response })
-            },
+            onFinish: ({ finishReason, response, sources, text, totalUsage, usage }) => {},
             onError: ({ error }) => {
               this.logger.error('Stream error', error as Error)
killedBy: AIExtractDataController extractData() PDF file extraction should invoke onFinish callback and log debug messages for PDF
statusReason: expected "vi.fn()" to be called with arguments: [ 'Stream finished', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "Stream finished",

[Killed] BlockStatement
adapters/primary/http/ai.extract-data.ts:334:28
             data,
           })
           reply.raw.write(data + '\n')
-        } catch (pdfError) {
-          this.logger.error(
-            'Failed to process PDF',
-            pdfError instanceof Error ? pdfError : new Error(String(pdfError)),
-            { fileKey }
-          )
-          // Stream error for this PDF
-          const errorLine = JSON.stringify({
-            fileName: fileKey,
-            data: null,
-            success: false,
-            error: pdfError instanceof Error ? pdfError.message : String(pdfError),
-          })
-          reply.raw.write(errorLine + '\n')
-        }
+        } catch (pdfError) {}
 
         // End the stream
killedBy: AIExtractDataController extractData() PDF file extraction should log exact "Failed to process PDF" with fileKey for PDF error
statusReason: expected "vi.fn()" to be called with arguments: [ 'Failed to process PDF', …(2) ]

Number of calls: 0

[Killed] StringLiteral
adapters/primary/http/ai.extract-data.ts:336:13
           reply.raw.write(data + '\n')
         } catch (pdfError) {
           this.logger.error(
-            'Failed to process PDF',
+            "",
             pdfError instanceof Error ? pdfError : new Error(String(pdfError)),
             { fileKey }
killedBy: AIExtractDataController extractData() PDF file extraction should log exact "Failed to process PDF" with fileKey for PDF error
statusReason: expected "vi.fn()" to be called with arguments: [ 'Failed to process PDF', …(2) ]

Received:

  1st vi.fn() call:

  [
-   "Failed to process PDF",

[Killed] BlockStatement
adapters/primary/http/ai.extract-data.ts:356:21
       }
 
       throw new UnprocessableEntityException(`Unsupported file type: ${fileType}`)
-    } catch (error) {
-      this.logger.error(
-        'Error in extractData endpoint',
-        error instanceof Error ? error : new Error(String(error))
-      )
-      const err = error as Error
-      const statusCode = err instanceof BaseException ? err.statusCode : 500
-      const errorMessage =
-        error instanceof BaseException
-          ? error.message // These are intentionally user-facing
-          : 'An unexpected error occurred' // Everything else: hide internals
-      reply.code(statusCode).send({
-        success: false,
-        error: errorMessage,
-      })
-    }
+    } catch (error) {}
   }
 
killedBy: AIExtractDataController extractData() PDF file extraction should return 422 for unknown fileType
statusReason: expected "vi.fn()" to be called with arguments: [ 422 ]

Number of calls: 0

[Killed] StringLiteral
adapters/primary/http/ai.extract-data.ts:358:9
       throw new UnprocessableEntityException(`Unsupported file type: ${fileType}`)
     } catch (error) {
       this.logger.error(
-        'Error in extractData endpoint',
+        "",
         error instanceof Error ? error : new Error(String(error))
       )
killedBy: AIExtractDataController extractData() error handling should return 500 for unexpected errors in extractData
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
-   "Error in extractData endpoint",

[Killed] BooleanLiteral
adapters/primary/http/ai.extract-data.ts:368:18
           ? error.message // These are intentionally user-facing
           : 'An unexpected error occurred' // Everything else: hide internals
       reply.code(statusCode).send({
-        success: false,
+        success: true,
         error: errorMessage,
       })
killedBy: AIExtractDataController extractData() PDF file extraction should return 422 for unknown fileType
statusReason: expected "vi.fn()" to be called with arguments: [ { success: false, …(1) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] ConditionalExpression
adapters/primary/http/ai.extract-data.ts:429:13
       try {
         dto = PresignedUrlDto.validate(body)
       } catch (validationError) {
-        if (validationError instanceof TypeException) {
+        if (true) {
           reply.code(422).send({ success: false, error: (validationError as Error).message })
           return
killedBy: AIExtractDataController generatePresignedUrls() error handling should re-throw non-TypeException validation errors from PresignedUrlDto as 500
statusReason: expected "vi.fn()" to be called with arguments: [ 500 ]

Received:

  1st vi.fn() call:

  [
-   500,

[Killed] BlockStatement
adapters/primary/http/ai.extract-data.ts:429:55
       try {
         dto = PresignedUrlDto.validate(body)
       } catch (validationError) {
-        if (validationError instanceof TypeException) {
-          reply.code(422).send({ success: false, error: (validationError as Error).message })
-          return
-        }
+        if (validationError instanceof TypeException) {}
         throw validationError
       }
killedBy: AIExtractDataController generatePresignedUrls() validation errors should return 422 when body is undefined
statusReason: expected "vi.fn()" to be called with arguments: [ 422 ]

Received:

  1st vi.fn() call:

  [
-   422,

[Killed] BooleanLiteral
adapters/primary/http/ai.extract-data.ts:430:43
         dto = PresignedUrlDto.validate(body)
       } catch (validationError) {
         if (validationError instanceof TypeException) {
-          reply.code(422).send({ success: false, error: (validationError as Error).message })
+          reply.code(422).send({ success: true, error: (validationError as Error).message })
           return
         }
killedBy: AIExtractDataController generatePresignedUrls() validation errors should return 422 when body is undefined
statusReason: expected "vi.fn()" to be called with arguments: [ { success: false, …(1) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] StringLiteral
adapters/primary/http/ai.extract-data.ts:436:24
         throw validationError
       }
 
-      this.logger.info('Generating presigned URLs from metadata', {
+      this.logger.info("", {
         fileCount: dto.files.length,
         files: dto.files.map((f) => ({ filename: f.filename, mimetype: f.mimetype })),
killedBy: AIExtractDataController generatePresignedUrls() successful operations should log file information when generating presigned URLs
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

@@ -1,8 +1,8 @@
  [
