[Killed] ArrowFunction
adapters/primary/http/ai.extract-data.ts:438:30
 
       this.logger.info('Generating presigned URLs from metadata', {
         fileCount: dto.files.length,
-        files: dto.files.map((f) => ({ filename: f.filename, mimetype: f.mimetype })),
+        files: dto.files.map(() => undefined),
       })
 
killedBy: AIExtractDataController generatePresignedUrls() successful operations should log file information when generating presigned URLs
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
    "Generating presigned URLs from metadata",

[Killed] ObjectLiteral
adapters/primary/http/ai.extract-data.ts:438:38
 
       this.logger.info('Generating presigned URLs from metadata', {
         fileCount: dto.files.length,
-        files: dto.files.map((f) => ({ filename: f.filename, mimetype: f.mimetype })),
+        files: dto.files.map((f) => ({})),
       })
 
killedBy: AIExtractDataController generatePresignedUrls() successful operations should log file information when generating presigned URLs
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
    "Generating presigned URLs from metadata",

[Killed] LogicalOperator
adapters/primary/http/ai.extract-data.ts:445:13
       const sanitizedFiles: FileMetadata[] = []
 
       for (const file of dto.files) {
-        if (!file.filename || !file.mimetype) {
+        if (!file.filename && !file.mimetype) {
           throw new UnprocessableEntityException(
             'Each file must have filename and mimetype properties'
killedBy: AIExtractDataController generatePresignedUrls() validation errors should return 422 when file has empty filename
statusReason: expected "vi.fn()" to be called with arguments: [ { success: false, …(1) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] ConditionalExpression
adapters/primary/http/ai.extract-data.ts:445:13
       const sanitizedFiles: FileMetadata[] = []
 
       for (const file of dto.files) {
-        if (!file.filename || !file.mimetype) {
+        if (false) {
           throw new UnprocessableEntityException(
             'Each file must have filename and mimetype properties'
killedBy: AIExtractDataController generatePresignedUrls() validation errors should return 422 when file has empty filename
statusReason: expected "vi.fn()" to be called with arguments: [ { success: false, …(1) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] BlockStatement
adapters/primary/http/ai.extract-data.ts:451:13
           )
         }
 
-        try {
-          // Sanitize filename to remove dangerous characters
-          const sanitizedFilename = sanitizeFilename(file.filename)
-
-          // Validate file extension against allowlist
-          validateFileExtension(sanitizedFilename, ALLOWED_EXTENSIONS)
-
-          // Validate MIME type against allowlist
-          validateMimeType(file.mimetype, ALLOWED_MIME_TYPES)
-
-          sanitizedFiles.push({
-            filename: sanitizedFilename,
-            mimetype: file.mimetype,
-          })
-        } catch (validationError) {
+        try {} catch (validationError) {
           this.logger.warn('File validation failed', {
             filename: file.filename,
killedBy: AIExtractDataController generatePresignedUrls() validation errors should return 422 for invalid file extension
statusReason: expected "vi.fn()" to be called with arguments: [ 422 ]

Received:

  1st vi.fn() call:

  [
-   422,

[Killed] BlockStatement
adapters/primary/http/ai.extract-data.ts:465:35
             filename: sanitizedFilename,
             mimetype: file.mimetype,
           })
-        } catch (validationError) {
-          this.logger.warn('File validation failed', {
-            filename: file.filename,
-            mimeType: file.mimetype,
-            error: (validationError as Error).message,
-          })
-          throw new UnprocessableEntityException(
-            `Invalid file: ${file.filename}. ${(validationError as Error).message}`
-          )
-        }
+        } catch (validationError) {}
       }
 
killedBy: AIExtractDataController generatePresignedUrls() validation errors should return 422 for invalid file extension
statusReason: expected "vi.fn()" to be called with arguments: [ 422 ]

Received:

  1st vi.fn() call:

  [
-   422,

[Killed] LogicalOperator
adapters/primary/http/ai.extract-data.ts:504:23
       })) as MultipartFile[]
 
       // Execute use case to generate presigned URLs
-      const rawFlow = dto.files[0]?.flow ?? 'data-extraction'
+      const rawFlow = dto.files[0]?.flow && 'data-extraction'
       if (!ALLOWED_FLOWS.includes(rawFlow as AllowedFlow)) {
         throw new UnprocessableEntityException(
killedBy: AIExtractDataController generatePresignedUrls() successful operations should generate presigned URLs for valid PDF file
statusReason: expected "vi.fn()" to be called with arguments: [ 200 ]

Number of calls: 0

[Killed] ConditionalExpression
adapters/primary/http/ai.extract-data.ts:505:11
 
       // Execute use case to generate presigned URLs
       const rawFlow = dto.files[0]?.flow ?? 'data-extraction'
-      if (!ALLOWED_FLOWS.includes(rawFlow as AllowedFlow)) {
+      if (true) {
         throw new UnprocessableEntityException(
           `Invalid flow value: "${rawFlow}". Allowed values are: ${ALLOWED_FLOWS.join(', ')}`
killedBy: AIExtractDataController generatePresignedUrls() successful operations should generate presigned URLs for valid PDF file
statusReason: expected "vi.fn()" to be called with arguments: [ 200 ]

Number of calls: 0

[Killed] BooleanLiteral
adapters/primary/http/ai.extract-data.ts:505:11
 
       // Execute use case to generate presigned URLs
       const rawFlow = dto.files[0]?.flow ?? 'data-extraction'
-      if (!ALLOWED_FLOWS.includes(rawFlow as AllowedFlow)) {
+      if (ALLOWED_FLOWS.includes(rawFlow as AllowedFlow)) {
         throw new UnprocessableEntityException(
           `Invalid flow value: "${rawFlow}". Allowed values are: ${ALLOWED_FLOWS.join(', ')}`
killedBy: AIExtractDataController generatePresignedUrls() successful operations should generate presigned URLs for valid PDF file
statusReason: expected "vi.fn()" to be called with arguments: [ 200 ]

Number of calls: 0

[Killed] StringLiteral
adapters/primary/http/ai.extract-data.ts:507:11
       const rawFlow = dto.files[0]?.flow ?? 'data-extraction'
       if (!ALLOWED_FLOWS.includes(rawFlow as AllowedFlow)) {
         throw new UnprocessableEntityException(
-          `Invalid flow value: "${rawFlow}". Allowed values are: ${ALLOWED_FLOWS.join(', ')}`
+          ``
         )
       }
killedBy: AIExtractDataController generatePresignedUrls() validation errors should return 422 when flow has an invalid value
statusReason: expected "vi.fn()" to be called with arguments: [ { success: false, …(1) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] LogicalOperator
adapters/primary/http/ai.extract-data.ts:510:58
           `Invalid flow value: "${rawFlow}". Allowed values are: ${ALLOWED_FLOWS.join(', ')}`
         )
       }
-      const distinctFlows = new Set(dto.files.map((f) => f.flow ?? 'data-extraction'))
+      const distinctFlows = new Set(dto.files.map((f) => f.flow && 'data-extraction'))
       if (distinctFlows.size > 1) {
         throw new UnprocessableEntityException('All files must share the same flow value')
killedBy: AIExtractDataController generatePresignedUrls() validation errors should return 422 when files have different flow values
statusReason: expected "vi.fn()" to be called with arguments: [ 422 ]

Received:

  1st vi.fn() call:

  [
-   422,

[Killed] ArrowFunction
adapters/primary/http/ai.extract-data.ts:510:51
           `Invalid flow value: "${rawFlow}". Allowed values are: ${ALLOWED_FLOWS.join(', ')}`
         )
       }
-      const distinctFlows = new Set(dto.files.map((f) => f.flow ?? 'data-extraction'))
+      const distinctFlows = new Set(dto.files.map(() => undefined))
       if (distinctFlows.size > 1) {
         throw new UnprocessableEntityException('All files must share the same flow value')
killedBy: AIExtractDataController generatePresignedUrls() validation errors should return 422 when files have different flow values
statusReason: expected "vi.fn()" to be called with arguments: [ 422 ]

Received:

  1st vi.fn() call:

  [
-   422,

[Killed] EqualityOperator
adapters/primary/http/ai.extract-data.ts:511:11
         )
       }
       const distinctFlows = new Set(dto.files.map((f) => f.flow ?? 'data-extraction'))
-      if (distinctFlows.size > 1) {
+      if (distinctFlows.size <= 1) {
         throw new UnprocessableEntityException('All files must share the same flow value')
       }
killedBy: AIExtractDataController generatePresignedUrls() successful operations should generate presigned URLs for valid PDF file
statusReason: expected "vi.fn()" to be called with arguments: [ 200 ]

Number of calls: 0

[Killed] EqualityOperator
adapters/primary/http/ai.extract-data.ts:511:11
         )
       }
       const distinctFlows = new Set(dto.files.map((f) => f.flow ?? 'data-extraction'))
-      if (distinctFlows.size > 1) {
+      if (distinctFlows.size >= 1) {
         throw new UnprocessableEntityException('All files must share the same flow value')
       }
killedBy: AIExtractDataController generatePresignedUrls() successful operations should generate presigned URLs for valid PDF file
statusReason: expected "vi.fn()" to be called with arguments: [ 200 ]

Number of calls: 0

[Killed] ArrowFunction
adapters/primary/http/ai.extract-data.ts:519:48
 
       // Restore the original (pre-sanitization) filename in each upload URL entry
       // so the frontend can match it against the browser File.name it originally sent.
-      const uploadUrls = result.uploadUrls.map((u) => ({
-        ...u,
-        filename: originalFilenameMap.get(u.filename) ?? u.filename,
-      }))
+      const uploadUrls = result.uploadUrls.map(() => undefined)
 
       return reply.status(200).send({
killedBy: AIExtractDataController generatePresignedUrls() successful operations should generate presigned URLs for valid PDF file
statusReason: expected "vi.fn()" to be called with arguments: [ { success: true, …(2) } ]

Received:

  1st vi.fn() call:

@@ -1,14 +1,10 @@
  [

[Killed] ObjectLiteral
adapters/primary/http/ai.extract-data.ts:519:56
 
       // Restore the original (pre-sanitization) filename in each upload URL entry
       // so the frontend can match it against the browser File.name it originally sent.
-      const uploadUrls = result.uploadUrls.map((u) => ({
-        ...u,
-        filename: originalFilenameMap.get(u.filename) ?? u.filename,
-      }))
+      const uploadUrls = result.uploadUrls.map((u) => ({}))
 
       return reply.status(200).send({
killedBy: AIExtractDataController generatePresignedUrls() successful operations should generate presigned URLs for valid PDF file
statusReason: expected "vi.fn()" to be called with arguments: [ { success: true, …(2) } ]

Received:

  1st vi.fn() call:

@@ -1,14 +1,10 @@
  [

[Killed] LogicalOperator
adapters/primary/http/ai.extract-data.ts:521:19
       // so the frontend can match it against the browser File.name it originally sent.
       const uploadUrls = result.uploadUrls.map((u) => ({
         ...u,
-        filename: originalFilenameMap.get(u.filename) ?? u.filename,
+        filename: originalFilenameMap.get(u.filename) && u.filename,
       }))
 
killedBy: AIExtractDataController generatePresignedUrls() edge cases should restore original filename in response when sanitization changes it
statusReason: expected 'my_document.pdf' to be 'my document.pdf' // Object.is equality

[Killed] ObjectLiteral
adapters/primary/http/ai.extract-data.ts:524:37
         filename: originalFilenameMap.get(u.filename) ?? u.filename,
       }))
 
-      return reply.status(200).send({
-        success: true,
-        data: { uploadUrls },
-        message: 'Presigned URLs generated successfully',
-      })
+      return reply.status(200).send({})
     } catch (error) {
       this.logger.error(
killedBy: AIExtractDataController generatePresignedUrls() successful operations should generate presigned URLs for valid PDF file
statusReason: expected "vi.fn()" to be called with arguments: [ { success: true, …(2) } ]

Received:

  1st vi.fn() call:

  [
-   {

[Killed] BooleanLiteral
adapters/primary/http/ai.extract-data.ts:525:18
       }))
 
       return reply.status(200).send({
-        success: true,
+        success: false,
         data: { uploadUrls },
         message: 'Presigned URLs generated successfully',
killedBy: AIExtractDataController generatePresignedUrls() successful operations should generate presigned URLs for valid PDF file
statusReason: expected "vi.fn()" to be called with arguments: [ { success: true, …(2) } ]

Received:

  1st vi.fn() call:

@@ -8,8 +8,8 @@
            "uploadUrl": "https://r2.example.com/presigned-url",

[Killed] StringLiteral
adapters/primary/http/ai.extract-data.ts:527:18
       return reply.status(200).send({
         success: true,
         data: { uploadUrls },
-        message: 'Presigned URLs generated successfully',
+        message: "",
       })
     } catch (error) {
killedBy: AIExtractDataController generatePresignedUrls() successful operations should generate presigned URLs for valid PDF file
statusReason: expected "vi.fn()" to be called with arguments: [ { success: true, …(2) } ]

Received:

  1st vi.fn() call:

@@ -7,9 +7,9 @@
            "filename": "document.pdf",

[Killed] BlockStatement
adapters/primary/http/ai.extract-data.ts:529:21
         data: { uploadUrls },
         message: 'Presigned URLs generated successfully',
       })
-    } catch (error) {
-      this.logger.error(
-        'Error generating presigned URLs',
-        error instanceof Error ? error : new Error(String(error))
-      )
-      const err = error as Error
-      const statusCode = err instanceof BaseException ? err.statusCode : 500
-      const errorMessage =
-        error instanceof BaseException
-          ? error.message // These are intentionally user-facing
-          : 'An unexpected error occurred' // Everything else: hide internals
-      reply.code(statusCode).send({
-        success: false,
-        error: errorMessage,
-      })
-    }
+    } catch (error) {}
   }
 }
killedBy: AIExtractDataController generatePresignedUrls() validation errors should return 422 when files array is empty
statusReason: expected "vi.fn()" to be called with arguments: [ 422 ]

Number of calls: 0

[Killed] StringLiteral
adapters/primary/http/ai.extract-data.ts:531:9
       })
     } catch (error) {
       this.logger.error(
-        'Error generating presigned URLs',
+        "",
         error instanceof Error ? error : new Error(String(error))
       )
killedBy: AIExtractDataController generatePresignedUrls() error handling should return 500 for unexpected errors
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
-   "Error generating presigned URLs",
