[Killed] ObjectLiteral
adapters/secondary/repositories/ai-chat-options.repository.ts:70:66
   async getChatOptionsByChatTypeId(
     chatTypeId: ChatIdType
   ): Promise<Pick<DBChatAiOptions, 'prompt'> | null> {
-    this.logger.info('Fetching chat AI options by chat type ID', { chatTypeId })
+    this.logger.info('Fetching chat AI options by chat type ID', {})
 
     try {
killedBy: AIChatOptionsRepository getChatOptionsByChatOptionsByChatTypeId should return prompt when chat AI options are found
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
    "Fetching chat AI options by chat type ID",

[Killed] StringLiteral
adapters/secondary/repositories/ai-chat-options.repository.ts:70:22
   async getChatOptionsByChatTypeId(
     chatTypeId: ChatIdType
   ): Promise<Pick<DBChatAiOptions, 'prompt'> | null> {
-    this.logger.info('Fetching chat AI options by chat type ID', { chatTypeId })
+    this.logger.info("", { chatTypeId })
 
     try {
killedBy: AIChatOptionsRepository getChatOptionsByChatOptionsByChatTypeId should return prompt when chat AI options are found
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
-   "Fetching chat AI options by chat type ID",

[Killed] StringLiteral
adapters/secondary/repositories/ai-chat-options.repository.ts:83:25
 
       return result[0] ?? null
     } catch (error) {
-      this.logger.error('Error fetching chat AI options', error as Error, { chatTypeId })
+      this.logger.error("", error as Error, { chatTypeId })
       throw error
     }
killedBy: AIChatOptionsRepository getChatOptionsByChatOptionsByChatTypeId should log error and throw when database query fails
statusReason: expected "vi.fn()" to be called with arguments: [ …(3) ]

Received:

  1st vi.fn() call:

@@ -1,7 +1,7 @@
  [
