[NoCoverage] BlockStatement
adapters/secondary/services/logger.service.ts:39:25
    * - Log level: Determined by LOG_LEVEL environment variable
    */
   constructor(existingLogger?: pino.Logger) {
-    if (existingLogger) {
-      this.logger = existingLogger
-      return
-    }
+    if (existingLogger) {}
 
     const isDevelopment = EnvConfig.NODE_ENV !== 'production'

[Killed] EqualityOperator
adapters/secondary/services/logger.service.ts:44:27
       return
     }
 
-    const isDevelopment = EnvConfig.NODE_ENV !== 'production'
+    const isDevelopment = EnvConfig.NODE_ENV === 'production'
 
     this.logger = pino({
killedBy: PinoLoggerService constructor should initialize pino logger with default log level
statusReason: expected "vi.fn()" to be called with arguments: [ { level: 'info', …(3) } ]

Received:

  1st vi.fn() call:

  [
    {

[Survived] ConditionalExpression
adapters/secondary/services/logger.service.ts:44:27
       return
     }
 
-    const isDevelopment = EnvConfig.NODE_ENV !== 'production'
+    const isDevelopment = true
 
     this.logger = pino({

[Killed] StringLiteral
adapters/secondary/services/logger.service.ts:51:11
       redact: {
         paths: SENSITIVE_FIELDS.flatMap((field) => [
           field,
-          `*.${field}`,
+          ``,
           `*.*.${field}`,
           `*.record.${field}`,
killedBy: PinoLoggerService constructor should initialize pino logger with default log level
statusReason: expected "vi.fn()" to be called with arguments: [ { level: 'info', …(3) } ]

Received:

  1st vi.fn() call:

@@ -1,28 +1,253 @@
  [

[Killed] StringLiteral
adapters/secondary/services/logger.service.ts:53:11
           field,
           `*.${field}`,
           `*.*.${field}`,
-          `*.record.${field}`,
+          ``,
           `*.record.*.${field}`,
         ]),
killedBy: PinoLoggerService constructor should initialize pino logger with default log level
statusReason: expected "vi.fn()" to be called with arguments: [ { level: 'info', …(3) } ]

Received:

  1st vi.fn() call:

@@ -1,28 +1,253 @@
  [

[Killed] ObjectLiteral
adapters/secondary/services/logger.service.ts:58:13
         ]),
         censor: '[REDACTED]',
       },
-      base: {
-        pid: process.pid,
-        hostname: os.hostname(),
-        service: EnvConfig.SERVICE_NAME,
-        env: EnvConfig.NODE_ENV,
-        version: EnvConfig.APP_VERSION,
-      },
+      base: {},
       ...(isDevelopment && {
         transport: {
killedBy: PinoLoggerService constructor should initialize pino logger with default log level
statusReason: expected "vi.fn()" to be called with arguments: [ { level: 'info', …(3) } ]

Received:

  1st vi.fn() call:

@@ -1,28 +1,247 @@
  [

[Killed] BooleanLiteral
adapters/secondary/services/logger.service.ts:69:23
         transport: {
           target: 'pino-pretty',
           options: {
-            colorize: true,
+            colorize: false,
           },
         },
killedBy: PinoLoggerService constructor should initialize pino logger with default log level
statusReason: expected "vi.fn()" to be called with arguments: [ { level: 'info', …(3) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] BlockStatement
adapters/secondary/services/logger.service.ts:88:62
    * logger.info('User registered', { userId: 'abc123', email: 'user@example.com' })
    * ```
    */
-  info(message: string, context?: Record<string, any>): void {
-    this.logger.info(context, message)
-  }
+  info(message: string, context?: Record<string, any>): void {}
 
   /**
killedBy: PinoLoggerService info() should call pino info with message only
statusReason: expected "vi.fn()" to be called with arguments: [ undefined, 'Test info message' ]

Number of calls: 0

[Killed] BlockStatement
adapters/secondary/services/logger.service.ts:110:78
    * }
    * ```
    */
-  error(message: string, error?: Error, context?: Record<string, any>): void {
-    this.logger.error({ ...context, err: error }, message)
-  }
+  error(message: string, error?: Error, context?: Record<string, any>): void {}
 
   /**
killedBy: PinoLoggerService error() should call pino error with message only
statusReason: expected "vi.fn()" to be called with arguments: [ { err: undefined }, …(1) ]

Number of calls: 0

[Killed] BlockStatement
adapters/secondary/services/logger.service.ts:127:62
    * logger.warn('API rate limit approaching', { remaining: 10, limit: 100 })
    * ```
    */
-  warn(message: string, context?: Record<string, any>): void {
-    this.logger.warn(context, message)
-  }
+  warn(message: string, context?: Record<string, any>): void {}
 
   /**
killedBy: PinoLoggerService warn() should call pino warn with message only
statusReason: expected "vi.fn()" to be called with arguments: [ undefined, 'Test warning message' ]

Number of calls: 0

[Killed] BlockStatement
adapters/secondary/services/logger.service.ts:144:63
    * logger.debug('Cache hit', { key: 'user:123', ttl: 3600 })
    * ```
    */
-  debug(message: string, context?: Record<string, any>): void {
-    this.logger.debug(context, message)
-  }
+  debug(message: string, context?: Record<string, any>): void {}
 
   /**
killedBy: PinoLoggerService debug() should call pino debug with message only
statusReason: expected "vi.fn()" to be called with arguments: [ undefined, 'Test debug message' ]

Number of calls: 0
