[NoCoverage] BlockStatement
infrastructure/ai/tools/getText.ts:25:9
    * @param filePath - The file name to read (id: 'heart-of-darkness.txt')
    */
   constructor(dataFolder: string, filePath: FilePathSchema) {
-    try {
-      FileExtensionSchema.parse(filePath)
-    } catch (error) {
+    try {} catch (error) {
       if (error instanceof z.ZodError) {
         throw error

[NoCoverage] BlockStatement
infrastructure/ai/tools/getText.ts:27:21
   constructor(dataFolder: string, filePath: FilePathSchema) {
     try {
       FileExtensionSchema.parse(filePath)
-    } catch (error) {
-      if (error instanceof z.ZodError) {
-        throw error
-      }
-    }
+    } catch (error) {}
     this.file = filePath
     this.filePath = path.join(process.cwd(), dataFolder, filePath)

[NoCoverage] ConditionalExpression
infrastructure/ai/tools/getText.ts:28:11
     try {
       FileExtensionSchema.parse(filePath)
     } catch (error) {
-      if (error instanceof z.ZodError) {
+      if (false) {
         throw error
       }

[NoCoverage] BlockStatement
infrastructure/ai/tools/getText.ts:28:40
     try {
       FileExtensionSchema.parse(filePath)
     } catch (error) {
-      if (error instanceof z.ZodError) {
-        throw error
-      }
+      if (error instanceof z.ZodError) {}
     }
     this.file = filePath

[NoCoverage] BooleanLiteral
infrastructure/ai/tools/getText.ts:48:11
       const content = await fs.readFile(this.filePath, 'utf8')
 
       // Return undefined if content is empty
-      if (!content) {
+      if (content) {
         return undefined
       }

[NoCoverage] BlockStatement
infrastructure/ai/tools/getText.ts:48:21
       const content = await fs.readFile(this.filePath, 'utf8')
 
       // Return undefined if content is empty
-      if (!content) {
-        return undefined
-      }
+      if (!content) {}
 
       // Save the successfully retrieved content to state

[NoCoverage] BlockStatement
infrastructure/ai/tools/getText.ts:55:21
       // Save the successfully retrieved content to state
       this.fileContents.set(this.filePath, content)
       return content
-    } catch (error) {
-      // Handle file not found error
-      const nodeError = error as NodeJS.ErrnoException
-      if (nodeError.code === 'ENOENT') {
-        throw new Error(`Error reading file "${this.filePath}": File not found: ${this.file}`, {
-          cause: error,
-        })
-      }
-      // Handle other errors
-      throw new Error(
-        `Error reading file "${this.filePath}": ${error instanceof Error ? error.message : 'Unknown error'}`,
-        { cause: error }
-      )
-    }
+    } catch (error) {}
   }
 

[NoCoverage] EqualityOperator
infrastructure/ai/tools/getText.ts:58:11
     } catch (error) {
       // Handle file not found error
       const nodeError = error as NodeJS.ErrnoException
-      if (nodeError.code === 'ENOENT') {
+      if (nodeError.code !== 'ENOENT') {
         throw new Error(`Error reading file "${this.filePath}": File not found: ${this.file}`, {
           cause: error,

[NoCoverage] BlockStatement
infrastructure/ai/tools/getText.ts:58:40
     } catch (error) {
       // Handle file not found error
       const nodeError = error as NodeJS.ErrnoException
-      if (nodeError.code === 'ENOENT') {
-        throw new Error(`Error reading file "${this.filePath}": File not found: ${this.file}`, {
-          cause: error,
-        })
-      }
+      if (nodeError.code === 'ENOENT') {}
       // Handle other errors
       throw new Error(

[NoCoverage] StringLiteral
infrastructure/ai/tools/getText.ts:59:25
       // Handle file not found error
       const nodeError = error as NodeJS.ErrnoException
       if (nodeError.code === 'ENOENT') {
-        throw new Error(`Error reading file "${this.filePath}": File not found: ${this.file}`, {
+        throw new Error(``, {
           cause: error,
         })

[NoCoverage] StringLiteral
infrastructure/ai/tools/getText.ts:65:9
       }
       // Handle other errors
       throw new Error(
-        `Error reading file "${this.filePath}": ${error instanceof Error ? error.message : 'Unknown error'}`,
+        ``,
         { cause: error }
       )

[NoCoverage] ObjectLiteral
infrastructure/ai/tools/getText.ts:66:9
       // Handle other errors
       throw new Error(
         `Error reading file "${this.filePath}": ${error instanceof Error ? error.message : 'Unknown error'}`,
-        { cause: error }
+        {}
       )
     }

[NoCoverage] BlockStatement
infrastructure/ai/tools/getText.ts:93:46
    * Clear cached content for a specific file or all files
    * @param textPath - Optional path to clear specific file, or clear all if not provided
    */
-  public clearCache(textPath?: string): void {
-    if (textPath) {
-      this.fileContents.delete(textPath)
-    } else {
-      this.fileContents.clear()
-    }
-  }
+  public clearCache(textPath?: string): void {}
 
   /**

[NoCoverage] BlockStatement
infrastructure/ai/tools/getText.ts:94:19
    * @param textPath - Optional path to clear specific file, or clear all if not provided
    */
   public clearCache(textPath?: string): void {
-    if (textPath) {
-      this.fileContents.delete(textPath)
-    } else {
+    if (textPath) {} else {
       this.fileContents.clear()
     }

[NoCoverage] BlockStatement
infrastructure/ai/tools/getText.ts:96:12
   public clearCache(textPath?: string): void {
     if (textPath) {
       this.fileContents.delete(textPath)
-    } else {
-      this.fileContents.clear()
-    }
+    } else {}
   }
 
