[NoCoverage] StringLiteral
src/shared/constants/ai-constants.ts:7:40
   .object({
     total: z.number().describe('The total amount of the invoice.'),
     currency: z.string().describe('The currency of the total amount.'),
-    invoiceNumber: z.string().describe('The invoice number.'),
+    invoiceNumber: z.string().describe(""),
     companyAddress: z
       .string()
