[NoCoverage] BlockStatement
src/shared/utils/weakmap.util.ts:107:37
    * @param {Key} key - The key to add or update.
    * @param {Value} value - The value to associate with the key.
    */
-  set(key: Key, value: Value): void {
-    this.weakMap.set(key, value)
-  }
+  set(key: Key, value: Value): void {}
 }
 
