[Killed] BlockStatement
adapters/primary/http/ai.config.controller.ts:45:46
    *
    * @param app - The Fastify instance to register routes on.
    */
-  registerRoutes(app: FastifyInstance): void {
-    app.get(
-      '/ai/chats/config',
-      {
-        preHandler: [authMiddleware],
-      },
-      this.getAIChatDetails.bind(this)
-    )
-    app.put(
-      '/ai/chats/config',
-      {
-        preHandler: [authMiddleware, requireRole(['admin', 'moderator'])],
-      },
-      this.updateAIChatDetails.bind(this)
-    )
-    app.post(
-      '/ai/chats/config',
-      {
-        preHandler: [authMiddleware, requireRole(['admin', 'moderator'])],
-      },
-      this.createAIChatType.bind(this)
-    )
-  }
+  registerRoutes(app: FastifyInstance): void {}
 
   /**
killedBy: AIConfigController registerRoutes() should register GET /ai/chats/config route
statusReason: expected "vi.fn()" to be called with arguments: [ '/ai/chats/config', …(2) ]

Number of calls: 0

[Killed] StringLiteral
adapters/primary/http/ai.config.controller.ts:47:7
    */
   registerRoutes(app: FastifyInstance): void {
     app.get(
-      '/ai/chats/config',
+      "",
       {
         preHandler: [authMiddleware],
killedBy: AIConfigController registerRoutes() should register GET /ai/chats/config route
statusReason: expected "vi.fn()" to be called with arguments: [ '/ai/chats/config', …(2) ]

Received:

  1st vi.fn() call:

  [
-   "/ai/chats/config",

[Killed] ObjectLiteral
adapters/primary/http/ai.config.controller.ts:48:7
   registerRoutes(app: FastifyInstance): void {
     app.get(
       '/ai/chats/config',
-      {
-        preHandler: [authMiddleware],
-      },
+      {},
       this.getAIChatDetails.bind(this)
     )
killedBy: AIConfigController registerRoutes() should register GET /ai/chats/config route
statusReason: expected "vi.fn()" to be called with arguments: [ '/ai/chats/config', …(2) ]

Received:

  1st vi.fn() call:

  [
    "/ai/chats/config",

[Survived] StringLiteral
adapters/primary/http/ai.config.controller.ts:56:51
     app.put(
       '/ai/chats/config',
       {
-        preHandler: [authMiddleware, requireRole(['admin', 'moderator'])],
+        preHandler: [authMiddleware, requireRole(["", 'moderator'])],
       },
       this.updateAIChatDetails.bind(this)

[Killed] ArrayDeclaration
adapters/primary/http/ai.config.controller.ts:63:50
     app.post(
       '/ai/chats/config',
       {
-        preHandler: [authMiddleware, requireRole(['admin', 'moderator'])],
+        preHandler: [authMiddleware, requireRole([])],
       },
       this.createAIChatType.bind(this)
killedBy: AIConfigController registerRoutes() should register GET /ai/chats/config route
statusReason: requireRole: requiredRoles must be a non-empty array. Empty arrays are not allowed as they would deny all access. If you need to allow all authenticated users, do not use this middleware.

[Killed] BlockStatement
adapters/primary/http/ai.config.controller.ts:114:9
       userAgent: request.headers['user-agent'] ?? null,
     }
 
-    try {
-      const result = await this.getChatDetailsUseCase.execute(auditContext)
-
-      this.logger.debug(JSON.stringify(result))
-
-      reply.code(200).send({
-        success: true,
-        data: result,
-      })
-    } catch (error) {
+    try {} catch (error) {
       this.logger.error(
         'Error in getAIChatDetails',
killedBy: AIConfigController getAIChatDetails() successful scenarios should fetch and return chat type details successfully
statusReason: expected "vi.fn()" to be called with arguments: [ 200 ]

Number of calls: 0

[Killed] BooleanLiteral
adapters/primary/http/ai.config.controller.ts:120:18
       this.logger.debug(JSON.stringify(result))
 
       reply.code(200).send({
-        success: true,
+        success: false,
         data: result,
       })
killedBy: AIConfigController getAIChatDetails() successful scenarios should fetch and return chat type details successfully
statusReason: expected "vi.fn()" to be called with arguments: [ { success: true, data: [ …(2) ] } ]

Received:

  1st vi.fn() call:

@@ -20,8 +20,8 @@
          "seoFriendlyBase64Id": "XyZaBcDeFgHiJkLmNoPqRs",

[Killed] BlockStatement
adapters/primary/http/ai.config.controller.ts:123:21
         success: true,
         data: result,
       })
-    } catch (error) {
-      this.logger.error(
-        'Error in getAIChatDetails',
-        error instanceof Error ? error : new Error(String(error))
-      )
-      const err = error as Error
-      const statusCode = err instanceof BaseException ? err.statusCode : 500
-      const errorMessage =
-        error instanceof BaseException
-          ? error.message // These are intentionally user-facing
-          : 'An unexpected error occurred' // Everything else: hide internals
-      reply.code(statusCode).send({
-        success: false,
-        error: errorMessage,
-      })
-    }
+    } catch (error) {}
   }
 
killedBy: AIConfigController getAIChatDetails() error handling should handle InternalErrorException with 500 status code
statusReason: expected "vi.fn()" to be called with arguments: [ 500 ]

Number of calls: 0

[Killed] ObjectLiteral
adapters/primary/http/ai.config.controller.ts:134:35
         error instanceof BaseException
           ? error.message // These are intentionally user-facing
           : 'An unexpected error occurred' // Everything else: hide internals
-      reply.code(statusCode).send({
-        success: false,
-        error: errorMessage,
-      })
+      reply.code(statusCode).send({})
     }
   }
killedBy: AIConfigController getAIChatDetails() error handling should handle InternalErrorException with 500 status code
statusReason: expected "vi.fn()" to be called with arguments: [ { success: false, …(1) } ]

Received:

  1st vi.fn() call:

  [
-   {

[Killed] BlockStatement
adapters/primary/http/ai.config.controller.ts:185:9
       userAgent: request.headers['user-agent'] ?? null,
     }
 
-    try {
-      const body = request.body as components['schemas']['UpdateAIChatTypeRequest']
-      const dto = PutChatTypeDto.validate(body)
-      const result = await this.putChatDetailsUseCase.execute(auditContext, dto)
-      if (!result) {
-        reply.code(404).send({
-          success: false,
-          error: 'AI chat type not found or update failed',
-        })
-        return
-      }
-      reply.status(204).send()
-    } catch (error) {
+    try {} catch (error) {
       this.logger.error(
         'Error in updateAIChatDetails',
killedBy: AIConfigController updateAIChatDetails() successful scenarios should update chat type details successfully with all fields
statusReason: expected "vi.fn()" to be called with arguments: [ 204 ]

Number of calls: 0

[Killed] BooleanLiteral
adapters/primary/http/ai.config.controller.ts:189:11
       const body = request.body as components['schemas']['UpdateAIChatTypeRequest']
       const dto = PutChatTypeDto.validate(body)
       const result = await this.putChatDetailsUseCase.execute(auditContext, dto)
-      if (!result) {
+      if (result) {
         reply.code(404).send({
           success: false,
killedBy: AIConfigController updateAIChatDetails() successful scenarios should update chat type details successfully with all fields
statusReason: expected "vi.fn()" to be called with arguments: [ 204 ]

Number of calls: 0

[Killed] ConditionalExpression
adapters/primary/http/ai.config.controller.ts:189:11
       const body = request.body as components['schemas']['UpdateAIChatTypeRequest']
       const dto = PutChatTypeDto.validate(body)
       const result = await this.putChatDetailsUseCase.execute(auditContext, dto)
-      if (!result) {
+      if (false) {
         reply.code(404).send({
           success: false,
killedBy: AIConfigController updateAIChatDetails() not found scenarios should return 404 when chat type is not found
statusReason: expected "vi.fn()" to be called with arguments: [ 404 ]

Number of calls: 0

[Killed] BooleanLiteral
adapters/primary/http/ai.config.controller.ts:191:20
       const result = await this.putChatDetailsUseCase.execute(auditContext, dto)
       if (!result) {
         reply.code(404).send({
-          success: false,
+          success: true,
           error: 'AI chat type not found or update failed',
         })
killedBy: AIConfigController updateAIChatDetails() not found scenarios should return 404 when chat type is not found
statusReason: expected "vi.fn()" to be called with arguments: [ { success: false, …(1) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] BlockStatement
adapters/primary/http/ai.config.controller.ts:197:21
         return
       }
       reply.status(204).send()
-    } catch (error) {
-      this.logger.error(
-        'Error in updateAIChatDetails',
-        error instanceof Error ? error : new Error(String(error))
-      )
-      const err = error as Error
-      const statusCode = err instanceof BaseException ? err.statusCode : 500
-      const errorMessage =
-        error instanceof BaseException
-          ? error.message // These are intentionally user-facing
-          : 'An unexpected error occurred' // Everything else: hide internals
-      reply.code(statusCode).send({
-        success: false,
-        error: errorMessage,
-      })
-    }
+    } catch (error) {}
   }
 
killedBy: AIConfigController updateAIChatDetails() validation failures should return 400 when id is missing
statusReason: expected "vi.fn()" to be called with arguments: [ 400 ]

Number of calls: 0

[Killed] StringLiteral
adapters/primary/http/ai.config.controller.ts:199:9
       reply.status(204).send()
     } catch (error) {
       this.logger.error(
-        'Error in updateAIChatDetails',
+        "",
         error instanceof Error ? error : new Error(String(error))
       )
killedBy: AIConfigController updateAIChatDetails() error handling should handle InternalErrorException with 500 status code
statusReason: expected "vi.fn()" to be called with arguments: [ Array(2) ]

Received:

  1st vi.fn() call:

  [
-   "Error in updateAIChatDetails",

[Killed] BlockStatement
adapters/primary/http/ai.config.controller.ts:273:9
       userAgent: request.headers['user-agent'] ?? null,
     }
 
-    try {
-      const body = request.body as components['schemas']['CreateAIChatTypeRequest']
-      const dto = PostChatType.validate(body)
-      const createdChatType = await this.postChatTypesUseCase.execute(auditContext, dto)
-      reply.code(201).send({
-        success: true,
-        data: {
-          id: createdChatType.id,
-          name: createdChatType.name,
-          description: createdChatType.description,
-          rag: createdChatType.rag,
-          seoFriendlyId: createdChatType.seoFriendlyId,
-          seoFriendlyBase64Id: createdChatType.seoFriendlyBase64Id,
-          createdAt: createdChatType.createdAt,
-          updatedAt: createdChatType.updatedAt,
-        },
-      })
-    } catch (error) {
+    try {} catch (error) {
       this.logger.error(
         'Error in createAIChatType',
killedBy: AIConfigController createAIChatType() successful scenarios should create a chat type successfully and respond with 201
statusReason: expected "vi.fn()" to be called with arguments: [ 201 ]

Number of calls: 0

[Killed] BooleanLiteral
adapters/primary/http/ai.config.controller.ts:278:18
       const dto = PostChatType.validate(body)
       const createdChatType = await this.postChatTypesUseCase.execute(auditContext, dto)
       reply.code(201).send({
-        success: true,
+        success: false,
         data: {
           id: createdChatType.id,
killedBy: AIConfigController createAIChatType() successful scenarios should create a chat type successfully and respond with 201
statusReason: expected "vi.fn()" to be called with arguments: [ { success: true, data: { …(8) } } ]

Received:

  1st vi.fn() call:

@@ -8,8 +8,8 @@
        "rag": false,

[Killed] ObjectLiteral
adapters/primary/http/ai.config.controller.ts:279:15
       const createdChatType = await this.postChatTypesUseCase.execute(auditContext, dto)
       reply.code(201).send({
         success: true,
-        data: {
-          id: createdChatType.id,
-          name: createdChatType.name,
-          description: createdChatType.description,
-          rag: createdChatType.rag,
-          seoFriendlyId: createdChatType.seoFriendlyId,
-          seoFriendlyBase64Id: createdChatType.seoFriendlyBase64Id,
-          createdAt: createdChatType.createdAt,
-          updatedAt: createdChatType.updatedAt,
-        },
+        data: {},
       })
     } catch (error) {
killedBy: AIConfigController createAIChatType() successful scenarios should create a chat type successfully and respond with 201
statusReason: expected "vi.fn()" to be called with arguments: [ { success: true, data: { …(8) } } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] BlockStatement
adapters/primary/http/ai.config.controller.ts:290:21
           updatedAt: createdChatType.updatedAt,
         },
       })
-    } catch (error) {
-      this.logger.error(
-        'Error in createAIChatType',
-        error instanceof Error ? error : new Error(String(error))
-      )
-      const err = error as Error
-      const statusCode = err instanceof BaseException ? err.statusCode : 500
-      const errorMessage =
-        error instanceof BaseException
-          ? error.message // These are intentionally user-facing
-          : 'An unexpected error occurred' // Everything else: hide internals
-      reply.code(statusCode).send({
-        success: false,
-        error: errorMessage,
-      })
-    }
+    } catch (error) {}
   }
 }
killedBy: AIConfigController createAIChatType() validation failures should return 400 when name is missing
statusReason: expected "vi.fn()" to be called with arguments: [ 400 ]

Number of calls: 0

[Killed] StringLiteral
adapters/primary/http/ai.config.controller.ts:292:9
       })
     } catch (error) {
       this.logger.error(
-        'Error in createAIChatType',
+        "",
         error instanceof Error ? error : new Error(String(error))
       )
killedBy: AIConfigController createAIChatType() error handling should return 500 on generic error from use case
statusReason: expected "vi.fn()" to be called with arguments: [ 'Error in createAIChatType', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "Error in createAIChatType",
