[Killed] BlockStatement
adapters/secondary/services/email.service.ts:34:67
     this.resendClient = new Resend(obscured.value(apiKey))
   }
 
-  async sendWelcomeEmail(to: string, name: string): Promise<void> {
-    this.logger.info('Sending welcome email', { to, name })
-
-    const emailData = {
-      from: EnvConfig.EMAIL_FROM_ADDRESS,
-      to,
-      subject: 'Hello World',
-      html: '<p>Congrats on sending your <strong>first email</strong>!</p>',
-    }
-
-    const { data, error } = await this.resendClient.emails.send(emailData)
-
-    if (error) {
-      this.logger.error('Failed to send welcome email', new Error(error.message), { to, name })
-      throw new ExternalServiceException('Failed to send welcome email', { error })
-    }
-    if (data) {
-      this.logger.info('Email sent successfully', { id: data.id, to, name })
-    }
-  }
+  async sendWelcomeEmail(to: string, name: string): Promise<void> {}
 
   async sendPasswordResetEmail(to: string, resetToken: string): Promise<void> {
killedBy: EmailService sendWelcomeEmail should send welcome email successfully
statusReason: expected "vi.fn()" to be called with arguments: [ 'Sending welcome email', …(1) ]

Number of calls: 0

[Killed] BlockStatement
adapters/secondary/services/email.service.ts:46:16
 
     const { data, error } = await this.resendClient.emails.send(emailData)
 
-    if (error) {
-      this.logger.error('Failed to send welcome email', new Error(error.message), { to, name })
-      throw new ExternalServiceException('Failed to send welcome email', { error })
-    }
+    if (error) {}
     if (data) {
       this.logger.info('Email sent successfully', { id: data.id, to, name })
killedBy: EmailService sendWelcomeEmail should throw ExternalServiceException when Resend API returns error
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
adapters/secondary/services/email.service.ts:50:15
       this.logger.error('Failed to send welcome email', new Error(error.message), { to, name })
       throw new ExternalServiceException('Failed to send welcome email', { error })
     }
-    if (data) {
-      this.logger.info('Email sent successfully', { id: data.id, to, name })
-    }
+    if (data) {}
   }
 
killedBy: EmailService sendWelcomeEmail should send welcome email successfully
statusReason: expected "vi.fn()" to be called with arguments: [ 'Email sent successfully', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "Email sent successfully",

[Killed] ConditionalExpression
adapters/secondary/services/email.service.ts:50:9
       this.logger.error('Failed to send welcome email', new Error(error.message), { to, name })
       throw new ExternalServiceException('Failed to send welcome email', { error })
     }
-    if (data) {
+    if (true) {
       this.logger.info('Email sent successfully', { id: data.id, to, name })
     }
killedBy: EmailService sendWelcomeEmail - Mutation Coverage should not log success message when data is null/undefined but no error
statusReason: Cannot read properties of null (reading 'id')

[Killed] ObjectLiteral
adapters/secondary/services/email.service.ts:51:51
       throw new ExternalServiceException('Failed to send welcome email', { error })
     }
     if (data) {
-      this.logger.info('Email sent successfully', { id: data.id, to, name })
+      this.logger.info('Email sent successfully', {})
     }
   }
killedBy: EmailService sendWelcomeEmail should send welcome email successfully
statusReason: expected "vi.fn()" to be called with arguments: [ 'Email sent successfully', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "Email sent successfully",

[Killed] BlockStatement
adapters/secondary/services/email.service.ts:55:79
     }
   }
 
-  async sendPasswordResetEmail(to: string, resetToken: string): Promise<void> {
-    this.logger.info('Sending password reset email', { to })
-
-    const emailData = {
-      to,
-      from: 'noreply@norbertsSpark.com',
-      subject: 'Reset Your Password',
-      html: `<p>Click here to reset: <a href="https://example.com/reset/${resetToken}">Reset Password</a></p>`,
-    }
-
-    // await this.sendGridClient.send(emailData)
-    this.logger.info('Password reset email sent', { to })
-  }
+  async sendPasswordResetEmail(to: string, resetToken: string): Promise<void> {}
 }
 
killedBy: EmailService sendPasswordResetEmail should log sending password reset email
statusReason: expected "vi.fn()" to be called with arguments: [ Array(2) ]

Number of calls: 0

[Killed] ObjectLiteral
adapters/secondary/services/email.service.ts:56:54
   }
 
   async sendPasswordResetEmail(to: string, resetToken: string): Promise<void> {
-    this.logger.info('Sending password reset email', { to })
+    this.logger.info('Sending password reset email', {})
 
     const emailData = {
killedBy: EmailService sendPasswordResetEmail should log sending password reset email
statusReason: expected "vi.fn()" to be called with arguments: [ Array(2) ]

Received:

  1st vi.fn() call:

  [
    "Sending password reset email",

[Survived] StringLiteral
adapters/secondary/services/email.service.ts:62:13
       to,
       from: 'noreply@norbertsSpark.com',
       subject: 'Reset Your Password',
-      html: `<p>Click here to reset: <a href="https://example.com/reset/${resetToken}">Reset Password</a></p>`,
+      html: ``,
     }
 

[Killed] ObjectLiteral
adapters/secondary/services/email.service.ts:66:51
     }
 
     // await this.sendGridClient.send(emailData)
-    this.logger.info('Password reset email sent', { to })
+    this.logger.info('Password reset email sent', {})
   }
 }
killedBy: EmailService sendPasswordResetEmail should log success after sending password reset email
statusReason: expected "vi.fn()" to be called with arguments: [ 'Password reset email sent', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "Password reset email sent",

[Killed] StringLiteral
adapters/secondary/services/email.service.ts:66:22
     }
 
     // await this.sendGridClient.send(emailData)
-    this.logger.info('Password reset email sent', { to })
+    this.logger.info("", { to })
   }
 }
killedBy: EmailService sendPasswordResetEmail should log success after sending password reset email
statusReason: expected "vi.fn()" to be called with arguments: [ 'Password reset email sent', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "Password reset email sent",
