[Killed] ObjectLiteral
adapters/secondary/external/bucket.service.ts:25:39
     })
 
     // Separate client for presigned URLs with checksum disabled
-    this.presignClient = new S3Client({
-      endpoint: EnvConfig.CLOUDFLARE_ENDPOINT,
-      credentials: {
-        accessKeyId: obscured.value(EnvConfig.CLOUDFLARE_ACCESS_ID) as string,
-        secretAccessKey: obscured.value(EnvConfig.CLOUDFLARE_ACCESS_SECRET) as string,
-      },
-      region: 'auto',
-      // Disable flexible checksums for presigned URLs
-      // This prevents CRC32 checksum from being added to presigned URLs
-      requestChecksumCalculation: 'WHEN_REQUIRED',
-      responseChecksumValidation: 'WHEN_REQUIRED',
-    })
+    this.presignClient = new S3Client({})
 
     // Add middleware to remove checksum algorithm from requests before signing
killedBy: BucketService constructor should create presign client with checksum options
statusReason: expected "vi.fn()" to be called with arguments: [ { …(5) } ]

Received:

  1st vi.fn() call:

@@ -4,9 +4,7 @@
        "accessKeyId": "test-access-id",

[Killed] BlockStatement
adapters/secondary/external/bucket.service.ts:44:20
         // Remove checksum-related properties from the request
         const request = args.request as { query?: Record<string, string> | undefined }
         const query = request.query
-        if (query) {
-          if ('x-amz-checksum-crc32' in query) {
-            delete query['x-amz-checksum-crc32']
-          }
-          if ('x-amz-sdk-checksum-algorithm' in query) {
-            delete query['x-amz-sdk-checksum-algorithm']
-          }
-        }
+        if (query) {}
         return next(args)
       },
killedBy: BucketService removeChecksumMiddleware should remove checksum-related query params
statusReason: expected { …(3) } to deeply equal { 'other-param': 'keep-me' }

[Killed] BlockStatement
adapters/secondary/external/bucket.service.ts:45:48
         const request = args.request as { query?: Record<string, string> | undefined }
         const query = request.query
         if (query) {
-          if ('x-amz-checksum-crc32' in query) {
-            delete query['x-amz-checksum-crc32']
-          }
+          if ('x-amz-checksum-crc32' in query) {}
           if ('x-amz-sdk-checksum-algorithm' in query) {
             delete query['x-amz-sdk-checksum-algorithm']
killedBy: BucketService removeChecksumMiddleware should remove checksum-related query params
statusReason: expected { …(2) } to deeply equal { 'other-param': 'keep-me' }

[Killed] ConditionalExpression
adapters/secondary/external/bucket.service.ts:45:15
         const request = args.request as { query?: Record<string, string> | undefined }
         const query = request.query
         if (query) {
-          if ('x-amz-checksum-crc32' in query) {
+          if (true) {
             delete query['x-amz-checksum-crc32']
           }
killedBy: BucketService removeChecksumMiddleware should only call delete on keys present in the query (sdk-checksum-algorithm only)
statusReason: expected [ 'x-amz-checksum-crc32', …(1) ] to deeply equal [ 'x-amz-sdk-checksum-algorithm' ]

[Killed] StringLiteral
adapters/secondary/external/bucket.service.ts:46:26
         const query = request.query
         if (query) {
           if ('x-amz-checksum-crc32' in query) {
-            delete query['x-amz-checksum-crc32']
+            delete query[""]
           }
           if ('x-amz-sdk-checksum-algorithm' in query) {
killedBy: BucketService removeChecksumMiddleware should remove checksum-related query params
statusReason: expected { …(2) } to deeply equal { 'other-param': 'keep-me' }

[Killed] BlockStatement
adapters/secondary/external/bucket.service.ts:48:56
           if ('x-amz-checksum-crc32' in query) {
             delete query['x-amz-checksum-crc32']
           }
-          if ('x-amz-sdk-checksum-algorithm' in query) {
-            delete query['x-amz-sdk-checksum-algorithm']
-          }
+          if ('x-amz-sdk-checksum-algorithm' in query) {}
         }
         return next(args)
killedBy: BucketService removeChecksumMiddleware should remove checksum-related query params
statusReason: expected { …(2) } to deeply equal { 'other-param': 'keep-me' }

[Killed] ConditionalExpression
adapters/secondary/external/bucket.service.ts:48:15
           if ('x-amz-checksum-crc32' in query) {
             delete query['x-amz-checksum-crc32']
           }
-          if ('x-amz-sdk-checksum-algorithm' in query) {
+          if (true) {
             delete query['x-amz-sdk-checksum-algorithm']
           }
killedBy: BucketService removeChecksumMiddleware should only call delete on keys present in the query (checksum-crc32 only)
statusReason: expected [ 'x-amz-checksum-crc32', …(1) ] to deeply equal [ 'x-amz-checksum-crc32' ]

[Killed] BlockStatement
adapters/secondary/external/bucket.service.ts:81:21
 
       // Transform the stream body to a byte array
       return response.Body?.transformToByteArray()
-    } catch (error) {
-      this.logger.error('Error fetching file from bucket', error as Error, {
-        bucketName,
-        fileKey,
-      })
-      throw error
-    }
+    } catch (error) {}
   }
   getLoadURL(bucketName: string, filePath: string, expiresInSeconds: number): Promise<string> {
killedBy: BucketService getFileUrl should log error and rethrow on failure
statusReason: promise resolved "undefined" instead of rejecting
