[Survived] StringLiteral
adapters/secondary/repositories/company.repository.ts:157:23
       // Add updatedAt timestamp
       const updateData = {
         ...data,
-        updatedAt: sql`NOW()`,
+        updatedAt: sql``,
       }
 

[Survived] BooleanLiteral
adapters/secondary/repositories/company.repository.ts:164:43
       const [updatedCompany] = await db
         .update(company)
         .set(updateData)
-        .where(eq(company.singletonCheck, true))
+        .where(eq(company.singletonCheck, false))
         .returning()
 

[Killed] StringLiteral
adapters/secondary/repositories/company.repository.ts:169:25
 
       return updatedCompany ?? null
     } catch (error) {
-      this.logger.error('Error updating company details', error as Error)
+      this.logger.error("", error as Error)
       throw error
     }
killedBy: CompanyRepository putCompanyDetails() should throw error when database update fails
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
-   "Error updating company details",

[Killed] StringLiteral
adapters/secondary/repositories/company.repository.ts:281:22
    * ```
    */
   async putKeyPersonDetails(data: Partial<DBKeyPerson>): Promise<DBKeyPersonSelect | null> {
-    this.logger.info('Updating key person details in the database')
+    this.logger.info("")
 
     try {
killedBy: CompanyRepository putKeyPersonDetails() should successfully update key person details
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Updating key person details in the database",

[Killed] StringLiteral
adapters/secondary/repositories/company.repository.ts:364:22
    * ```
    */
   async getCompanyDetails(): Promise<DBCompanySelect | null> {
-    this.logger.info('Fetching company details from the database')
+    this.logger.info("")
 
     try {
killedBy: CompanyRepository getCompanyDetails() should successfully fetch company details
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Fetching company details from the database",

[Killed] StringLiteral
adapters/secondary/repositories/company.repository.ts:370:25
       const [companyDetails] = await db.select().from(company).limit(1)
       return companyDetails ?? null
     } catch (error) {
-      this.logger.error('Error fetching company details', error as Error)
+      this.logger.error("", error as Error)
       throw error
     }
killedBy: CompanyRepository getCompanyDetails() should throw error when database query fails
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
-   "Error fetching company details",
