[Survived] LogicalOperator
adapters/secondary/repositories/user.repository.ts:120:26
         provider: null,
         providerId: null,
         twoFactorEnabled: userEntity.isTwoFactorEnabled(),
-        twoFactorSecret: userEntity.getTwoFactorSecret() ?? null,
+        twoFactorSecret: userEntity.getTwoFactorSecret() && null,
         createdAt: UtcDate.now().toDate(),
       }

[Killed] EqualityOperator
adapters/secondary/repositories/user.repository.ts:125:9
       }
 
       const insertValues =
-        userEntity.id !== undefined ? { ...baseValues, userId: userEntity.id } : baseValues
+        userEntity.id === undefined ? { ...baseValues, userId: userEntity.id } : baseValues
 
       const result = await db.insert(user).values(insertValues).returning({ userId: user.userId })
killedBy: UserRepository save should insert a new user into the database
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ConditionalExpression
adapters/secondary/repositories/user.repository.ts:125:9
       }
 
       const insertValues =
-        userEntity.id !== undefined ? { ...baseValues, userId: userEntity.id } : baseValues
+        false ? { ...baseValues, userId: userEntity.id } : baseValues
 
       const result = await db.insert(user).values(insertValues).returning({ userId: user.userId })
killedBy: UserRepository save should insert a new user into the database
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ConditionalExpression
adapters/secondary/repositories/user.repository.ts:135:11
 
       return new UserId(result[0].userId).getValue()
     } catch (error) {
-      if (DatabaseUtil.isDuplicateKeyError(error)) {
+      if (false) {
         throw new ConflictException('User with this email already exists', {
           email: userEntity.getEmail(),
killedBy: UserRepository error handling save should throw ConflictException on duplicate key error
statusReason: expected error to be instance of ConflictException

[Killed] BlockStatement
adapters/secondary/repositories/user.repository.ts:135:52
 
       return new UserId(result[0].userId).getValue()
     } catch (error) {
-      if (DatabaseUtil.isDuplicateKeyError(error)) {
-        throw new ConflictException('User with this email already exists', {
-          email: userEntity.getEmail(),
-        })
-      }
+      if (DatabaseUtil.isDuplicateKeyError(error)) {}
       throw new DatabaseException('Failed to save user', { error })
     }
killedBy: UserRepository error handling save should throw ConflictException on duplicate key error
statusReason: expected error to be instance of ConflictException

[Killed] ConditionalExpression
adapters/secondary/repositories/user.repository.ts:206:11
         .where(eq(user.email, email))
         .limit(1)
 
-      if (existingUsers.length > 0) {
+      if (true) {
         const existingUser = existingUsers[0]!
 
killedBy: UserRepository saveProvider Scenario 3: New user registration should create new user and return userId with isNewUser: true
statusReason: Failed to save user with provider

[Killed] EqualityOperator
adapters/secondary/repositories/user.repository.ts:206:11
         .where(eq(user.email, email))
         .limit(1)
 
-      if (existingUsers.length > 0) {
+      if (existingUsers.length >= 0) {
         const existingUser = existingUsers[0]!
 
killedBy: UserRepository saveProvider Scenario 3: New user registration should create new user and return userId with isNewUser: true
statusReason: Failed to save user with provider

[Killed] LogicalOperator
adapters/secondary/repositories/user.repository.ts:212:12
         // Scenario 1: User previously registered with same provider
         // Password is null/empty AND provider matches
         if (
-          (!existingUser.password || existingUser.password === '') &&
+          (!existingUser.password && existingUser.password === '') &&
           existingUser.provider === provider
         ) {
killedBy: UserRepository saveProvider Scenario 1: Existing OAuth user with same provider should return existing userId with isNewUser: false when user previously registered with same provider
statusReason: Failed to save user with provider

[Killed] LogicalOperator
adapters/secondary/repositories/user.repository.ts:212:11
         // Scenario 1: User previously registered with same provider
         // Password is null/empty AND provider matches
         if (
-          (!existingUser.password || existingUser.password === '') &&
-          existingUser.provider === provider
+          !existingUser.password || existingUser.password === '' || existingUser.provider === provider
         ) {
           // Existing OAuth user with same provider - allow sign in
killedBy: UserRepository saveProvider Scenario 2b: Email exists with different provider should throw ConflictException when email registered with different OAuth provider
statusReason: promise resolved "{ …(2) }" instead of rejecting

[Killed] EqualityOperator
adapters/secondary/repositories/user.repository.ts:213:11
         // Password is null/empty AND provider matches
         if (
           (!existingUser.password || existingUser.password === '') &&
-          existingUser.provider === provider
+          existingUser.provider !== provider
         ) {
           // Existing OAuth user with same provider - allow sign in
killedBy: UserRepository saveProvider Scenario 1: Existing OAuth user with same provider should return existing userId with isNewUser: false when user previously registered with same provider
statusReason: Failed to save user with provider

[Killed] ConditionalExpression
adapters/secondary/repositories/user.repository.ts:213:11
         // Password is null/empty AND provider matches
         if (
           (!existingUser.password || existingUser.password === '') &&
-          existingUser.provider === provider
+          true
         ) {
           // Existing OAuth user with same provider - allow sign in
killedBy: UserRepository saveProvider Scenario 2b: Email exists with different provider should throw ConflictException when email registered with different OAuth provider
statusReason: promise resolved "{ …(2) }" instead of rejecting

[Killed] BlockStatement
adapters/secondary/repositories/user.repository.ts:214:11
         if (
           (!existingUser.password || existingUser.password === '') &&
           existingUser.provider === provider
-        ) {
-          // Existing OAuth user with same provider - allow sign in
-          return {
-            userId: new UserId(existingUser.userId).getValue(),
-            isNewUser: false,
-          }
-        }
+        ) {}
 
         // Scenario 2: Email exists with password (non-OAuth registration)
killedBy: UserRepository saveProvider Scenario 1: Existing OAuth user with same provider should return existing userId with isNewUser: false when user previously registered with same provider
statusReason: Failed to save user with provider

[Killed] BooleanLiteral
adapters/secondary/repositories/user.repository.ts:218:24
           // Existing OAuth user with same provider - allow sign in
           return {
             userId: new UserId(existingUser.userId).getValue(),
-            isNewUser: false,
+            isNewUser: true,
           }
         }
killedBy: UserRepository saveProvider Scenario 1: Existing OAuth user with same provider should return existing userId with isNewUser: false when user previously registered with same provider
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
adapters/secondary/repositories/user.repository.ts:223:38
         }
 
         // Scenario 2: Email exists with password (non-OAuth registration)
-        if (existingUser.password && existingUser.password !== '') {
+        if (existingUser.password && existingUser.password === '') {
           throw new ConflictException(
             'An account with this email already exists. Please sign in with your email and password.',
killedBy: UserRepository saveProvider Scenario 2: Email exists with password (non-OAuth) should throw ConflictException when email exists with password
statusReason: expected error to be instance of ConflictException

[Killed] LogicalOperator
adapters/secondary/repositories/user.repository.ts:223:13
         }
 
         // Scenario 2: Email exists with password (non-OAuth registration)
-        if (existingUser.password && existingUser.password !== '') {
+        if (existingUser.password || existingUser.password !== '') {
           throw new ConflictException(
             'An account with this email already exists. Please sign in with your email and password.',
killedBy: UserRepository saveProvider Scenario 2b: Email exists with different provider should throw ConflictException when email registered with different OAuth provider
statusReason: expected [Function] to throw error including 'This email is already registered with…' but got 'An account with this email already ex…'

[Killed] StringLiteral
adapters/secondary/repositories/user.repository.ts:225:13
         // Scenario 2: Email exists with password (non-OAuth registration)
         if (existingUser.password && existingUser.password !== '') {
           throw new ConflictException(
-            'An account with this email already exists. Please sign in with your email and password.',
+            "",
             { email: email }
           )
killedBy: UserRepository saveProvider Scenario 2: Email exists with password (non-OAuth) should throw ConflictException when email exists with password
statusReason: expected [Function] to throw error including 'An account with this email already ex…' but got ''

[Killed] ObjectLiteral
adapters/secondary/repositories/user.repository.ts:226:13
         if (existingUser.password && existingUser.password !== '') {
           throw new ConflictException(
             'An account with this email already exists. Please sign in with your email and password.',
-            { email: email }
+            {}
           )
         }
killedBy: UserRepository saveProvider Scenario 2: Email exists with password (non-OAuth) should include email in ConflictException context
statusReason: expected undefined to be 'password-user@example.com' // Object.is equality

[Killed] BlockStatement
adapters/secondary/repositories/user.repository.ts:231:74
         }
 
         // Edge case: Email exists with different provider
-        if (existingUser.provider && existingUser.provider !== provider) {
-          throw new ConflictException(
-            `This email is already registered with ${existingUser.provider}. Please sign in with ${existingUser.provider}.`,
-            { email: email, provider: existingUser.provider }
-          )
-        }
+        if (existingUser.provider && existingUser.provider !== provider) {}
       }
 
killedBy: UserRepository saveProvider Scenario 2b: Email exists with different provider should throw ConflictException when email registered with different OAuth provider
statusReason: expected error to be instance of ConflictException

[Killed] ConditionalExpression
adapters/secondary/repositories/user.repository.ts:231:13
         }
 
         // Edge case: Email exists with different provider
-        if (existingUser.provider && existingUser.provider !== provider) {
+        if (false) {
           throw new ConflictException(
             `This email is already registered with ${existingUser.provider}. Please sign in with ${existingUser.provider}.`,
killedBy: UserRepository saveProvider Scenario 2b: Email exists with different provider should throw ConflictException when email registered with different OAuth provider
statusReason: expected error to be instance of ConflictException

[Killed] ObjectLiteral
adapters/secondary/repositories/user.repository.ts:234:13
         if (existingUser.provider && existingUser.provider !== provider) {
           throw new ConflictException(
             `This email is already registered with ${existingUser.provider}. Please sign in with ${existingUser.provider}.`,
-            { email: email, provider: existingUser.provider }
+            {}
           )
         }
killedBy: UserRepository saveProvider Scenario 2b: Email exists with different provider should include both email and provider in exception context
statusReason: expected undefined to be 'github-user@example.com' // Object.is equality

[Killed] LogicalOperator
adapters/secondary/repositories/user.repository.ts:245:19
         name: userEntity.getName(),
         role: userEntity.getRole(),
         password: null, // OAuth users don't have passwords
-        provider: provider || null,
+        provider: provider && null,
         providerId: providerId || null,
         twoFactorEnabled: userEntity.isTwoFactorEnabled(),
killedBy: UserRepository saveProvider Scenario 3: New user registration should insert user with correct OAuth data
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] LogicalOperator
adapters/secondary/repositories/user.repository.ts:246:21
         role: userEntity.getRole(),
         password: null, // OAuth users don't have passwords
         provider: provider || null,
-        providerId: providerId || null,
+        providerId: providerId && null,
         twoFactorEnabled: userEntity.isTwoFactorEnabled(),
         twoFactorSecret: userEntity.getTwoFactorSecret() ?? null,
killedBy: UserRepository saveProvider Scenario 3: New user registration should insert user with correct OAuth data
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Survived] StringLiteral
adapters/secondary/repositories/user.repository.ts:258:37
       const result = await db.insert(user).values(insertValues).returning({ userId: user.userId })
 
       if (!result[0]) {
-        throw new DatabaseException('Failed to retrieve generated user ID', {})
+        throw new DatabaseException("", {})
       }
 

[Killed] BooleanLiteral
adapters/secondary/repositories/user.repository.ts:263:20
 
       return {
         userId: new UserId(result[0].userId).getValue(),
-        isNewUser: true,
+        isNewUser: false,
       }
     } catch (error) {
killedBy: UserRepository saveProvider Scenario 3: New user registration should create new user and return userId with isNewUser: true
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
adapters/secondary/repositories/user.repository.ts:267:11
       }
     } catch (error) {
       // Re-throw ConflictException as-is
-      if (error instanceof ConflictException) {
+      if (true) {
         throw error
       }
killedBy: UserRepository saveProvider Scenario 3: New user registration should throw DatabaseException when insert returns no userId
statusReason: expected [Function] to throw error including 'Failed to save user with provider' but got 'Failed to retrieve generated user ID'

[Killed] BlockStatement
adapters/secondary/repositories/user.repository.ts:267:47
       }
     } catch (error) {
       // Re-throw ConflictException as-is
-      if (error instanceof ConflictException) {
-        throw error
-      }
+      if (error instanceof ConflictException) {}
 
       // Handle duplicate key errors (shouldn't happen due to our check, but just in case)
killedBy: UserRepository saveProvider Scenario 2: Email exists with password (non-OAuth) should throw ConflictException when email exists with password
statusReason: expected error to be instance of ConflictException

[Killed] BlockStatement
adapters/secondary/repositories/user.repository.ts:272:52
       }
 
       // Handle duplicate key errors (shouldn't happen due to our check, but just in case)
-      if (DatabaseUtil.isDuplicateKeyError(error)) {
-        throw new ConflictException('User with this email already exists', {
-          email: userEntity.getEmail(),
-        })
-      }
+      if (DatabaseUtil.isDuplicateKeyError(error)) {}
 
       throw new DatabaseException('Failed to save user with provider', { error })
killedBy: UserRepository saveProvider Error handling should throw ConflictException on duplicate key error
statusReason: expected error to be instance of ConflictException

[Killed] ConditionalExpression
adapters/secondary/repositories/user.repository.ts:272:11
       }
 
       // Handle duplicate key errors (shouldn't happen due to our check, but just in case)
-      if (DatabaseUtil.isDuplicateKeyError(error)) {
+      if (true) {
         throw new ConflictException('User with this email already exists', {
           email: userEntity.getEmail(),
killedBy: UserRepository saveProvider Scenario 3: New user registration should throw DatabaseException when insert returns no userId
statusReason: expected error to be instance of DatabaseException

[Killed] LogicalOperator
adapters/secondary/repositories/user.repository.ts:350:21
 
       // Get total count
       const totalResult = await db.select({ count: count() }).from(user)
-      const total = totalResult[0]?.count ?? 0
+      const total = totalResult[0]?.count && 0
 
       // Get paginated results
killedBy: UserRepository findAll should return paginated users with default limit and offset
statusReason: expected +0 to be 2 // Object.is equality

[Killed] StringLiteral
adapters/secondary/repositories/user.repository.ts:362:35
         offset,
       }
     } catch (error) {
-      throw new DatabaseException('Failed to find all users', { error })
+      throw new DatabaseException("", { error })
     }
   }
killedBy: UserRepository findAll should throw DatabaseException on database error
statusReason: expected [Function] to throw error including 'Failed to find all users' but got ''

[Survived] ObjectLiteral
adapters/secondary/repositories/user.repository.ts:362:63
         offset,
       }
     } catch (error) {
-      throw new DatabaseException('Failed to find all users', { error })
+      throw new DatabaseException('Failed to find all users', {})
     }
   }

[Killed] EqualityOperator
adapters/secondary/repositories/user.repository.ts:394:11
     try {
       const result = await db.select().from(user).where(eq(user.userId, id))
 
-      if (result.length === 0) {
+      if (result.length !== 0) {
         return null
       }
killedBy: UserRepository findById should return User entity when found
statusReason: expected null to be an instance of User

[Survived] BlockStatement
adapters/secondary/repositories/user.repository.ts:394:32
     try {
       const result = await db.select().from(user).where(eq(user.userId, id))
 
-      if (result.length === 0) {
-        return null
-      }
+      if (result.length === 0) {}
 
       const dbRecord = result[0]

[Survived] ConditionalExpression
adapters/secondary/repositories/user.repository.ts:436:11
     try {
       const result = await db.select().from(user).where(eq(user.email, email))
 
-      if (result.length === 0) {
+      if (false) {
         return null
       }

[Survived] ObjectLiteral
adapters/secondary/repositories/user.repository.ts:447:67
         return null
       }
     } catch (error) {
-      throw new DatabaseException('Failed to find user by email', { email, error })
+      throw new DatabaseException('Failed to find user by email', {})
     }
   }

[Killed] BlockStatement
adapters/secondary/repositories/user.repository.ts:486:49
    * }
    * ```
    */
-  async update(userEntity: User): Promise<void> {
-    if (!userEntity.id) {
-      throw new DatabaseException('Cannot update user without ID', {})
-    }
-
-    try {
-      await db
-        .update(user)
-        .set({
-          email: userEntity.getEmail(),
-          name: userEntity.getName(),
-          role: userEntity.getRole(),
-          twoFactorEnabled: userEntity.isTwoFactorEnabled(),
-          twoFactorSecret: userEntity.getTwoFactorSecret() ?? null,
-        })
-        .where(eq(user.userId, userEntity.id))
-    } catch (error) {
-      if (DatabaseUtil.isDuplicateKeyError(error)) {
-        throw new ConflictException('User with this email already exists', {
-          email: userEntity.getEmail(),
-        })
-      }
-      throw new DatabaseException('Failed to update user', { error })
-    }
-  }
+  async update(userEntity: User): Promise<void> {}
 
   /**
killedBy: UserRepository update should update user in database
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
adapters/secondary/repositories/user.repository.ts:491:9
       throw new DatabaseException('Cannot update user without ID', {})
     }
 
-    try {
-      await db
-        .update(user)
-        .set({
-          email: userEntity.getEmail(),
-          name: userEntity.getName(),
-          role: userEntity.getRole(),
-          twoFactorEnabled: userEntity.isTwoFactorEnabled(),
-          twoFactorSecret: userEntity.getTwoFactorSecret() ?? null,
-        })
-        .where(eq(user.userId, userEntity.id))
-    } catch (error) {
+    try {} catch (error) {
       if (DatabaseUtil.isDuplicateKeyError(error)) {
         throw new ConflictException('User with this email already exists', {
killedBy: UserRepository update should update user in database
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
adapters/secondary/repositories/user.repository.ts:502:21
           twoFactorSecret: userEntity.getTwoFactorSecret() ?? null,
         })
         .where(eq(user.userId, userEntity.id))
-    } catch (error) {
-      if (DatabaseUtil.isDuplicateKeyError(error)) {
-        throw new ConflictException('User with this email already exists', {
-          email: userEntity.getEmail(),
-        })
-      }
-      throw new DatabaseException('Failed to update user', { error })
-    }
+    } catch (error) {}
   }
 
killedBy: UserRepository error handling update should throw ConflictException on duplicate key error
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
adapters/secondary/repositories/user.repository.ts:503:11
         })
         .where(eq(user.userId, userEntity.id))
     } catch (error) {
-      if (DatabaseUtil.isDuplicateKeyError(error)) {
+      if (true) {
         throw new ConflictException('User with this email already exists', {
           email: userEntity.getEmail(),
killedBy: UserRepository error handling update should throw DatabaseException on general database error
statusReason: expected error to be instance of DatabaseException

[Survived] ObjectLiteral
adapters/secondary/repositories/user.repository.ts:504:76
         .where(eq(user.userId, userEntity.id))
     } catch (error) {
       if (DatabaseUtil.isDuplicateKeyError(error)) {
-        throw new ConflictException('User with this email already exists', {
-          email: userEntity.getEmail(),
-        })
+        throw new ConflictException('User with this email already exists', {})
       }
       throw new DatabaseException('Failed to update user', { error })

[Killed] StringLiteral
adapters/secondary/repositories/user.repository.ts:508:35
           email: userEntity.getEmail(),
         })
       }
-      throw new DatabaseException('Failed to update user', { error })
+      throw new DatabaseException("", { error })
     }
   }
killedBy: UserRepository error handling update should throw DatabaseException on general database error
statusReason: expected [Function] to throw error including 'Failed to update user' but got ''

[Survived] ObjectLiteral
adapters/secondary/repositories/user.repository.ts:508:60
           email: userEntity.getEmail(),
         })
       }
-      throw new DatabaseException('Failed to update user', { error })
+      throw new DatabaseException('Failed to update user', {})
     }
   }

[Killed] BlockStatement
adapters/secondary/repositories/user.repository.ts:535:43
    * console.log(deletedUser) // null
    * ```
    */
-  async delete(id: string): Promise<void> {
-    try {
-      await db.delete(user).where(eq(user.userId, id))
-    } catch (error) {
-      throw new DatabaseException('Failed to delete user', { id, error })
-    }
-  }
+  async delete(id: string): Promise<void> {}
 
   /**
killedBy: UserRepository delete should delete user by id
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
adapters/secondary/repositories/user.repository.ts:536:9
    * ```
    */
   async delete(id: string): Promise<void> {
-    try {
-      await db.delete(user).where(eq(user.userId, id))
-    } catch (error) {
+    try {} catch (error) {
       throw new DatabaseException('Failed to delete user', { id, error })
     }
killedBy: UserRepository delete should delete user by id
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
adapters/secondary/repositories/user.repository.ts:538:21
   async delete(id: string): Promise<void> {
     try {
       await db.delete(user).where(eq(user.userId, id))
-    } catch (error) {
-      throw new DatabaseException('Failed to delete user', { id, error })
-    }
+    } catch (error) {}
   }
 
killedBy: UserRepository error handling delete should throw DatabaseException on database error
statusReason: promise resolved "undefined" instead of rejecting

[Killed] StringLiteral
adapters/secondary/repositories/user.repository.ts:539:35
     try {
       await db.delete(user).where(eq(user.userId, id))
     } catch (error) {
-      throw new DatabaseException('Failed to delete user', { id, error })
+      throw new DatabaseException("", { id, error })
     }
   }
killedBy: UserRepository error handling delete should throw DatabaseException on database error
statusReason: expected [Function] to throw error including 'Failed to delete user' but got ''

[Survived] ObjectLiteral
adapters/secondary/repositories/user.repository.ts:570:38
    */
   async existsByEmail(email: string): Promise<boolean> {
     try {
-      const result = await db.select({ id: user.userId }).from(user).where(eq(user.email, email))
+      const result = await db.select({}).from(user).where(eq(user.email, email))
 
       return result.length > 0

[Killed] ConditionalExpression
adapters/secondary/repositories/user.repository.ts:572:14
     try {
       const result = await db.select({ id: user.userId }).from(user).where(eq(user.email, email))
 
-      return result.length > 0
+      return true
     } catch (error) {
       throw new DatabaseException('Failed to check if user exists by email', { email, error })
killedBy: UserRepository existsByEmail should return false when email does not exist
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
adapters/secondary/repositories/user.repository.ts:572:14
     try {
       const result = await db.select({ id: user.userId }).from(user).where(eq(user.email, email))
 
-      return result.length > 0
+      return result.length <= 0
     } catch (error) {
       throw new DatabaseException('Failed to check if user exists by email', { email, error })
killedBy: UserRepository existsByEmail should return true when email exists
statusReason: expected false to be true // Object.is equality

[NoCoverage] BlockStatement
adapters/secondary/repositories/user.repository.ts:578:59
     }
   }
 
-  async deleteUsers(userIds: UserIdType[]): Promise<void> {
-    try {
-      if (userIds.length === 0) {
-        return
-      }
-      await db.delete(user).where(inArray(user.userId, userIds))
-    } catch (error) {
-      throw new DatabaseException('Failed to delete users', { userIds, error })
-    }
-  }
+  async deleteUsers(userIds: UserIdType[]): Promise<void> {}
   /**
    * Transforms a database record into a User domain entity

[NoCoverage] BlockStatement
adapters/secondary/repositories/user.repository.ts:579:9
   }
 
   async deleteUsers(userIds: UserIdType[]): Promise<void> {
-    try {
-      if (userIds.length === 0) {
-        return
-      }
-      await db.delete(user).where(inArray(user.userId, userIds))
-    } catch (error) {
+    try {} catch (error) {
       throw new DatabaseException('Failed to delete users', { userIds, error })
     }

[NoCoverage] BlockStatement
adapters/secondary/repositories/user.repository.ts:580:33
 
   async deleteUsers(userIds: UserIdType[]): Promise<void> {
     try {
-      if (userIds.length === 0) {
-        return
-      }
+      if (userIds.length === 0) {}
       await db.delete(user).where(inArray(user.userId, userIds))
     } catch (error) {

[NoCoverage] EqualityOperator
adapters/secondary/repositories/user.repository.ts:580:11
 
   async deleteUsers(userIds: UserIdType[]): Promise<void> {
     try {
-      if (userIds.length === 0) {
+      if (userIds.length !== 0) {
         return
       }

[NoCoverage] BlockStatement
adapters/secondary/repositories/user.repository.ts:584:21
         return
       }
       await db.delete(user).where(inArray(user.userId, userIds))
-    } catch (error) {
-      throw new DatabaseException('Failed to delete users', { userIds, error })
-    }
+    } catch (error) {}
   }
   /**

[NoCoverage] ObjectLiteral
adapters/secondary/repositories/user.repository.ts:585:61
       }
       await db.delete(user).where(inArray(user.userId, userIds))
     } catch (error) {
-      throw new DatabaseException('Failed to delete users', { userIds, error })
+      throw new DatabaseException('Failed to delete users', {})
     }
   }
