[Killed] BlockStatement
src/shared/utils/file.util.ts:28:33
   /**
    * Ensure the base directory exists
    */
-  private ensureBaseDir(): void {
-    if (!fs.existsSync(this.baseDir)) {
-      fs.mkdirSync(this.baseDir, { recursive: true })
-    }
-  }
+  private ensureBaseDir(): void {}
 
   /**
killedBy: FileUtil Return Values should return consistent structure for searchFiles
statusReason: expected { success: false, …(3) } to have property "files"

[Killed] BlockStatement
src/shared/utils/file.util.ts:29:39
    * Ensure the base directory exists
    */
   private ensureBaseDir(): void {
-    if (!fs.existsSync(this.baseDir)) {
-      fs.mkdirSync(this.baseDir, { recursive: true })
-    }
+    if (!fs.existsSync(this.baseDir)) {}
   }
 
killedBy: FileUtil Return Values should return consistent structure for searchFiles
statusReason: expected { success: false, …(3) } to have property "files"

[Killed] BooleanLiteral
src/shared/utils/file.util.ts:29:9
    * Ensure the base directory exists
    */
   private ensureBaseDir(): void {
-    if (!fs.existsSync(this.baseDir)) {
+    if (fs.existsSync(this.baseDir)) {
       fs.mkdirSync(this.baseDir, { recursive: true })
     }
killedBy: FileUtil Return Values should return consistent structure for searchFiles
statusReason: expected { success: false, …(3) } to have property "files"

[Killed] BooleanLiteral
src/shared/utils/file.util.ts:30:47
    */
   private ensureBaseDir(): void {
     if (!fs.existsSync(this.baseDir)) {
-      fs.mkdirSync(this.baseDir, { recursive: true })
+      fs.mkdirSync(this.baseDir, { recursive: false })
     }
   }
killedBy: FileUtil Constructor should create instance with custom data folder and database name
statusReason: Error writing file: ENOENT: no such file or directory, mkdir '/Applications/MAMP/htdocs/norberts-spark/apps/backend/.stryker-tmp/sandbox-8h3rpr/test-data/custom-db'

[Killed] ConditionalExpression
src/shared/utils/file.util.ts:43:9
     const baseDirResolved = path.resolve(this.baseDir)
 
     const relativePath = path.relative(baseDirResolved, fullPath)
-    if (relativePath.startsWith('..') || path.isAbsolute(relativePath)) {
+    if (true) {
       throw new ValidationException(
         `Access denied: Path "${filePath}" is outside the allowed directory`
killedBy: FileUtil Constructor should create instance with custom database name
statusReason: Access denied: Path "test.txt" is outside the allowed directory

[Killed] LogicalOperator
src/shared/utils/file.util.ts:43:9
     const baseDirResolved = path.resolve(this.baseDir)
 
     const relativePath = path.relative(baseDirResolved, fullPath)
-    if (relativePath.startsWith('..') || path.isAbsolute(relativePath)) {
+    if (relativePath.startsWith('..') && path.isAbsolute(relativePath)) {
       throw new ValidationException(
         `Access denied: Path "${filePath}" is outside the allowed directory`
killedBy: FileUtil writeFile should throw ValidationException for paths outside base directory
statusReason: promise resolved "{ success: true, …(2) }" instead of rejecting

[Killed] StringLiteral
src/shared/utils/file.util.ts:45:9
     const relativePath = path.relative(baseDirResolved, fullPath)
     if (relativePath.startsWith('..') || path.isAbsolute(relativePath)) {
       throw new ValidationException(
-        `Access denied: Path "${filePath}" is outside the allowed directory`
+        ``
       )
     }
killedBy: FileUtil writeFile should throw ValidationException for paths outside base directory
statusReason: expected [Function] to throw error including 'Access denied' but got ''

[Killed] BlockStatement
src/shared/utils/file.util.ts:64:47
    * Handle errors consistently across all methods
    */
   private handleError(error: unknown, operation: string): never {
-    if (error instanceof ValidationException) {
-      throw error
-    }
+    if (error instanceof ValidationException) {}
     throw new ValidationException(
       `Error ${operation}: ${error instanceof Error ? error.message : 'Unknown error'}`
killedBy: FileUtil writeFile should re-throw ValidationException without wrapping it in a new error
statusReason: expected ValidationException: Error writing file: … { …(3) } to match object { message: StringMatching{…} }
(4 matching properties omitted from actual)

[Killed] ConditionalExpression
src/shared/utils/file.util.ts:64:9
    * Handle errors consistently across all methods
    */
   private handleError(error: unknown, operation: string): never {
-    if (error instanceof ValidationException) {
+    if (false) {
       throw error
     }
killedBy: FileUtil writeFile should re-throw ValidationException without wrapping it in a new error
statusReason: expected ValidationException: Error writing file: … { …(3) } to match object { message: StringMatching{…} }
(4 matching properties omitted from actual)

[Killed] StringLiteral
src/shared/utils/file.util.ts:68:7
       throw error
     }
     throw new ValidationException(
-      `Error ${operation}: ${error instanceof Error ? error.message : 'Unknown error'}`
+      ``
     )
   }
killedBy: FileUtil writeFile should include "writing file" in error message when a file system error occurs
statusReason: expected [Function] to throw error including 'Error writing file:' but got ''

[Killed] ConditionalExpression
src/shared/utils/file.util.ts:85:11
 
       // Ensure the directory exists
       const dir = path.dirname(fullPath)
-      if (!fs.existsSync(dir)) {
+      if (false) {
         fs.mkdirSync(dir, { recursive: true })
       }
killedBy: FileUtil writeFile should create nested directories when writing to nested path
statusReason: Error writing file: ENOENT: no such file or directory, open '/Applications/MAMP/htdocs/norberts-spark/apps/backend/.stryker-tmp/sandbox-8h3rpr/data/test-db/nested/deep/file.txt'

[Killed] BooleanLiteral
src/shared/utils/file.util.ts:85:11
 
       // Ensure the directory exists
       const dir = path.dirname(fullPath)
-      if (!fs.existsSync(dir)) {
+      if (fs.existsSync(dir)) {
         fs.mkdirSync(dir, { recursive: true })
       }
killedBy: FileUtil writeFile should create nested directories when writing to nested path
statusReason: Error writing file: ENOENT: no such file or directory, open '/Applications/MAMP/htdocs/norberts-spark/apps/backend/.stryker-tmp/sandbox-8h3rpr/data/test-db/nested/deep/file.txt'

[Killed] BooleanLiteral
src/shared/utils/file.util.ts:86:40
       // Ensure the directory exists
       const dir = path.dirname(fullPath)
       if (!fs.existsSync(dir)) {
-        fs.mkdirSync(dir, { recursive: true })
+        fs.mkdirSync(dir, { recursive: false })
       }
 
killedBy: FileUtil writeFile should create nested directories when writing to nested path
statusReason: Error writing file: ENOENT: no such file or directory, mkdir '/Applications/MAMP/htdocs/norberts-spark/apps/backend/.stryker-tmp/sandbox-8h3rpr/data/test-db/nested/deep'

[Killed] ConditionalExpression
src/shared/utils/file.util.ts:114:11
       this.ensureBaseDir()
       const fullPath = this.validatePath(filePath)
 
-      if (!fs.existsSync(fullPath)) {
+      if (true) {
         return {
           success: false,
killedBy: FileUtil readFile should read content from an existing file
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/shared/utils/file.util.ts:114:11
       this.ensureBaseDir()
       const fullPath = this.validatePath(filePath)
 
-      if (!fs.existsSync(fullPath)) {
+      if (false) {
         return {
           success: false,
killedBy: FileUtil readFile should return error for non-existent file
statusReason: Error reading file: ENOENT: no such file or directory, open '/Applications/MAMP/htdocs/norberts-spark/apps/backend/.stryker-tmp/sandbox-8h3rpr/data/test-db/non-existent.txt'

[Killed] StringLiteral
src/shared/utils/file.util.ts:131:31
         path: this.getRelativePath(fullPath),
       }
     } catch (error) {
-      this.handleError(error, 'reading file')
+      this.handleError(error, "")
     }
   }
killedBy: FileUtil readFile should include "reading file" in error message when a file system error occurs
statusReason: expected [Function] to throw error including 'Error reading file:' but got 'Error : EISDIR: illegal operation on …'

[Killed] StringLiteral
src/shared/utils/file.util.ts:150:20
       if (!fs.existsSync(fullPath)) {
         return {
           success: false,
-          message: `Path not found: ${this.getRelativePath(fullPath)}`,
+          message: ``,
           path: this.getRelativePath(fullPath),
         }
killedBy: FileUtil deletePath should return error for non-existent path
statusReason: expected '' to contain 'Path not found'

[Killed] ConditionalExpression
src/shared/utils/file.util.ts:157:11
 
       const stats = fs.statSync(fullPath)
 
-      if (stats.isDirectory()) {
+      if (false) {
         fs.rmSync(fullPath, { recursive: true, force: true })
         return {
killedBy: FileUtil deletePath should delete an existing directory
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/shared/utils/file.util.ts:157:11
 
       const stats = fs.statSync(fullPath)
 
-      if (stats.isDirectory()) {
+      if (true) {
         fs.rmSync(fullPath, { recursive: true, force: true })
         return {
killedBy: FileUtil deletePath should delete an existing file
statusReason: expected 'Directory deleted successfully: test-…' to contain 'File deleted successfully'

[Killed] BooleanLiteral
src/shared/utils/file.util.ts:158:42
       const stats = fs.statSync(fullPath)
 
       if (stats.isDirectory()) {
-        fs.rmSync(fullPath, { recursive: true, force: true })
+        fs.rmSync(fullPath, { recursive: false, force: true })
         return {
           success: true,
killedBy: FileUtil deletePath should delete an existing directory
statusReason: Error deleting path: Path is a directory: rm returned EISDIR (is a directory) /Applications/MAMP/htdocs/norberts-spark/apps/backend/.stryker-tmp/sandbox-8h3rpr/data/test-db/test-directory

[Survived] BooleanLiteral
src/shared/utils/file.util.ts:158:55
       const stats = fs.statSync(fullPath)
 
       if (stats.isDirectory()) {
-        fs.rmSync(fullPath, { recursive: true, force: true })
+        fs.rmSync(fullPath, { recursive: true, force: false })
         return {
           success: true,

[Killed] StringLiteral
src/shared/utils/file.util.ts:161:20
         fs.rmSync(fullPath, { recursive: true, force: true })
         return {
           success: true,
-          message: `Directory deleted successfully: ${this.getRelativePath(fullPath)}`,
+          message: ``,
           path: this.getRelativePath(fullPath),
         }
killedBy: FileUtil deletePath should delete an existing directory
statusReason: expected '' to contain 'Directory deleted successfully'

[Killed] ConditionalExpression
src/shared/utils/file.util.ts:164:18
           message: `Directory deleted successfully: ${this.getRelativePath(fullPath)}`,
           path: this.getRelativePath(fullPath),
         }
-      } else if (stats.isFile()) {
+      } else if (false) {
         fs.unlinkSync(fullPath)
         return {
killedBy: FileUtil deletePath should delete an existing file
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/shared/utils/file.util.ts:164:18
           message: `Directory deleted successfully: ${this.getRelativePath(fullPath)}`,
           path: this.getRelativePath(fullPath),
         }
-      } else if (stats.isFile()) {
+      } else if (true) {
         fs.unlinkSync(fullPath)
         return {

[Killed] StringLiteral
src/shared/utils/file.util.ts:168:20
         fs.unlinkSync(fullPath)
         return {
           success: true,
-          message: `File deleted successfully: ${this.getRelativePath(fullPath)}`,
+          message: ``,
           path: this.getRelativePath(fullPath),
         }
killedBy: FileUtil deletePath should delete an existing file
statusReason: expected '' to contain 'File deleted successfully'

[Killed] BooleanLiteral
src/shared/utils/file.util.ts:200:11
       this.ensureBaseDir()
       const fullPath = this.validatePath(dirPath)
 
-      if (!fs.existsSync(fullPath)) {
+      if (fs.existsSync(fullPath)) {
         return {
           success: false,
killedBy: FileUtil listDirectory should list empty directory
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/shared/utils/file.util.ts:209:11
       }
 
       const stats = fs.statSync(fullPath)
-      if (!stats.isDirectory()) {
+      if (true) {
         return {
           success: false,
killedBy: FileUtil listDirectory should list empty directory
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/shared/utils/file.util.ts:209:33
       }
 
       const stats = fs.statSync(fullPath)
-      if (!stats.isDirectory()) {
-        return {
-          success: false,
-          message: `Path is not a directory: ${this.getRelativePath(fullPath)}`,
-          path: this.getRelativePath(fullPath),
-        }
-      }
+      if (!stats.isDirectory()) {}
 
       const items = fs.readdirSync(fullPath).map((item) => {
killedBy: FileUtil listDirectory should return error when path is a file, not directory
statusReason: Error listing directory: ENOTDIR: not a directory, scandir '/Applications/MAMP/htdocs/norberts-spark/apps/backend/.stryker-tmp/sandbox-8h3rpr/data/test-db/test-file.txt'

[Killed] ConditionalExpression
src/shared/utils/file.util.ts:250:11
       this.ensureBaseDir()
       const fullPath = this.validatePath(dirPath)
 
-      if (fs.existsSync(fullPath)) {
+      if (false) {
         return {
           success: false,
killedBy: FileUtil createDirectory should return error if directory already exists
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/shared/utils/file.util.ts:250:36
       this.ensureBaseDir()
       const fullPath = this.validatePath(dirPath)
 
-      if (fs.existsSync(fullPath)) {
-        return {
-          success: false,
-          message: `Directory already exists: ${this.getRelativePath(fullPath)}`,
-          path: this.getRelativePath(fullPath),
-        }
-      }
+      if (fs.existsSync(fullPath)) {}
 
       fs.mkdirSync(fullPath, { recursive: true })
killedBy: FileUtil createDirectory should return error if directory already exists
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/shared/utils/file.util.ts:258:43
         }
       }
 
-      fs.mkdirSync(fullPath, { recursive: true })
+      fs.mkdirSync(fullPath, { recursive: false })
 
       return {
killedBy: FileUtil createDirectory should create nested directories
statusReason: Error creating directory: ENOENT: no such file or directory, mkdir '/Applications/MAMP/htdocs/norberts-spark/apps/backend/.stryker-tmp/sandbox-8h3rpr/data/test-db/nested/deep/directory'

[Survived] StringLiteral
src/shared/utils/file.util.ts:301:25
    */
   public searchFiles(
     pattern: string,
-    searchDir: string = '.'
+    searchDir: string = ""
   ): {
     success: boolean

[Killed] ConditionalExpression
src/shared/utils/file.util.ts:313:11
       this.ensureBaseDir()
       const fullSearchDir = this.validatePath(searchDir)
 
-      if (!fs.existsSync(fullSearchDir)) {
+      if (false) {
         return {
           success: false,
killedBy: FileUtil searchFiles should return error for non-existent search directory
statusReason: Error searching files: ENOENT: no such file or directory, stat '/Applications/MAMP/htdocs/norberts-spark/apps/backend/.stryker-tmp/sandbox-8h3rpr/data/test-db/non-existent-dir'

[Killed] ConditionalExpression
src/shared/utils/file.util.ts:313:11
       this.ensureBaseDir()
       const fullSearchDir = this.validatePath(searchDir)
 
-      if (!fs.existsSync(fullSearchDir)) {
+      if (true) {
         return {
           success: false,
killedBy: FileUtil searchFiles should find files matching exact name
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/shared/utils/file.util.ts:323:11
       }
 
       const stats = fs.statSync(fullSearchDir)
-      if (!stats.isDirectory()) {
+      if (true) {
         return {
           success: false,
killedBy: FileUtil searchFiles should find files matching exact name
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/shared/utils/file.util.ts:323:33
       }
 
       const stats = fs.statSync(fullSearchDir)
-      if (!stats.isDirectory()) {
-        return {
-          success: false,
-          message: `Search path is not a directory: ${this.getRelativePath(fullSearchDir)}`,
-          pattern,
-          searchDir: this.getRelativePath(fullSearchDir),
-        }
-      }
+      if (!stats.isDirectory()) {}
 
       const foundFiles: string[] = []
killedBy: FileUtil searchFiles should return error when search path is a file
statusReason: Error searching files: ENOTDIR: not a directory, scandir '/Applications/MAMP/htdocs/norberts-spark/apps/backend/.stryker-tmp/sandbox-8h3rpr/data/test-db/file1.txt'

[Killed] BlockStatement
src/shared/utils/file.util.ts:334:63
 
       const foundFiles: string[] = []
 
-      const searchRecursively = (currentDir: string): void => {
-        const items = fs.readdirSync(currentDir)
-
-        for (const item of items) {
-          const itemPath = path.join(currentDir, item)
-          const relativeItemPath = this.getRelativePath(itemPath)
-          const stats = fs.statSync(itemPath)
-
-          if (stats.isDirectory()) {
-            searchRecursively(itemPath)
-          } else if (stats.isFile()) {
-            // Simple pattern matching (supports * wildcard)
-            const escapedPattern = pattern.replace(/[.+?^${}()|[\]\\]/g, '\\$&')
-            const regexPattern = escapedPattern.replace(/\*/g, '.*')
-            const regex = new RegExp(`^${regexPattern}$`)
-
-            if (regex.test(item) || regex.test(relativeItemPath)) {
-              foundFiles.push(relativeItemPath)
-            }
-          }
-        }
-      }
+      const searchRecursively = (currentDir: string): void => {}
 
       searchRecursively(fullSearchDir)
killedBy: FileUtil searchFiles should find files matching exact name
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/shared/utils/file.util.ts:337:35
       const searchRecursively = (currentDir: string): void => {
         const items = fs.readdirSync(currentDir)
 
-        for (const item of items) {
-          const itemPath = path.join(currentDir, item)
-          const relativeItemPath = this.getRelativePath(itemPath)
-          const stats = fs.statSync(itemPath)
-
-          if (stats.isDirectory()) {
-            searchRecursively(itemPath)
-          } else if (stats.isFile()) {
-            // Simple pattern matching (supports * wildcard)
-            const escapedPattern = pattern.replace(/[.+?^${}()|[\]\\]/g, '\\$&')
-            const regexPattern = escapedPattern.replace(/\*/g, '.*')
-            const regex = new RegExp(`^${regexPattern}$`)
-
-            if (regex.test(item) || regex.test(relativeItemPath)) {
-              foundFiles.push(relativeItemPath)
-            }
-          }
-        }
+        for (const item of items) {}
       }
 
killedBy: FileUtil searchFiles should find files matching exact name
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/shared/utils/file.util.ts:344:38
 
           if (stats.isDirectory()) {
             searchRecursively(itemPath)
-          } else if (stats.isFile()) {
-            // Simple pattern matching (supports * wildcard)
-            const escapedPattern = pattern.replace(/[.+?^${}()|[\]\\]/g, '\\$&')
-            const regexPattern = escapedPattern.replace(/\*/g, '.*')
-            const regex = new RegExp(`^${regexPattern}$`)
-
-            if (regex.test(item) || regex.test(relativeItemPath)) {
-              foundFiles.push(relativeItemPath)
-            }
-          }
+          } else if (stats.isFile()) {}
         }
       }
killedBy: FileUtil searchFiles should find files matching exact name
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/shared/utils/file.util.ts:344:22
 
           if (stats.isDirectory()) {
             searchRecursively(itemPath)
-          } else if (stats.isFile()) {
+          } else if (false) {
             // Simple pattern matching (supports * wildcard)
             const escapedPattern = pattern.replace(/[.+?^${}()|[\]\\]/g, '\\$&')
killedBy: FileUtil searchFiles should find files matching exact name
statusReason: expected [] to have a length of 1 but got +0

[Killed] StringLiteral
src/shared/utils/file.util.ts:347:64
           } else if (stats.isFile()) {
             // Simple pattern matching (supports * wildcard)
             const escapedPattern = pattern.replace(/[.+?^${}()|[\]\\]/g, '\\$&')
-            const regexPattern = escapedPattern.replace(/\*/g, '.*')
+            const regexPattern = escapedPattern.replace(/\*/g, "")
             const regex = new RegExp(`^${regexPattern}$`)
 
killedBy: FileUtil searchFiles should find files matching wildcard pattern
statusReason: expected 0 to be greater than or equal to 3

[Killed] LogicalOperator
src/shared/utils/file.util.ts:350:17
             const regexPattern = escapedPattern.replace(/\*/g, '.*')
             const regex = new RegExp(`^${regexPattern}$`)
 
-            if (regex.test(item) || regex.test(relativeItemPath)) {
+            if (regex.test(item) && regex.test(relativeItemPath)) {
               foundFiles.push(relativeItemPath)
             }
killedBy: FileUtil searchFiles should find nested files when searching by exact filename from root directory
statusReason: expected [] to include 'subdir/nested.txt'

[Killed] ConditionalExpression
src/shared/utils/file.util.ts:350:17
             const regexPattern = escapedPattern.replace(/\*/g, '.*')
             const regex = new RegExp(`^${regexPattern}$`)
 
-            if (regex.test(item) || regex.test(relativeItemPath)) {
+            if (true) {
               foundFiles.push(relativeItemPath)
             }
killedBy: FileUtil searchFiles should find files matching exact name
statusReason: expected [ 'document.pdf', 'file1.txt', …(4) ] to have a length of 1 but got 6
