[Killed] MethodExpression
src/shared/utils/string.util.ts:42:42
    * ```
    */
   static capitalize(str: string): string {
-    return str.charAt(0).toUpperCase() + str.slice(1).toLowerCase()
+    return str.charAt(0).toUpperCase() + str.slice(1).toUpperCase()
   }
 
killedBy: StringUtil capitalize should capitalize the first letter of a lowercase string
statusReason: expected 'HELLO' to be 'Hello' // Object.is equality

[Killed] MethodExpression
src/shared/utils/string.util.ts:42:42
    * ```
    */
   static capitalize(str: string): string {
-    return str.charAt(0).toUpperCase() + str.slice(1).toLowerCase()
+    return str.charAt(0).toUpperCase() + str.toLowerCase()
   }
 
killedBy: StringUtil capitalize should capitalize the first letter of a lowercase string
statusReason: expected 'Hhello' to be 'Hello' // Object.is equality

[Killed] MethodExpression
src/shared/utils/string.util.ts:68:12
    * ```
    */
   static slugify(str: string): string {
-    return str
-      .toLowerCase()
+    return str.toUpperCase()
       .trim()
       .replace(/[^\w\s-]/g, '')
killedBy: StringUtil slugify should convert string to lowercase slug
statusReason: expected 'HELLO-WORLD' to be 'hello-world' // Object.is equality

[Survived] MethodExpression
src/shared/utils/string.util.ts:68:12
    * ```
    */
   static slugify(str: string): string {
-    return str
-      .toLowerCase()
-      .trim()
+    return str.toLowerCase()
       .replace(/[^\w\s-]/g, '')
       .replace(/[\s_-]+/g, '-')

[Killed] StringLiteral
src/shared/utils/string.util.ts:72:28
       .toLowerCase()
       .trim()
       .replace(/[^\w\s-]/g, '')
-      .replace(/[\s_-]+/g, '-')
+      .replace(/[\s_-]+/g, "")
       .replace(/^-+|-+$/g, '')
   }
killedBy: StringUtil slugify should convert string to lowercase slug
statusReason: expected 'helloworld' to be 'hello-world' // Object.is equality

[Killed] EqualityOperator
src/shared/utils/string.util.ts:96:9
    * ```
    */
   static truncate(str: string, maxLength: number, suffix: string = '...'): string {
-    if (str.length <= maxLength) return str
+    if (str.length < maxLength) return str
     return str.substring(0, maxLength - suffix.length) + suffix
   }
killedBy: StringUtil truncate should handle maxLength equal to string length
statusReason: expected 'He...' to be 'Hello' // Object.is equality

[Killed] ConditionalExpression
src/shared/utils/string.util.ts:96:9
    * ```
    */
   static truncate(str: string, maxLength: number, suffix: string = '...'): string {
-    if (str.length <= maxLength) return str
+    if (false) return str
     return str.substring(0, maxLength - suffix.length) + suffix
   }
killedBy: StringUtil truncate should not truncate strings shorter than maxLength
statusReason: expected 'Hello World...' to be 'Hello World' // Object.is equality

[Killed] MethodExpression
src/shared/utils/string.util.ts:97:12
    */
   static truncate(str: string, maxLength: number, suffix: string = '...'): string {
     if (str.length <= maxLength) return str
-    return str.substring(0, maxLength - suffix.length) + suffix
+    return str + suffix
   }
 
killedBy: StringUtil truncate should truncate strings longer than maxLength
statusReason: expected 'Hello World...' to be 'Hello...' // Object.is equality

[Killed] ArithmeticOperator
src/shared/utils/string.util.ts:97:29
    */
   static truncate(str: string, maxLength: number, suffix: string = '...'): string {
     if (str.length <= maxLength) return str
-    return str.substring(0, maxLength - suffix.length) + suffix
+    return str.substring(0, maxLength + suffix.length) + suffix
   }
 
killedBy: StringUtil truncate should truncate strings longer than maxLength
statusReason: expected 'Hello World...' to be 'Hello...' // Object.is equality

[Killed] EqualityOperator
src/shared/utils/string.util.ts:122:9
    * ```
    */
   static randomString(length: number): string {
-    if (length < 0) {
+    if (length >= 0) {
       throw new ValidationException('Length must be a non-negative number')
     }
killedBy: StringUtil randomString should generate a string of specified length
statusReason: Length must be a non-negative number

[Killed] ConditionalExpression
src/shared/utils/string.util.ts:122:9
    * ```
    */
   static randomString(length: number): string {
-    if (length < 0) {
+    if (true) {
       throw new ValidationException('Length must be a non-negative number')
     }
killedBy: StringUtil randomString should generate a string of specified length
statusReason: Length must be a non-negative number

[Killed] StringLiteral
src/shared/utils/string.util.ts:123:37
    */
   static randomString(length: number): string {
     if (length < 0) {
-      throw new ValidationException('Length must be a non-negative number')
+      throw new ValidationException("")
     }
     if (length === 0) {
killedBy: StringUtil randomString should throw ValidationException for negative length
statusReason: expected [Function] to throw error including 'Length must be a non-negative number' but got ''

[Killed] ConditionalExpression
src/shared/utils/string.util.ts:125:9
     if (length < 0) {
       throw new ValidationException('Length must be a non-negative number')
     }
-    if (length === 0) {
+    if (true) {
       return ''
     }
killedBy: StringUtil randomString should generate a string of specified length
statusReason: expected '' to have a length of 16 but got +0

[Killed] EqualityOperator
src/shared/utils/string.util.ts:125:9
     if (length < 0) {
       throw new ValidationException('Length must be a non-negative number')
     }
-    if (length === 0) {
+    if (length !== 0) {
       return ''
     }
killedBy: StringUtil randomString should generate a string of specified length
statusReason: expected '' to have a length of 16 but got +0

[Killed] ArithmeticOperator
src/shared/utils/string.util.ts:130:21
     }
     const chars = 'ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789'
     const charCount = chars.length
-    const maxByte = 256 - (256 % charCount)
+    const maxByte = 256 + 256 % charCount
     let result = ''
 
killedBy: StringUtil randomString — crypto byte filtering should reject bytes >= 248 (maxByte) and not use them for character generation
statusReason: expected 'C' to be 'A' // Object.is equality

[Timeout] ArithmeticOperator
src/shared/utils/string.util.ts:130:28
     }
     const chars = 'ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789'
     const charCount = chars.length
-    const maxByte = 256 - (256 % charCount)
+    const maxByte = 256 - (256 * charCount)
     let result = ''
 

[Killed] EqualityOperator
src/shared/utils/string.util.ts:134:12
     let result = ''
 
     // Use rejection sampling to avoid modulo bias when mapping bytes to characters.
-    while (result.length < length) {
+    while (result.length >= length) {
       const bytesNeeded = length - result.length
       const bytes = crypto.randomBytes(bytesNeeded)
killedBy: StringUtil randomString should generate a string of specified length
statusReason: expected '' to have a length of 16 but got +0

[Killed] ConditionalExpression
src/shared/utils/string.util.ts:134:12
     let result = ''
 
     // Use rejection sampling to avoid modulo bias when mapping bytes to characters.
-    while (result.length < length) {
+    while (false) {
       const bytesNeeded = length - result.length
       const bytes = crypto.randomBytes(bytesNeeded)
killedBy: StringUtil randomString should generate a string of specified length
statusReason: expected '' to have a length of 16 but got +0

[Killed] ArithmeticOperator
src/shared/utils/string.util.ts:135:27
 
     // Use rejection sampling to avoid modulo bias when mapping bytes to characters.
     while (result.length < length) {
-      const bytesNeeded = length - result.length
+      const bytesNeeded = length + result.length
       const bytes = crypto.randomBytes(bytesNeeded)
       for (let i = 0; i < bytes.length && result.length < length; i++) {
killedBy: StringUtil randomString — crypto byte filtering should request (length - result.length) bytes per iteration, not (length + result.length)
statusReason: expected 3 to be 1 // Object.is equality

[Killed] EqualityOperator
src/shared/utils/string.util.ts:137:23
     while (result.length < length) {
       const bytesNeeded = length - result.length
       const bytes = crypto.randomBytes(bytesNeeded)
-      for (let i = 0; i < bytes.length && result.length < length; i++) {
+      for (let i = 0; i <= bytes.length && result.length < length; i++) {
         const byte = bytes.at(i)!
         if (byte >= maxByte) {
killedBy: StringUtil randomString — crypto byte filtering should request (length - result.length) bytes per iteration, not (length + result.length)
statusReason: expected undefined to be 1 // Object.is equality

[Killed] ConditionalExpression
src/shared/utils/string.util.ts:137:23
     while (result.length < length) {
       const bytesNeeded = length - result.length
       const bytes = crypto.randomBytes(bytesNeeded)
-      for (let i = 0; i < bytes.length && result.length < length; i++) {
+      for (let i = 0; true && result.length < length; i++) {
         const byte = bytes.at(i)!
         if (byte >= maxByte) {
killedBy: StringUtil randomString — crypto byte filtering should request (length - result.length) bytes per iteration, not (length + result.length)
statusReason: expected undefined to be 1 // Object.is equality

[Killed] EqualityOperator
src/shared/utils/string.util.ts:139:13
       const bytes = crypto.randomBytes(bytesNeeded)
       for (let i = 0; i < bytes.length && result.length < length; i++) {
         const byte = bytes.at(i)!
-        if (byte >= maxByte) {
+        if (byte > maxByte) {
           // Discard this byte to avoid introducing bias
           continue
killedBy: StringUtil randomString — crypto byte filtering should reject exactly byte 248 (the >= boundary, not just >)
statusReason: expected 'A' to be 'B' // Object.is equality

[Killed] BlockStatement
src/shared/utils/string.util.ts:139:30
       const bytes = crypto.randomBytes(bytesNeeded)
       for (let i = 0; i < bytes.length && result.length < length; i++) {
         const byte = bytes.at(i)!
-        if (byte >= maxByte) {
-          // Discard this byte to avoid introducing bias
-          continue
-        }
+        if (byte >= maxByte) {}
         result += chars.charAt(byte % charCount)
       }
killedBy: StringUtil randomString — crypto byte filtering should reject bytes >= 248 (maxByte) and not use them for character generation
statusReason: expected 'C' to be 'A' // Object.is equality

[Killed] MethodExpression
src/shared/utils/string.util.ts:143:19
           // Discard this byte to avoid introducing bias
           continue
         }
-        result += chars.charAt(byte % charCount)
+        result += chars
       }
     }
killedBy: StringUtil randomString should generate a string of specified length
statusReason: expected 'ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijk…' to have a length of 16 but got 62

[Killed] ArithmeticOperator
src/shared/utils/string.util.ts:143:32
           // Discard this byte to avoid introducing bias
           continue
         }
-        result += chars.charAt(byte % charCount)
+        result += chars.charAt(byte * charCount)
       }
     }
killedBy: StringUtil randomString should generate different strings on successive calls
statusReason: expected 'AAAAAAAAAAAAAAAA' not to be 'AAAAAAAAAAAAAAAA' // Object.is equality

[Killed] ConditionalExpression
src/shared/utils/string.util.ts:170:9
    * ```
    */
   static maskEmail(email: string): string {
-    if (email.split('@').length !== 2) {
+    if (false) {
       throw new ValidationException('Invalid email format')
     }
killedBy: StringUtil maskEmail should throw error for string with multiple @ symbols in different positions
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/shared/utils/string.util.ts:170:9
    * ```
    */
   static maskEmail(email: string): string {
-    if (email.split('@').length !== 2) {
+    if (email.split('@').length === 2) {
       throw new ValidationException('Invalid email format')
     }
killedBy: StringUtil maskEmail should mask email with standard format
statusReason: Invalid email format

[Killed] BooleanLiteral
src/shared/utils/string.util.ts:174:23
       throw new ValidationException('Invalid email format')
     }
     const [localPart, domain] = email.split('@')
-    if (!localPart || !domain) {
+    if (!localPart || domain) {
       throw new ValidationException('Invalid email format')
     }
killedBy: StringUtil maskEmail should mask email with standard format
statusReason: Invalid email format

[Killed] MethodExpression
src/shared/utils/string.util.ts:177:26
     if (!localPart || !domain) {
       throw new ValidationException('Invalid email format')
     }
-    const visibleChars = Math.min(3, localPart.length)
+    const visibleChars = Math.max(3, localPart.length)
     const masked = localPart.substring(0, visibleChars) + '***'
     return `${masked}@${domain}`
killedBy: StringUtil maskEmail should mask email with standard format
statusReason: expected 'user***@example.com' to be 'use***@example.com' // Object.is equality

[Killed] MethodExpression
src/shared/utils/string.util.ts:178:20
       throw new ValidationException('Invalid email format')
     }
     const visibleChars = Math.min(3, localPart.length)
-    const masked = localPart.substring(0, visibleChars) + '***'
+    const masked = localPart + '***'
     return `${masked}@${domain}`
   }
killedBy: StringUtil maskEmail should mask email with standard format
statusReason: expected 'user***@example.com' to be 'use***@example.com' // Object.is equality
