[Killed] StringLiteral
src/shared/utils/seed-helpers.util.ts:26:5
     'Tech',
     'Global',
     'Digital',
-    'Smart',
+    "",
     'Cloud',
     'Quantum',
killedBy: SeedHelpers companyPrefixes contains all expected prefix values
statusReason: expected [ 'Tech', 'Global', 'Digital', …(17) ] to include 'Smart'

[Killed] StringLiteral
src/shared/utils/seed-helpers.util.ts:33:5
     'Data',
     'Next',
     'Future',
-    'Prime',
+    "",
     'Alpha',
     'Beta',
killedBy: SeedHelpers companyPrefixes contains all expected prefix values
statusReason: expected [ 'Tech', 'Global', 'Digital', …(17) ] to include 'Prime'

[Killed] StringLiteral
src/shared/utils/seed-helpers.util.ts:34:5
     'Next',
     'Future',
     'Prime',
-    'Alpha',
+    "",
     'Beta',
     'Summit',
killedBy: SeedHelpers companyPrefixes contains all expected prefix values
statusReason: expected [ 'Tech', 'Global', 'Digital', …(17) ] to include 'Alpha'

[Killed] StringLiteral
src/shared/utils/seed-helpers.util.ts:37:5
     'Alpha',
     'Beta',
     'Summit',
-    'Apex',
+    "",
     'Vertex',
     'Zenith',
killedBy: SeedHelpers companyPrefixes contains all expected prefix values
statusReason: expected [ 'Tech', 'Global', 'Digital', …(17) ] to include 'Apex'

[Killed] StringLiteral
src/shared/utils/seed-helpers.util.ts:38:5
     'Beta',
     'Summit',
     'Apex',
-    'Vertex',
+    "",
     'Zenith',
     'Core',
killedBy: SeedHelpers companyPrefixes contains all expected prefix values
statusReason: expected [ 'Tech', 'Global', 'Digital', …(17) ] to include 'Vertex'

[Killed] StringLiteral
src/shared/utils/seed-helpers.util.ts:39:5
     'Summit',
     'Apex',
     'Vertex',
-    'Zenith',
+    "",
     'Core',
     'Elite',
killedBy: SeedHelpers companyPrefixes contains all expected prefix values
statusReason: expected [ 'Tech', 'Global', 'Digital', …(17) ] to include 'Zenith'

[Killed] StringLiteral
src/shared/utils/seed-helpers.util.ts:41:5
     'Vertex',
     'Zenith',
     'Core',
-    'Elite',
+    "",
     'Pro',
   ]
killedBy: SeedHelpers companyPrefixes contains all expected prefix values
statusReason: expected [ 'Tech', 'Global', 'Digital', …(17) ] to include 'Elite'

[Killed] StringLiteral
src/shared/utils/seed-helpers.util.ts:42:5
     'Zenith',
     'Core',
     'Elite',
-    'Pro',
+    "",
   ]
 
killedBy: SeedHelpers companyPrefixes contains all expected prefix values
statusReason: expected [ 'Tech', 'Global', 'Digital', …(17) ] to include 'Pro'

[Killed] ArrayDeclaration
src/shared/utils/seed-helpers.util.ts:45:34
     'Pro',
   ]
 
-  static readonly companyRoots = [
-    'Solutions',
-    'Systems',
-    'Innovations',
-    'Ventures',
-    'Dynamics',
-    'Networks',
-    'Services',
-    'Labs',
-    'Works',
-    'Tech',
-    'Soft',
-    'Wave',
-    'Bridge',
-    'Path',
-    'Link',
-    'Flow',
-    'Shift',
-    'Forge',
-    'Craft',
-    'Build',
-  ]
+  static readonly companyRoots = []
 
   static readonly companySuffixes = [
killedBy: SeedHelpers companyRoots has 20 elements
statusReason: expected [] to have a length of 20 but got +0

[Killed] StringLiteral
src/shared/utils/seed-helpers.util.ts:46:5
   ]
 
   static readonly companyRoots = [
-    'Solutions',
+    "",
     'Systems',
     'Innovations',
killedBy: SeedHelpers companyRoots contains all expected root values
statusReason: expected [ '', 'Systems', 'Innovations', …(17) ] to include 'Solutions'

[Killed] StringLiteral
src/shared/utils/seed-helpers.util.ts:51:5
     'Innovations',
     'Ventures',
     'Dynamics',
-    'Networks',
+    "",
     'Services',
     'Labs',
killedBy: SeedHelpers companyRoots contains all expected root values
statusReason: expected [ 'Solutions', 'Systems', …(18) ] to include 'Networks'

[Killed] StringLiteral
src/shared/utils/seed-helpers.util.ts:57:5
     'Works',
     'Tech',
     'Soft',
-    'Wave',
+    "",
     'Bridge',
     'Path',
killedBy: SeedHelpers companyRoots contains all expected root values
statusReason: expected [ 'Solutions', 'Systems', …(18) ] to include 'Wave'

[Killed] StringLiteral
src/shared/utils/seed-helpers.util.ts:59:5
     'Soft',
     'Wave',
     'Bridge',
-    'Path',
+    "",
     'Link',
     'Flow',
killedBy: SeedHelpers companyRoots contains all expected root values
statusReason: expected [ 'Solutions', 'Systems', …(18) ] to include 'Path'

[Killed] StringLiteral
src/shared/utils/seed-helpers.util.ts:61:5
     'Bridge',
     'Path',
     'Link',
-    'Flow',
+    "",
     'Shift',
     'Forge',
killedBy: SeedHelpers companyRoots contains all expected root values
statusReason: expected [ 'Solutions', 'Systems', …(18) ] to include 'Flow'

[Killed] StringLiteral
src/shared/utils/seed-helpers.util.ts:69:5
   ]
 
   static readonly companySuffixes = [
-    'Inc',
+    "",
     'LLC',
     'Corp',
killedBy: SeedHelpers companySuffixes contains all expected suffix values
statusReason: expected [ '', 'LLC', 'Corp', 'Ltd', …(4) ] to include 'Inc'

[Killed] StringLiteral
src/shared/utils/seed-helpers.util.ts:73:5
     'LLC',
     'Corp',
     'Ltd',
-    'Group',
+    "",
     'Partners',
     'Technologies',
killedBy: SeedHelpers companySuffixes contains all expected suffix values
statusReason: expected [ 'Inc', 'LLC', 'Corp', 'Ltd', …(4) ] to include 'Group'

[Killed] StringLiteral
src/shared/utils/seed-helpers.util.ts:74:5
     'Corp',
     'Ltd',
     'Group',
-    'Partners',
+    "",
     'Technologies',
     'Co',
killedBy: SeedHelpers companySuffixes contains all expected suffix values
statusReason: expected [ 'Inc', 'LLC', 'Corp', 'Ltd', …(4) ] to include 'Partners'

[Killed] StringLiteral
src/shared/utils/seed-helpers.util.ts:75:5
     'Ltd',
     'Group',
     'Partners',
-    'Technologies',
+    "",
     'Co',
   ]
killedBy: SeedHelpers companySuffixes contains all expected suffix values
statusReason: expected [ 'Inc', 'LLC', 'Corp', 'Ltd', …(4) ] to include 'Technologies'

[Killed] ArithmeticOperator
src/shared/utils/seed-helpers.util.ts:93:40
    * ```
    */
   static randomInt(min: number, max: number): number {
-    return Math.floor(Math.random() * (max - min + 1)) + min
+    return Math.floor(Math.random() * (max + min + 1)) + min
   }
 
killedBy: SeedHelpers randomInt returns a value within the given range inclusive
statusReason: expected 11 to be less than or equal to 10

[Killed] ArithmeticOperator
src/shared/utils/seed-helpers.util.ts:93:12
    * ```
    */
   static randomInt(min: number, max: number): number {
-    return Math.floor(Math.random() * (max - min + 1)) + min
+    return Math.floor(Math.random() * (max - min + 1)) - min
   }
 
killedBy: SeedHelpers randomInt returns a value within the given range inclusive
statusReason: expected -1 to be greater than or equal to 1

[Killed] ArithmeticOperator
src/shared/utils/seed-helpers.util.ts:109:29
    * ```
    */
   static randomElement<T>(array: T[]): T {
-    return array[Math.floor(Math.random() * array.length)]!
+    return array[Math.floor(Math.random() / array.length)]!
   }
 
killedBy: SeedHelpers randomElement returns the last element when Math.random() returns just below 1
statusReason: expected 'x' to be 'z' // Object.is equality

[Killed] EqualityOperator
src/shared/utils/seed-helpers.util.ts:126:12
    * ```
    */
   static randomBoolean(probability = 0.5): boolean {
-    return Math.random() < probability
+    return Math.random() >= probability
   }
 
killedBy: SeedHelpers randomBoolean returns true when Math.random() is strictly less than probability
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/shared/utils/seed-helpers.util.ts:126:12
    * ```
    */
   static randomBoolean(probability = 0.5): boolean {
-    return Math.random() < probability
+    return Math.random() <= probability
   }
 
killedBy: SeedHelpers randomBoolean returns false when Math.random() equals probability (strict < not <=)
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
src/shared/utils/seed-helpers.util.ts:148:23
     const root = this.randomElement(this.companyRoots)
     const suffix = this.randomElement(this.companySuffixes)
 
-    const legalName = `${prefix}${root} ${suffix}.`
+    const legalName = ``
     const displayName = this.randomBoolean(0.7) ? `${prefix}${root}` : legalName.replace('.', '')
 
killedBy: SeedHelpers generateCompanyName legal name always ends with a period
statusReason: expected '' to match /\.$/

[Killed] StringLiteral
src/shared/utils/seed-helpers.util.ts:149:51
     const suffix = this.randomElement(this.companySuffixes)
 
     const legalName = `${prefix}${root} ${suffix}.`
-    const displayName = this.randomBoolean(0.7) ? `${prefix}${root}` : legalName.replace('.', '')
+    const displayName = this.randomBoolean(0.7) ? `` : legalName.replace('.', '')
 
     return { legal: legalName, display: displayName }
killedBy: SeedHelpers generateCompanyName display name is prefix+root when randomBoolean returns true
statusReason: expected '' to be 'TechSolutions' // Object.is equality

[Killed] MethodExpression
src/shared/utils/seed-helpers.util.ts:170:20
    * ```
    */
   static generateWebsiteUrl(companyName: string): string {
-    const domain = companyName
-      .toLowerCase()
-      .replace(/[^a-z0-9]/g, '')
-      .substring(0, 20)
+    const domain = companyName.toLowerCase().replace(/[^a-z0-9]/g, '')
     const tld = this.randomElement(['com', 'io', 'co', 'tech', 'ai', 'net'])
     return `https://www.${domain}.${tld}`
killedBy: SeedHelpers generateWebsiteUrl truncates domain to at most 20 characters
statusReason: expected 50 to be less than or equal to 20

[Killed] MethodExpression
src/shared/utils/seed-helpers.util.ts:170:20
    * ```
    */
   static generateWebsiteUrl(companyName: string): string {
-    const domain = companyName
-      .toLowerCase()
+    const domain = companyName.toUpperCase()
       .replace(/[^a-z0-9]/g, '')
       .substring(0, 20)
killedBy: SeedHelpers generateWebsiteUrl domain section is lowercase and alphanumeric only (no spaces or special chars)
statusReason: expected '' to match /^[a-z0-9]+$/

[Killed] StringLiteral
src/shared/utils/seed-helpers.util.ts:174:37
       .toLowerCase()
       .replace(/[^a-z0-9]/g, '')
       .substring(0, 20)
-    const tld = this.randomElement(['com', 'io', 'co', 'tech', 'ai', 'net'])
+    const tld = this.randomElement(["", 'io', 'co', 'tech', 'ai', 'net'])
     return `https://www.${domain}.${tld}`
   }
killedBy: SeedHelpers generateWebsiteUrl handles a company name that is already lowercase and alphanumeric
statusReason: expected 'https://www.acme.' to be 'https://www.acme.com' // Object.is equality

[Killed] StringLiteral
src/shared/utils/seed-helpers.util.ts:174:64
       .toLowerCase()
       .replace(/[^a-z0-9]/g, '')
       .substring(0, 20)
-    const tld = this.randomElement(['com', 'io', 'co', 'tech', 'ai', 'net'])
+    const tld = this.randomElement(['com', 'io', 'co', 'tech', "", 'net'])
     return `https://www.${domain}.${tld}`
   }
killedBy: seed-customers helper functions generateWebsiteUrl should include a valid TLD
statusReason: expected [ 'com', 'io', 'co', 'tech', …(2) ] to include ''

[Killed] ConditionalExpression
src/shared/utils/seed-helpers.util.ts:195:9
    * ```
    */
   static generatePhoneNumber(country: string): string {
-    if (country === 'US' || country === 'CA') {
+    if (false) {
       return `+1-${this.randomInt(200, 999)}-${this.randomInt(200, 999)}-${this.randomInt(1000, 9999)}`
     } else if (country === 'GB') {
killedBy: seed-customers helper functions generatePhoneNumber should generate US format for US country code
statusReason: expected '+105-677-584-2536' to match /^\+1-[2-9]\d{2}-[2-9]\d{2}-\d{4}$/

[Killed] ConditionalExpression
src/shared/utils/seed-helpers.util.ts:195:9
    * ```
    */
   static generatePhoneNumber(country: string): string {
-    if (country === 'US' || country === 'CA') {
+    if (false || country === 'CA') {
       return `+1-${this.randomInt(200, 999)}-${this.randomInt(200, 999)}-${this.randomInt(1000, 9999)}`
     } else if (country === 'GB') {
killedBy: seed-customers helper functions generatePhoneNumber should generate US format for US country code
statusReason: expected '+18-942-264-6403' to match /^\+1-[2-9]\d{2}-[2-9]\d{2}-\d{4}$/

[Killed] ConditionalExpression
src/shared/utils/seed-helpers.util.ts:197:16
   static generatePhoneNumber(country: string): string {
     if (country === 'US' || country === 'CA') {
       return `+1-${this.randomInt(200, 999)}-${this.randomInt(200, 999)}-${this.randomInt(1000, 9999)}`
-    } else if (country === 'GB') {
+    } else if (true) {
       return `+44-20-${this.randomInt(1000, 9999)}-${this.randomInt(1000, 9999)}`
     } else if (country === 'DE') {
killedBy: seed-customers helper functions generatePhoneNumber should generate German format for DE country code
statusReason: expected '+44-20-1028-9797' to match /^\+49-30-\d{4}-\d{4}$/

[Killed] ConditionalExpression
src/shared/utils/seed-helpers.util.ts:197:16
   static generatePhoneNumber(country: string): string {
     if (country === 'US' || country === 'CA') {
       return `+1-${this.randomInt(200, 999)}-${this.randomInt(200, 999)}-${this.randomInt(1000, 9999)}`
-    } else if (country === 'GB') {
+    } else if (false) {
       return `+44-20-${this.randomInt(1000, 9999)}-${this.randomInt(1000, 9999)}`
     } else if (country === 'DE') {
killedBy: seed-customers helper functions generatePhoneNumber should generate UK format for GB country code
statusReason: expected '+152-108-658-9952' to match /^\+44-20-\d{4}-\d{4}$/

[Killed] ConditionalExpression
src/shared/utils/seed-helpers.util.ts:199:16
       return `+1-${this.randomInt(200, 999)}-${this.randomInt(200, 999)}-${this.randomInt(1000, 9999)}`
     } else if (country === 'GB') {
       return `+44-20-${this.randomInt(1000, 9999)}-${this.randomInt(1000, 9999)}`
-    } else if (country === 'DE') {
+    } else if (false) {
       return `+49-30-${this.randomInt(1000, 9999)}-${this.randomInt(1000, 9999)}`
     } else if (country === 'AU') {
killedBy: seed-customers helper functions generatePhoneNumber should generate German format for DE country code
statusReason: expected '+701-794-167-4156' to match /^\+49-30-\d{4}-\d{4}$/

[Killed] ConditionalExpression
src/shared/utils/seed-helpers.util.ts:199:16
       return `+1-${this.randomInt(200, 999)}-${this.randomInt(200, 999)}-${this.randomInt(1000, 9999)}`
     } else if (country === 'GB') {
       return `+44-20-${this.randomInt(1000, 9999)}-${this.randomInt(1000, 9999)}`
-    } else if (country === 'DE') {
+    } else if (true) {
       return `+49-30-${this.randomInt(1000, 9999)}-${this.randomInt(1000, 9999)}`
     } else if (country === 'AU') {
killedBy: seed-customers helper functions generatePhoneNumber should generate Australian format for AU country code
statusReason: expected '+49-30-3713-8549' to match /^\+61-2-\d{4}-\d{4}$/

[Killed] StringLiteral
src/shared/utils/seed-helpers.util.ts:200:14
     } else if (country === 'GB') {
       return `+44-20-${this.randomInt(1000, 9999)}-${this.randomInt(1000, 9999)}`
     } else if (country === 'DE') {
-      return `+49-30-${this.randomInt(1000, 9999)}-${this.randomInt(1000, 9999)}`
+      return ``
     } else if (country === 'AU') {
       return `+61-2-${this.randomInt(1000, 9999)}-${this.randomInt(1000, 9999)}`
killedBy: seed-customers helper functions generatePhoneNumber should generate German format for DE country code
statusReason: expected '' to match /^\+49-30-\d{4}-\d{4}$/

[Killed] EqualityOperator
src/shared/utils/seed-helpers.util.ts:201:16
       return `+44-20-${this.randomInt(1000, 9999)}-${this.randomInt(1000, 9999)}`
     } else if (country === 'DE') {
       return `+49-30-${this.randomInt(1000, 9999)}-${this.randomInt(1000, 9999)}`
-    } else if (country === 'AU') {
+    } else if (country !== 'AU') {
       return `+61-2-${this.randomInt(1000, 9999)}-${this.randomInt(1000, 9999)}`
     } else {
killedBy: seed-customers helper functions generatePhoneNumber should generate Australian format for AU country code
statusReason: expected '+140-302-948-9993' to match /^\+61-2-\d{4}-\d{4}$/

[Killed] ConditionalExpression
src/shared/utils/seed-helpers.util.ts:201:16
       return `+44-20-${this.randomInt(1000, 9999)}-${this.randomInt(1000, 9999)}`
     } else if (country === 'DE') {
       return `+49-30-${this.randomInt(1000, 9999)}-${this.randomInt(1000, 9999)}`
-    } else if (country === 'AU') {
+    } else if (true) {
       return `+61-2-${this.randomInt(1000, 9999)}-${this.randomInt(1000, 9999)}`
     } else {
killedBy: seed-customers helper functions generatePhoneNumber should generate generic format for unknown country code
statusReason: expected '+61-2-9521-6246' to match /^\+\d{1,3}-\d{3}-\d{3}-\d{4}$/

[Killed] StringLiteral
src/shared/utils/seed-helpers.util.ts:226:81
    * ```
    */
   static generateEmail(firstName: string, lastName: string, companyDomain: string): string {
-    const domain = companyDomain.replace('https://www.', '').replace('http://', '')
+    const domain = companyDomain.replace('https://www.', '').replace('http://', "Stryker was here!")
     return `${firstName.toLowerCase()}.${lastName.toLowerCase()}@${domain}`
   }
killedBy: seed-customers helper functions generateEmail should strip http:// prefix from domain
statusReason: expected 'bob.johnson@Stryker was here!testsite…' to be 'bob.johnson@testsite.net' // Object.is equality

[Killed] StringLiteral
src/shared/utils/seed-helpers.util.ts:226:58
    * ```
    */
   static generateEmail(firstName: string, lastName: string, companyDomain: string): string {
-    const domain = companyDomain.replace('https://www.', '').replace('http://', '')
+    const domain = companyDomain.replace('https://www.', "Stryker was here!").replace('http://', '')
     return `${firstName.toLowerCase()}.${lastName.toLowerCase()}@${domain}`
   }
killedBy: seed-customers helper functions generateEmail should generate email with correct format
statusReason: expected 'john.doe@Stryker was here!example.com' to be 'john.doe@example.com' // Object.is equality

[Killed] MethodExpression
src/shared/utils/seed-helpers.util.ts:227:15
    */
   static generateEmail(firstName: string, lastName: string, companyDomain: string): string {
     const domain = companyDomain.replace('https://www.', '').replace('http://', '')
-    return `${firstName.toLowerCase()}.${lastName.toLowerCase()}@${domain}`
+    return `${firstName.toUpperCase()}.${lastName.toLowerCase()}@${domain}`
   }
 }
killedBy: seed-customers helper functions generateEmail should generate email with correct format
statusReason: expected 'JOHN.doe@example.com' to be 'john.doe@example.com' // Object.is equality

[Killed] MethodExpression
src/shared/utils/seed-helpers.util.ts:227:42
    */
   static generateEmail(firstName: string, lastName: string, companyDomain: string): string {
     const domain = companyDomain.replace('https://www.', '').replace('http://', '')
-    return `${firstName.toLowerCase()}.${lastName.toLowerCase()}@${domain}`
+    return `${firstName.toLowerCase()}.${lastName.toUpperCase()}@${domain}`
   }
 }
killedBy: seed-customers helper functions generateEmail should generate email with correct format
statusReason: expected 'john.DOE@example.com' to be 'john.doe@example.com' // Object.is equality
