[Killed] Regex
adapters/secondary/repositories/ai-chat-content.repository.ts:27:33
  * - Cannot have consecutive hyphens
  * Note: written as ^[a-z0-9](?:[a-z0-9]|-[a-z0-9])*$ to avoid nested quantifiers.
  */
-const SEO_FRIENDLY_ID_PATTERN = /^[a-z0-9](?:[a-z0-9]|-[a-z0-9])*$/
+const SEO_FRIENDLY_ID_PATTERN = /^[a-z0-9](?:[a-z0-9]|-[a-z0-9])$/
 
 /**
killedBy: AIChatContentRepository resolveChatTypeByParam successful resolution by seoFriendlyId should not check UUID column when param is not a valid UUID
statusReason: expected "vi.fn()" to be called at least once

[Killed] Regex
adapters/secondary/repositories/ai-chat-content.repository.ts:27:33
  * - Cannot have consecutive hyphens
  * Note: written as ^[a-z0-9](?:[a-z0-9]|-[a-z0-9])*$ to avoid nested quantifiers.
  */
-const SEO_FRIENDLY_ID_PATTERN = /^[a-z0-9](?:[a-z0-9]|-[a-z0-9])*$/
+const SEO_FRIENDLY_ID_PATTERN = /^[a-z0-9](?:[a-z0-9]|-[^a-z0-9])*$/
 
 /**
killedBy: AIChatContentRepository resolveChatTypeByParam successful resolution by seoFriendlyId should not check UUID column when param is not a valid UUID
statusReason: expected "vi.fn()" to be called at least once

[Survived] Regex
adapters/secondary/repositories/ai-chat-content.repository.ts:33:40
  * Regex pattern for validating seoFriendlyBase64Id format
  * - Must be exactly 22 base64url characters (A-Z, a-z, 0-9, '-' or '_', without padding)
  */
-const SEO_FRIENDLY_BASE64_ID_PATTERN = /^[A-Za-z0-9_-]{22}$/
+const SEO_FRIENDLY_BASE64_ID_PATTERN = /^[^A-Za-z0-9_-]{22}$/
 
 /**

[Survived] Regex
adapters/secondary/repositories/ai-chat-content.repository.ts:33:40
  * Regex pattern for validating seoFriendlyBase64Id format
  * - Must be exactly 22 base64url characters (A-Z, a-z, 0-9, '-' or '_', without padding)
  */
-const SEO_FRIENDLY_BASE64_ID_PATTERN = /^[A-Za-z0-9_-]{22}$/
+const SEO_FRIENDLY_BASE64_ID_PATTERN = /[A-Za-z0-9_-]{22}$/
 
 /**

[NoCoverage] StringLiteral
adapters/secondary/repositories/ai-chat-content.repository.ts:77:25
     try {
       return db.select().from(chatTypes).orderBy(desc(chatTypes.createdAt))
     } catch (error) {
-      this.logger.error('Error fetching chat content', error as Error)
+      this.logger.error("", error as Error)
       throw error
     }

[Killed] ConditionalExpression
adapters/secondary/repositories/ai-chat-content.repository.ts:125:9
       seoFriendlyId: string
     }> = {}
 
-    if (details.name !== undefined) {
+    if (false) {
       updateData.name = details.name
     }
killedBy: AIChatContentRepository putChatTypeDetails successful updates should update chat type with all fields
statusReason: expected "vi.fn()" to be called with arguments: [ { name: 'Updated Name', …(2) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] BlockStatement
adapters/secondary/repositories/ai-chat-content.repository.ts:125:37
       seoFriendlyId: string
     }> = {}
 
-    if (details.name !== undefined) {
-      updateData.name = details.name
-    }
+    if (details.name !== undefined) {}
 
     if (details.description !== undefined) {
killedBy: AIChatContentRepository putChatTypeDetails successful updates should update chat type with all fields
statusReason: expected "vi.fn()" to be called with arguments: [ { name: 'Updated Name', …(2) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] EqualityOperator
adapters/secondary/repositories/ai-chat-content.repository.ts:129:9
       updateData.name = details.name
     }
 
-    if (details.description !== undefined) {
+    if (details.description === undefined) {
       updateData.description = details.description
     }
killedBy: AIChatContentRepository putChatTypeDetails successful updates should update chat type with all fields
statusReason: expected "vi.fn()" to be called with arguments: [ { name: 'Updated Name', …(2) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] ConditionalExpression
adapters/secondary/repositories/ai-chat-content.repository.ts:129:9
       updateData.name = details.name
     }
 
-    if (details.description !== undefined) {
+    if (false) {
       updateData.description = details.description
     }
killedBy: AIChatContentRepository putChatTypeDetails successful updates should update chat type with all fields
statusReason: expected "vi.fn()" to be called with arguments: [ { name: 'Updated Name', …(2) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] ConditionalExpression
adapters/secondary/repositories/ai-chat-content.repository.ts:133:9
       updateData.description = details.description
     }
 
-    if (details.seoFriendlyId !== undefined) {
+    if (false) {
       updateData.seoFriendlyId = details.seoFriendlyId
     }
killedBy: AIChatContentRepository putChatTypeDetails successful updates should update chat type with all fields
statusReason: expected "vi.fn()" to be called with arguments: [ { name: 'Updated Name', …(2) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] EqualityOperator
adapters/secondary/repositories/ai-chat-content.repository.ts:133:9
       updateData.description = details.description
     }
 
-    if (details.seoFriendlyId !== undefined) {
+    if (details.seoFriendlyId === undefined) {
       updateData.seoFriendlyId = details.seoFriendlyId
     }
killedBy: AIChatContentRepository putChatTypeDetails successful updates should update chat type with all fields
statusReason: expected "vi.fn()" to be called with arguments: [ { name: 'Updated Name', …(2) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] ConditionalExpression
adapters/secondary/repositories/ai-chat-content.repository.ts:141:11
       const result = await db.update(chatTypes).set(updateData).where(eq(chatTypes.id, details.id))
 
       // Return null if no rows were updated (chat type not found)
-      if (result.rowCount === 0) {
+      if (true) {
         this.logger.warn('No chat type found to update', { chatTypeId: details.id })
         return null
killedBy: AIChatContentRepository putChatTypeDetails successful updates should update chat type with all fields
statusReason: expected null to deeply equal { Object (rowCount, command, ...) }

[Killed] BlockStatement
adapters/secondary/repositories/ai-chat-content.repository.ts:141:34
       const result = await db.update(chatTypes).set(updateData).where(eq(chatTypes.id, details.id))
 
       // Return null if no rows were updated (chat type not found)
-      if (result.rowCount === 0) {
-        this.logger.warn('No chat type found to update', { chatTypeId: details.id })
-        return null
-      }
+      if (result.rowCount === 0) {}
 
       this.logger.info('Successfully updated chat type details', { chatTypeId: details.id })
killedBy: AIChatContentRepository putChatTypeDetails successful updates should return null when empty update object provided (no rows affected)
statusReason: expected { rowCount: +0, …(4) } to be null

[Killed] ObjectLiteral
adapters/secondary/repositories/ai-chat-content.repository.ts:146:66
         return null
       }
 
-      this.logger.info('Successfully updated chat type details', { chatTypeId: details.id })
+      this.logger.info('Successfully updated chat type details', {})
       return result
     } catch (error) {
killedBy: AIChatContentRepository putChatTypeDetails successful updates should update chat type with all fields
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
    "Successfully updated chat type details",

[Killed] BlockStatement
adapters/secondary/repositories/ai-chat-content.repository.ts:196:52
       })
       return createdChatType
     } catch (error) {
-      if (DatabaseUtil.isDuplicateKeyError(error)) {
-        this.logger.warn('Duplicate key error when creating chat type', {
-          name: data.name,
-          error,
-        })
-        throw new ConflictException('A chat type with this name or identifier already exists', {
-          name: data.name,
-          seoFriendlyId: data.seoFriendlyId,
-          seoFriendlyBase64Id: data.seoFriendlyBase64Id,
-        })
-      }
+      if (DatabaseUtil.isDuplicateKeyError(error)) {}
       this.logger.error('Error creating new chat type', error as Error)
       throw error
killedBy: AIChatContentRepository createChatType error handling should throw ConflictException for duplicate key errors
statusReason: expected [Function] to throw error including 'A chat type with this name or identif…' but got 'duplicate key value'

[Killed] StringLiteral
adapters/secondary/repositories/ai-chat-content.repository.ts:197:26
       return createdChatType
     } catch (error) {
       if (DatabaseUtil.isDuplicateKeyError(error)) {
-        this.logger.warn('Duplicate key error when creating chat type', {
+        this.logger.warn("", {
           name: data.name,
           error,
killedBy: AIChatContentRepository createChatType error handling should log warning for duplicate key errors before throwing ConflictException
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

@@ -1,7 +1,7 @@
  [

[Killed] StringLiteral
adapters/secondary/repositories/ai-chat-content.repository.ts:201:37
           name: data.name,
           error,
         })
-        throw new ConflictException('A chat type with this name or identifier already exists', {
+        throw new ConflictException("", {
           name: data.name,
           seoFriendlyId: data.seoFriendlyId,
killedBy: AIChatContentRepository createChatType error handling should throw ConflictException for duplicate key errors
statusReason: expected [Function] to throw error including 'A chat type with this name or identif…' but got ''

[Survived] ObjectLiteral
adapters/secondary/repositories/ai-chat-content.repository.ts:201:96
           name: data.name,
           error,
         })
-        throw new ConflictException('A chat type with this name or identifier already exists', {
-          name: data.name,
-          seoFriendlyId: data.seoFriendlyId,
-          seoFriendlyBase64Id: data.seoFriendlyBase64Id,
-        })
+        throw new ConflictException('A chat type with this name or identifier already exists', {})
       }
       this.logger.error('Error creating new chat type', error as Error)

[Killed] EqualityOperator
adapters/secondary/repositories/ai-chat-content.repository.ts:230:9
    */
   async resolveChatTypeByParam(param: string): Promise<ResolvedChatType | null> {
     // Validate maximum length to prevent DoS attacks with extremely long strings
-    if (param.length > MAX_PARAM_LENGTH) {
+    if (param.length <= MAX_PARAM_LENGTH) {
       this.logger.warn('Chat type param exceeds maximum length', {
         param: param.substring(0, 50) + '...',
killedBy: AIChatContentRepository resolveChatTypeByParam successful resolution by UUID should resolve chat type when param is a valid UUID
statusReason: expected null to deeply equal { …(2) }

[Survived] ConditionalExpression
adapters/secondary/repositories/ai-chat-content.repository.ts:230:9
    */
   async resolveChatTypeByParam(param: string): Promise<ResolvedChatType | null> {
     // Validate maximum length to prevent DoS attacks with extremely long strings
-    if (param.length > MAX_PARAM_LENGTH) {
+    if (false) {
       this.logger.warn('Chat type param exceeds maximum length', {
         param: param.substring(0, 50) + '...',

[NoCoverage] MethodExpression
adapters/secondary/repositories/ai-chat-content.repository.ts:232:16
     // Validate maximum length to prevent DoS attacks with extremely long strings
     if (param.length > MAX_PARAM_LENGTH) {
       this.logger.warn('Chat type param exceeds maximum length', {
-        param: param.substring(0, 50) + '...',
+        param: param + '...',
         length: param.length,
       })

[NoCoverage] StringLiteral
adapters/secondary/repositories/ai-chat-content.repository.ts:232:41
     // Validate maximum length to prevent DoS attacks with extremely long strings
     if (param.length > MAX_PARAM_LENGTH) {
       this.logger.warn('Chat type param exceeds maximum length', {
-        param: param.substring(0, 50) + '...',
+        param: param.substring(0, 50) + "",
         length: param.length,
       })

[Killed] ObjectLiteral
adapters/secondary/repositories/ai-chat-content.repository.ts:239:55
     }
 
     // Log with truncated param to prevent large log entries
-    this.logger.debug('Resolving chat type by param', {
-      param: param.length > 50 ? param.substring(0, 50) + '...' : param,
-      length: param.length,
-    })
+    this.logger.debug('Resolving chat type by param', {})
 
     // Only check UUID column if param is a valid UUID to avoid PostgreSQL type casting errors
killedBy: AIChatContentRepository resolveChatTypeByParam successful resolution by UUID should resolve chat type when param is a valid UUID
statusReason: expected "vi.fn()" to be called with arguments: [ Array(2) ]

Received:

  1st vi.fn() call:

  [
    "Resolving chat type by param",

[Killed] EqualityOperator
adapters/secondary/repositories/ai-chat-content.repository.ts:240:14
 
     // Log with truncated param to prevent large log entries
     this.logger.debug('Resolving chat type by param', {
-      param: param.length > 50 ? param.substring(0, 50) + '...' : param,
+      param: param.length <= 50 ? param.substring(0, 50) + '...' : param,
       length: param.length,
     })
killedBy: AIChatContentRepository resolveChatTypeByParam successful resolution by UUID should resolve chat type when param is a valid UUID
statusReason: expected "vi.fn()" to be called with arguments: [ Array(2) ]

Received:

  1st vi.fn() call:

  [
    "Resolving chat type by param",

[Killed] ConditionalExpression
adapters/secondary/repositories/ai-chat-content.repository.ts:240:14
 
     // Log with truncated param to prevent large log entries
     this.logger.debug('Resolving chat type by param', {
-      param: param.length > 50 ? param.substring(0, 50) + '...' : param,
+      param: true ? param.substring(0, 50) + '...' : param,
       length: param.length,
     })
killedBy: AIChatContentRepository resolveChatTypeByParam successful resolution by UUID should resolve chat type when param is a valid UUID
statusReason: expected "vi.fn()" to be called with arguments: [ Array(2) ]

Received:

  1st vi.fn() call:

  [
    "Resolving chat type by param",

[Survived] ConditionalExpression
adapters/secondary/repositories/ai-chat-content.repository.ts:248:9
     const isUUID = Uuid7Util.isValidUUID(param)
 
     // For non-UUID params, validate format to provide better error handling
-    if (!isUUID) {
+    if (false) {
       const isSeoFriendlyId = SEO_FRIENDLY_ID_PATTERN.test(param)
       const isSeoFriendlyBase64Id = SEO_FRIENDLY_BASE64_ID_PATTERN.test(param)

[Survived] ConditionalExpression
adapters/secondary/repositories/ai-chat-content.repository.ts:248:9
     const isUUID = Uuid7Util.isValidUUID(param)
 
     // For non-UUID params, validate format to provide better error handling
-    if (!isUUID) {
+    if (true) {
       const isSeoFriendlyId = SEO_FRIENDLY_ID_PATTERN.test(param)
       const isSeoFriendlyBase64Id = SEO_FRIENDLY_BASE64_ID_PATTERN.test(param)

[Killed] BooleanLiteral
adapters/secondary/repositories/ai-chat-content.repository.ts:252:11
       const isSeoFriendlyId = SEO_FRIENDLY_ID_PATTERN.test(param)
       const isSeoFriendlyBase64Id = SEO_FRIENDLY_BASE64_ID_PATTERN.test(param)
 
-      if (!isSeoFriendlyId && !isSeoFriendlyBase64Id) {
+      if (isSeoFriendlyId && !isSeoFriendlyBase64Id) {
         this.logger.debug('Chat type param has invalid format', {
           param: param.length > 50 ? param.substring(0, 50) + '...' : param,
killedBy: AIChatContentRepository resolveChatTypeByParam successful resolution by seoFriendlyId should not check UUID column when param is not a valid UUID
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
adapters/secondary/repositories/ai-chat-content.repository.ts:252:11
       const isSeoFriendlyId = SEO_FRIENDLY_ID_PATTERN.test(param)
       const isSeoFriendlyBase64Id = SEO_FRIENDLY_BASE64_ID_PATTERN.test(param)
 
-      if (!isSeoFriendlyId && !isSeoFriendlyBase64Id) {
+      if (true) {
         this.logger.debug('Chat type param has invalid format', {
           param: param.length > 50 ? param.substring(0, 50) + '...' : param,
killedBy: AIChatContentRepository resolveChatTypeByParam successful resolution by seoFriendlyId should not check UUID column when param is not a valid UUID
statusReason: expected "vi.fn()" to be called at least once

[Survived] ConditionalExpression
adapters/secondary/repositories/ai-chat-content.repository.ts:254:18
 
       if (!isSeoFriendlyId && !isSeoFriendlyBase64Id) {
         this.logger.debug('Chat type param has invalid format', {
-          param: param.length > 50 ? param.substring(0, 50) + '...' : param,
+          param: false ? param.substring(0, 50) + '...' : param,
           length: param.length,
           isSeoFriendlyId,

[Survived] ConditionalExpression
adapters/secondary/repositories/ai-chat-content.repository.ts:254:18
 
       if (!isSeoFriendlyId && !isSeoFriendlyBase64Id) {
         this.logger.debug('Chat type param has invalid format', {
-          param: param.length > 50 ? param.substring(0, 50) + '...' : param,
+          param: true ? param.substring(0, 50) + '...' : param,
           length: param.length,
           isSeoFriendlyId,

[Survived] ArrayDeclaration
adapters/secondary/repositories/ai-chat-content.repository.ts:263:24
       }
     }
 
-    const conditions = [
-      eq(chatTypes.seoFriendlyId, param),
-      eq(chatTypes.seoFriendlyBase64Id, param),
-    ]
+    const conditions = []
 
     if (isUUID) {

[Survived] ConditionalExpression
adapters/secondary/repositories/ai-chat-content.repository.ts:268:9
       eq(chatTypes.seoFriendlyBase64Id, param),
     ]
 
-    if (isUUID) {
+    if (true) {
       conditions.unshift(eq(chatTypes.id, param))
     }

[Survived] ConditionalExpression
adapters/secondary/repositories/ai-chat-content.repository.ts:268:9
       eq(chatTypes.seoFriendlyBase64Id, param),
     ]
 
-    if (isUUID) {
+    if (false) {
       conditions.unshift(eq(chatTypes.id, param))
     }
