[Killed] BlockStatement
src/application/dtos/update-company.dto.ts:219:46
    * ```
    */
   static validate(data: components['schemas']['CompanyDetailsRequest']): UpdateCompanyDTO {
-    if (!isDefined(data) || !isObject(data)) {
-      throw new TypeException('Invalid data: expected an object')
-    }
+    if (!isDefined(data) || !isObject(data)) {}
 
     const { company, keyPerson } = data
killedBy: UpdateCompanyDTO validate() - type validation should throw TypeException when data is undefined
statusReason: expected error to be instance of TypeException

[Killed] LogicalOperator
src/application/dtos/update-company.dto.ts:219:9
    * ```
    */
   static validate(data: components['schemas']['CompanyDetailsRequest']): UpdateCompanyDTO {
-    if (!isDefined(data) || !isObject(data)) {
+    if (!isDefined(data) && !isObject(data)) {
       throw new TypeException('Invalid data: expected an object')
     }
killedBy: UpdateCompanyDTO validate() - type validation should throw TypeException when data is not an object
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
src/application/dtos/update-company.dto.ts:225:9
 
     const { company, keyPerson } = data
 
-    if (isDefined(company) && !isObject(company)) {
+    if (false) {
       throw new ValidationException('Invalid company: must be a defined object')
     }
killedBy: UpdateCompanyDTO validate() - type validation should throw ValidationException when company is not an object
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
src/application/dtos/update-company.dto.ts:225:51
 
     const { company, keyPerson } = data
 
-    if (isDefined(company) && !isObject(company)) {
-      throw new ValidationException('Invalid company: must be a defined object')
-    }
+    if (isDefined(company) && !isObject(company)) {}
 
     if (isDefined(company) && isDefined(company.companyId)) {
killedBy: UpdateCompanyDTO validate() - type validation should throw ValidationException when company is not an object
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
src/application/dtos/update-company.dto.ts:229:61
       throw new ValidationException('Invalid company: must be a defined object')
     }
 
-    if (isDefined(company) && isDefined(company.companyId)) {
-      if (!isString(company.companyId)) {
-        throw new ValidationException('Invalid companyId: must be a string')
-      }
-      try {
-        new Uuid(company.companyId)
-      } catch {
-        throw new ValidationException('Invalid companyId: must be a valid UUID')
-      }
-    }
+    if (isDefined(company) && isDefined(company.companyId)) {}
 
     if (isDefined(company) && isDefined(company.legalName) && !isString(company.legalName)) {
killedBy: UpdateCompanyDTO validate() - company.companyId validation should throw ValidationException when companyId is not a string
statusReason: expected function to throw an error, but it didn't

[Killed] BooleanLiteral
src/application/dtos/update-company.dto.ts:230:11
     }
 
     if (isDefined(company) && isDefined(company.companyId)) {
-      if (!isString(company.companyId)) {
+      if (isString(company.companyId)) {
         throw new ValidationException('Invalid companyId: must be a string')
       }
killedBy: UpdateCompanyDTO validate() - company.companyId validation should accept valid UUID v7 for companyId
statusReason: Invalid companyId: must be a string

[Killed] BlockStatement
src/application/dtos/update-company.dto.ts:230:41
     }
 
     if (isDefined(company) && isDefined(company.companyId)) {
-      if (!isString(company.companyId)) {
-        throw new ValidationException('Invalid companyId: must be a string')
-      }
+      if (!isString(company.companyId)) {}
       try {
         new Uuid(company.companyId)
killedBy: UpdateCompanyDTO validate() - company.companyId validation should throw ValidationException when companyId is not a string
statusReason: expected [Function] to throw error including 'Invalid companyId: must be a string' but got 'Invalid companyId: must be a valid UU…'

[Killed] BlockStatement
src/application/dtos/update-company.dto.ts:233:11
       if (!isString(company.companyId)) {
         throw new ValidationException('Invalid companyId: must be a string')
       }
-      try {
-        new Uuid(company.companyId)
-      } catch {
+      try {} catch {
         throw new ValidationException('Invalid companyId: must be a valid UUID')
       }
killedBy: CompanyController updateCompanyDetails() validation should reject invalid request body
statusReason: expected "vi.fn()" to be called with arguments: [ { success: false, …(1) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] BlockStatement
src/application/dtos/update-company.dto.ts:235:15
       }
       try {
         new Uuid(company.companyId)
-      } catch {
-        throw new ValidationException('Invalid companyId: must be a valid UUID')
-      }
+      } catch {}
     }
 
killedBy: CompanyController updateCompanyDetails() validation should reject invalid request body
statusReason: expected "vi.fn()" to be called with arguments: [ { success: false, …(1) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] ConditionalExpression
src/application/dtos/update-company.dto.ts:240:9
       }
     }
 
-    if (isDefined(company) && isDefined(company.legalName) && !isString(company.legalName)) {
+    if (false) {
       throw new ValidationException('Invalid legalName: must be a string')
     }
killedBy: UpdateCompanyDTO validate() - company.legalName validation should throw ValidationException when legalName is not a string
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/application/dtos/update-company.dto.ts:240:63
       }
     }
 
-    if (isDefined(company) && isDefined(company.legalName) && !isString(company.legalName)) {
+    if (isDefined(company) && isDefined(company.legalName) && isString(company.legalName)) {
       throw new ValidationException('Invalid legalName: must be a string')
     }
killedBy: UpdateCompanyDTO validate() - company.legalName validation should accept valid legalName
statusReason: Invalid legalName: must be a string

[Killed] ConditionalExpression
src/application/dtos/update-company.dto.ts:245:7
     }
 
     if (
-      isDefined(company) &&
-      isDefined(company.legalName) &&
-      isString(company.legalName) &&
-      (company.legalName.length < 2 || company.legalName.length > 200)
+      false
     ) {
       throw new ValidationException('Invalid legalName: must be between 2 and 200 characters long')
killedBy: UpdateCompanyDTO validate() - company.legalName validation should throw ValidationException when legalName is too short
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/application/dtos/update-company.dto.ts:248:40
       isDefined(company) &&
       isDefined(company.legalName) &&
       isString(company.legalName) &&
-      (company.legalName.length < 2 || company.legalName.length > 200)
+      (company.legalName.length < 2 || company.legalName.length >= 200)
     ) {
       throw new ValidationException('Invalid legalName: must be between 2 and 200 characters long')
killedBy: UpdateCompanyDTO validate() - company.legalName validation should accept legalName at maximum length
statusReason: Invalid legalName: must be between 2 and 200 characters long

[Killed] ConditionalExpression
src/application/dtos/update-company.dto.ts:248:40
       isDefined(company) &&
       isDefined(company.legalName) &&
       isString(company.legalName) &&
-      (company.legalName.length < 2 || company.legalName.length > 200)
+      (company.legalName.length < 2 || false)
     ) {
       throw new ValidationException('Invalid legalName: must be between 2 and 200 characters long')
killedBy: UpdateCompanyDTO validate() - company.legalName validation should throw ValidationException when legalName is too long
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/application/dtos/update-company.dto.ts:249:7
       isDefined(company.legalName) &&
       isString(company.legalName) &&
       (company.legalName.length < 2 || company.legalName.length > 200)
-    ) {
-      throw new ValidationException('Invalid legalName: must be between 2 and 200 characters long')
-    }
+    ) {}
 
     if (isDefined(company) && isDefined(company.displayName) && !isString(company.displayName)) {
killedBy: UpdateCompanyDTO validate() - company.legalName validation should throw ValidationException when legalName is too short
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/application/dtos/update-company.dto.ts:253:65
       throw new ValidationException('Invalid legalName: must be between 2 and 200 characters long')
     }
 
-    if (isDefined(company) && isDefined(company.displayName) && !isString(company.displayName)) {
+    if (isDefined(company) && isDefined(company.displayName) && isString(company.displayName)) {
       throw new ValidationException('Invalid displayName: must be a string')
     }
killedBy: UpdateCompanyDTO validate() - company.displayName validation should accept valid displayName
statusReason: Invalid displayName: must be a string

[Killed] BlockStatement
src/application/dtos/update-company.dto.ts:253:97
       throw new ValidationException('Invalid legalName: must be between 2 and 200 characters long')
     }
 
-    if (isDefined(company) && isDefined(company.displayName) && !isString(company.displayName)) {
-      throw new ValidationException('Invalid displayName: must be a string')
-    }
+    if (isDefined(company) && isDefined(company.displayName) && !isString(company.displayName)) {}
 
     if (
killedBy: UpdateCompanyDTO validate() - company.displayName validation should throw ValidationException when displayName is not a string
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/application/dtos/update-company.dto.ts:254:37
     }
 
     if (isDefined(company) && isDefined(company.displayName) && !isString(company.displayName)) {
-      throw new ValidationException('Invalid displayName: must be a string')
+      throw new ValidationException("")
     }
 
killedBy: UpdateCompanyDTO validate() - company.displayName validation should throw ValidationException when displayName is not a string
statusReason: expected [Function] to throw error including 'Invalid displayName: must be a string' but got ''

[Killed] ConditionalExpression
src/application/dtos/update-company.dto.ts:258:7
     }
 
     if (
-      isDefined(company) &&
-      isDefined(company.displayName) &&
-      isString(company.displayName) &&
-      (company.displayName.length < 2 || company.displayName.length > 200)
+      false
     ) {
       throw new ValidationException(
killedBy: UpdateCompanyDTO validate() - company.displayName validation should throw ValidationException when displayName is too short
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/application/dtos/update-company.dto.ts:261:42
       isDefined(company) &&
       isDefined(company.displayName) &&
       isString(company.displayName) &&
-      (company.displayName.length < 2 || company.displayName.length > 200)
+      (company.displayName.length < 2 || false)
     ) {
       throw new ValidationException(
killedBy: UpdateCompanyDTO validate() - company.displayName validation should throw ValidationException when displayName is too long
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/application/dtos/update-company.dto.ts:261:8
       isDefined(company) &&
       isDefined(company.displayName) &&
       isString(company.displayName) &&
-      (company.displayName.length < 2 || company.displayName.length > 200)
+      (company.displayName.length >= 2 || company.displayName.length > 200)
     ) {
       throw new ValidationException(
killedBy: UpdateCompanyDTO validate() - company.displayName validation should accept valid displayName
statusReason: Invalid displayName: must be between 2 and 200 characters long

[Killed] BlockStatement
src/application/dtos/update-company.dto.ts:262:7
       isDefined(company.displayName) &&
       isString(company.displayName) &&
       (company.displayName.length < 2 || company.displayName.length > 200)
-    ) {
-      throw new ValidationException(
-        'Invalid displayName: must be between 2 and 200 characters long'
-      )
-    }
+    ) {}
 
     if (isDefined(company) && isDefined(company.status) && !isString(company.status)) {
killedBy: UpdateCompanyDTO validate() - company.displayName validation should throw ValidationException when displayName is too short
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/application/dtos/update-company.dto.ts:268:9
       )
     }
 
-    if (isDefined(company) && isDefined(company.status) && !isString(company.status)) {
+    if (false) {
       throw new ValidationException('Invalid status: must be a string')
     }
killedBy: UpdateCompanyDTO validate() - company.status validation should throw ValidationException when status is not a string
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/application/dtos/update-company.dto.ts:268:87
       )
     }
 
-    if (isDefined(company) && isDefined(company.status) && !isString(company.status)) {
-      throw new ValidationException('Invalid status: must be a string')
-    }
+    if (isDefined(company) && isDefined(company.status) && !isString(company.status)) {}
 
     if (
killedBy: UpdateCompanyDTO validate() - company.status validation should throw ValidationException when status is not a string
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/application/dtos/update-company.dto.ts:273:7
     }
 
     if (
-      isDefined(company) &&
-      isDefined(company.status) &&
-      isString(company.status) &&
-      !['prospect', 'active', 'paused', 'churned'].includes(company.status)
+      false
     ) {
       throw new ValidationException(
killedBy: UpdateCompanyDTO validate() - company.status validation should throw ValidationException when status is invalid
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/application/dtos/update-company.dto.ts:276:7
       isDefined(company) &&
       isDefined(company.status) &&
       isString(company.status) &&
-      !['prospect', 'active', 'paused', 'churned'].includes(company.status)
+      ['prospect', 'active', 'paused', 'churned'].includes(company.status)
     ) {
       throw new ValidationException(
killedBy: CompanyController updateCompanyDetails() successful updates should update both company and key person
statusReason: expected "vi.fn()" to be called with arguments: [ 204 ]

Number of calls: 0

[Killed] StringLiteral
src/application/dtos/update-company.dto.ts:276:31
       isDefined(company) &&
       isDefined(company.status) &&
       isString(company.status) &&
-      !['prospect', 'active', 'paused', 'churned'].includes(company.status)
+      !['prospect', 'active', "", 'churned'].includes(company.status)
     ) {
       throw new ValidationException(
killedBy: UpdateCompanyDTO validate() - company.status validation should accept valid status "paused"
statusReason: Invalid status: must be one of "prospect", "active", "paused", "churned"

[Killed] BlockStatement
src/application/dtos/update-company.dto.ts:277:7
       isDefined(company.status) &&
       isString(company.status) &&
       !['prospect', 'active', 'paused', 'churned'].includes(company.status)
-    ) {
-      throw new ValidationException(
-        'Invalid status: must be one of "prospect", "active", "paused", "churned"'
-      )
-    }
+    ) {}
 
     if (isDefined(company) && isDefined(company.industry) && !isString(company.industry)) {
killedBy: UpdateCompanyDTO validate() - company.status validation should throw ValidationException when status is invalid
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/application/dtos/update-company.dto.ts:283:62
       )
     }
 
-    if (isDefined(company) && isDefined(company.industry) && !isString(company.industry)) {
+    if (isDefined(company) && isDefined(company.industry) && isString(company.industry)) {
       throw new ValidationException('Invalid industry: must be a string')
     }
killedBy: UpdateCompanyDTO validate() - company.industry validation should accept valid industry
statusReason: Invalid industry: must be a string

[Killed] ConditionalExpression
src/application/dtos/update-company.dto.ts:283:9
       )
     }
 
-    if (isDefined(company) && isDefined(company.industry) && !isString(company.industry)) {
+    if (false) {
       throw new ValidationException('Invalid industry: must be a string')
     }
killedBy: UpdateCompanyDTO validate() - company.industry validation should throw ValidationException when industry is not a string
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/application/dtos/update-company.dto.ts:288:7
     }
 
     if (
-      isDefined(company) &&
-      isDefined(company.industry) &&
-      isString(company.industry) &&
-      company.industry.length > 100
+      false
     ) {
       throw new ValidationException('Invalid industry: must be less than 100 characters long')
killedBy: UpdateCompanyDTO validate() - company.industry validation should throw ValidationException when industry is too long
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/application/dtos/update-company.dto.ts:291:7
       isDefined(company) &&
       isDefined(company.industry) &&
       isString(company.industry) &&
-      company.industry.length > 100
+      true
     ) {
       throw new ValidationException('Invalid industry: must be less than 100 characters long')
killedBy: UpdateCompanyDTO validate() - company.industry validation should accept valid industry
statusReason: Invalid industry: must be less than 100 characters long

[Killed] EqualityOperator
src/application/dtos/update-company.dto.ts:291:7
       isDefined(company) &&
       isDefined(company.industry) &&
       isString(company.industry) &&
-      company.industry.length > 100
+      company.industry.length >= 100
     ) {
       throw new ValidationException('Invalid industry: must be less than 100 characters long')
killedBy: UpdateCompanyDTO validate() - company.industry validation should accept industry at maximum length
statusReason: Invalid industry: must be less than 100 characters long

[Killed] BlockStatement
src/application/dtos/update-company.dto.ts:292:7
       isDefined(company.industry) &&
       isString(company.industry) &&
       company.industry.length > 100
-    ) {
-      throw new ValidationException('Invalid industry: must be less than 100 characters long')
-    }
+    ) {}
 
     if (isDefined(company) && isDefined(company.companySize) && !isNumber(company.companySize)) {
killedBy: UpdateCompanyDTO validate() - company.industry validation should throw ValidationException when industry is too long
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/application/dtos/update-company.dto.ts:296:97
       throw new ValidationException('Invalid industry: must be less than 100 characters long')
     }
 
-    if (isDefined(company) && isDefined(company.companySize) && !isNumber(company.companySize)) {
-      throw new ValidationException('Invalid companySize: must be a number')
-    }
+    if (isDefined(company) && isDefined(company.companySize) && !isNumber(company.companySize)) {}
 
     if (
killedBy: UpdateCompanyDTO validate() - company.companySize validation should throw ValidationException when companySize is not a number
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/application/dtos/update-company.dto.ts:296:65
       throw new ValidationException('Invalid industry: must be less than 100 characters long')
     }
 
-    if (isDefined(company) && isDefined(company.companySize) && !isNumber(company.companySize)) {
+    if (isDefined(company) && isDefined(company.companySize) && isNumber(company.companySize)) {
       throw new ValidationException('Invalid companySize: must be a number')
     }
killedBy: UpdateCompanyDTO validate() - company.companySize validation should accept valid companySize
statusReason: Invalid companySize: must be a number

[Killed] StringLiteral
src/application/dtos/update-company.dto.ts:297:37
     }
 
     if (isDefined(company) && isDefined(company.companySize) && !isNumber(company.companySize)) {
-      throw new ValidationException('Invalid companySize: must be a number')
+      throw new ValidationException("")
     }
 
killedBy: UpdateCompanyDTO validate() - company.companySize validation should throw ValidationException when companySize is not a number
statusReason: expected [Function] to throw error including 'Invalid companySize: must be a number' but got ''

[Killed] ConditionalExpression
src/application/dtos/update-company.dto.ts:301:7
     }
 
     if (
-      isDefined(company) &&
-      isDefined(company.companySize) &&
-      isNumber(company.companySize) &&
-      company.companySize < 1
+      false
     ) {
       throw new ValidationException('Invalid companySize: must be greater than 0')
killedBy: UpdateCompanyDTO validate() - company.companySize validation should throw ValidationException when companySize is less than 1
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/application/dtos/update-company.dto.ts:304:7
       isDefined(company) &&
       isDefined(company.companySize) &&
       isNumber(company.companySize) &&
-      company.companySize < 1
+      company.companySize >= 1
     ) {
       throw new ValidationException('Invalid companySize: must be greater than 0')
killedBy: UpdateCompanyDTO validate() - company.companySize validation should accept valid companySize
statusReason: Invalid companySize: must be greater than 0

[Killed] ConditionalExpression
src/application/dtos/update-company.dto.ts:304:7
       isDefined(company) &&
       isDefined(company.companySize) &&
       isNumber(company.companySize) &&
-      company.companySize < 1
+      true
     ) {
       throw new ValidationException('Invalid companySize: must be greater than 0')
killedBy: UpdateCompanyDTO validate() - company.companySize validation should accept valid companySize
statusReason: Invalid companySize: must be greater than 0

[Killed] BlockStatement
src/application/dtos/update-company.dto.ts:305:7
       isDefined(company.companySize) &&
       isNumber(company.companySize) &&
       company.companySize < 1
-    ) {
-      throw new ValidationException('Invalid companySize: must be greater than 0')
-    }
+    ) {}
 
     if (isDefined(company) && isDefined(company.websiteUrl) && !isString(company.websiteUrl)) {
killedBy: UpdateCompanyDTO validate() - company.companySize validation should throw ValidationException when companySize is less than 1
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/application/dtos/update-company.dto.ts:309:95
       throw new ValidationException('Invalid companySize: must be greater than 0')
     }
 
-    if (isDefined(company) && isDefined(company.websiteUrl) && !isString(company.websiteUrl)) {
-      throw new ValidationException('Invalid websiteUrl: must be a string')
-    }
+    if (isDefined(company) && isDefined(company.websiteUrl) && !isString(company.websiteUrl)) {}
 
     if (isDefined(company) && isDefined(company.websiteUrl) && isString(company.websiteUrl)) {
killedBy: UpdateCompanyDTO validate() - company.websiteUrl validation should throw ValidationException when websiteUrl is not a string
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/application/dtos/update-company.dto.ts:309:9
       throw new ValidationException('Invalid companySize: must be greater than 0')
     }
 
-    if (isDefined(company) && isDefined(company.websiteUrl) && !isString(company.websiteUrl)) {
+    if (false) {
       throw new ValidationException('Invalid websiteUrl: must be a string')
     }
killedBy: UpdateCompanyDTO validate() - company.websiteUrl validation should throw ValidationException when websiteUrl is not a string
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/application/dtos/update-company.dto.ts:310:37
     }
 
     if (isDefined(company) && isDefined(company.websiteUrl) && !isString(company.websiteUrl)) {
-      throw new ValidationException('Invalid websiteUrl: must be a string')
+      throw new ValidationException("")
     }
 
killedBy: UpdateCompanyDTO validate() - company.websiteUrl validation should throw ValidationException when websiteUrl is not a string
statusReason: expected [Function] to throw error including 'Invalid websiteUrl: must be a string' but got ''

[Killed] BlockStatement
src/application/dtos/update-company.dto.ts:313:94
       throw new ValidationException('Invalid websiteUrl: must be a string')
     }
 
-    if (isDefined(company) && isDefined(company.websiteUrl) && isString(company.websiteUrl)) {
-      try {
-        new URL(company.websiteUrl)
-      } catch {
-        throw new ValidationException('Invalid websiteUrl: must be a valid URL')
-      }
-    }
+    if (isDefined(company) && isDefined(company.websiteUrl) && isString(company.websiteUrl)) {}
 
     if (
killedBy: UpdateCompanyDTO validate() - company.websiteUrl validation should throw ValidationException when websiteUrl is invalid
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/application/dtos/update-company.dto.ts:314:11
     }
 
     if (isDefined(company) && isDefined(company.websiteUrl) && isString(company.websiteUrl)) {
-      try {
-        new URL(company.websiteUrl)
-      } catch {
+      try {} catch {
         throw new ValidationException('Invalid websiteUrl: must be a valid URL')
       }
killedBy: UpdateCompanyDTO validate() - company.websiteUrl validation should throw ValidationException when websiteUrl is invalid
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/application/dtos/update-company.dto.ts:316:15
     if (isDefined(company) && isDefined(company.websiteUrl) && isString(company.websiteUrl)) {
       try {
         new URL(company.websiteUrl)
-      } catch {
-        throw new ValidationException('Invalid websiteUrl: must be a valid URL')
-      }
+      } catch {}
     }
 
killedBy: UpdateCompanyDTO validate() - company.websiteUrl validation should throw ValidationException when websiteUrl is invalid
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/application/dtos/update-company.dto.ts:322:7
     }
 
     if (
-      isDefined(company) &&
-      isDefined(company.billingCountry) &&
-      !isString(company.billingCountry)
+      false
     ) {
       throw new ValidationException('Invalid billingCountry: must be a string')
killedBy: UpdateCompanyDTO validate() - company.billingCountry validation should throw ValidationException when billingCountry is not a string
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/application/dtos/update-company.dto.ts:324:7
     if (
       isDefined(company) &&
       isDefined(company.billingCountry) &&
-      !isString(company.billingCountry)
+      isString(company.billingCountry)
     ) {
       throw new ValidationException('Invalid billingCountry: must be a string')
killedBy: UpdateCompanyDTO validate() - company.billingCountry validation should accept valid billingCountry
statusReason: Invalid billingCountry: must be a string

[Killed] BlockStatement
src/application/dtos/update-company.dto.ts:325:7
       isDefined(company) &&
       isDefined(company.billingCountry) &&
       !isString(company.billingCountry)
-    ) {
-      throw new ValidationException('Invalid billingCountry: must be a string')
-    }
+    ) {}
 
     if (
killedBy: UpdateCompanyDTO validate() - company.billingCountry validation should throw ValidationException when billingCountry is not a string
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/application/dtos/update-company.dto.ts:330:7
     }
 
     if (
-      isDefined(company) &&
-      isDefined(company.billingCountry) &&
-      isString(company.billingCountry) &&
-      !/^[A-Z]{2}$/.test(company.billingCountry)
+      false
     ) {
       throw new ValidationException(
killedBy: UpdateCompanyDTO validate() - company.billingCountry validation should throw ValidationException when billingCountry is not 2 letters
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/application/dtos/update-company.dto.ts:333:7
       isDefined(company) &&
       isDefined(company.billingCountry) &&
       isString(company.billingCountry) &&
-      !/^[A-Z]{2}$/.test(company.billingCountry)
+      /^[A-Z]{2}$/.test(company.billingCountry)
     ) {
       throw new ValidationException(
killedBy: UpdateCompanyDTO validate() - company.billingCountry validation should accept valid billingCountry
statusReason: Invalid billingCountry: must be a 2-letter ISO country code (uppercase)

[Killed] Regex
src/application/dtos/update-company.dto.ts:333:8
       isDefined(company) &&
       isDefined(company.billingCountry) &&
       isString(company.billingCountry) &&
-      !/^[A-Z]{2}$/.test(company.billingCountry)
+      !/^[A-Z]{2}/.test(company.billingCountry)
     ) {
       throw new ValidationException(
killedBy: UpdateCompanyDTO validate() - company.billingCountry validation should throw ValidationException when billingCountry is not 2 letters
statusReason: expected [Function] to throw an error
