[Killed] BlockStatement
src/application/dtos/update-company.dto.ts:334:7
       isDefined(company.billingCountry) &&
       isString(company.billingCountry) &&
       !/^[A-Z]{2}$/.test(company.billingCountry)
-    ) {
-      throw new ValidationException(
-        'Invalid billingCountry: must be a 2-letter ISO country code (uppercase)'
-      )
-    }
+    ) {}
 
     if (isDefined(company) && isDefined(company.timezone) && !isString(company.timezone)) {
killedBy: UpdateCompanyDTO validate() - company.billingCountry validation should throw ValidationException when billingCountry is not 2 letters
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/application/dtos/update-company.dto.ts:340:9
       )
     }
 
-    if (isDefined(company) && isDefined(company.timezone) && !isString(company.timezone)) {
+    if (false) {
       throw new ValidationException('Invalid timezone: must be a string')
     }
killedBy: UpdateCompanyDTO validate() - company.timezone validation should throw ValidationException when timezone is not a string
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/application/dtos/update-company.dto.ts:340:91
       )
     }
 
-    if (isDefined(company) && isDefined(company.timezone) && !isString(company.timezone)) {
-      throw new ValidationException('Invalid timezone: must be a string')
-    }
+    if (isDefined(company) && isDefined(company.timezone) && !isString(company.timezone)) {}
 
     // Validate keyPerson object
killedBy: UpdateCompanyDTO validate() - company.timezone validation should throw ValidationException when timezone is not a string
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/application/dtos/update-company.dto.ts:345:55
     }
 
     // Validate keyPerson object
-    if (isDefined(keyPerson) && !isObject(keyPerson)) {
-      throw new ValidationException('Invalid keyPerson: must be a defined object')
-    }
+    if (isDefined(keyPerson) && !isObject(keyPerson)) {}
 
     if (isDefined(keyPerson?.keyPersonId)) {
killedBy: UpdateCompanyDTO validate() - type validation should throw ValidationException when keyPerson is not an object
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
src/application/dtos/update-company.dto.ts:345:9
     }
 
     // Validate keyPerson object
-    if (isDefined(keyPerson) && !isObject(keyPerson)) {
+    if (false) {
       throw new ValidationException('Invalid keyPerson: must be a defined object')
     }
killedBy: UpdateCompanyDTO validate() - type validation should throw ValidationException when keyPerson is not an object
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
src/application/dtos/update-company.dto.ts:349:44
       throw new ValidationException('Invalid keyPerson: must be a defined object')
     }
 
-    if (isDefined(keyPerson?.keyPersonId)) {
-      if (!isString(keyPerson.keyPersonId)) {
-        throw new ValidationException('Invalid keyPersonId: must be a string')
-      }
-      try {
-        new Uuid(keyPerson.keyPersonId)
-      } catch {
-        throw new ValidationException('Invalid keyPersonId: must be a valid UUID')
-      }
-    }
+    if (isDefined(keyPerson?.keyPersonId)) {}
 
     if (isDefined(keyPerson?.firstName) && !isString(keyPerson.firstName)) {
killedBy: UpdateCompanyDTO validate() - keyPerson.keyPersonId validation should throw ValidationException when keyPersonId is not a string
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/application/dtos/update-company.dto.ts:350:11
     }
 
     if (isDefined(keyPerson?.keyPersonId)) {
-      if (!isString(keyPerson.keyPersonId)) {
+      if (false) {
         throw new ValidationException('Invalid keyPersonId: must be a string')
       }
killedBy: UpdateCompanyDTO validate() - keyPerson.keyPersonId validation should throw ValidationException when keyPersonId is not a string
statusReason: expected [Function] to throw error including 'Invalid keyPersonId: must be a string' but got 'Invalid keyPersonId: must be a valid …'

[Killed] BlockStatement
src/application/dtos/update-company.dto.ts:350:45
     }
 
     if (isDefined(keyPerson?.keyPersonId)) {
-      if (!isString(keyPerson.keyPersonId)) {
-        throw new ValidationException('Invalid keyPersonId: must be a string')
-      }
+      if (!isString(keyPerson.keyPersonId)) {}
       try {
         new Uuid(keyPerson.keyPersonId)
killedBy: UpdateCompanyDTO validate() - keyPerson.keyPersonId validation should throw ValidationException when keyPersonId is not a string
statusReason: expected [Function] to throw error including 'Invalid keyPersonId: must be a string' but got 'Invalid keyPersonId: must be a valid …'

[Killed] BlockStatement
src/application/dtos/update-company.dto.ts:353:11
       if (!isString(keyPerson.keyPersonId)) {
         throw new ValidationException('Invalid keyPersonId: must be a string')
       }
-      try {
-        new Uuid(keyPerson.keyPersonId)
-      } catch {
+      try {} catch {
         throw new ValidationException('Invalid keyPersonId: must be a valid UUID')
       }
killedBy: UpdateCompanyDTO validate() - keyPerson.keyPersonId validation should throw ValidationException when keyPersonId is not a valid UUID
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/application/dtos/update-company.dto.ts:355:15
       }
       try {
         new Uuid(keyPerson.keyPersonId)
-      } catch {
-        throw new ValidationException('Invalid keyPersonId: must be a valid UUID')
-      }
+      } catch {}
     }
 
killedBy: UpdateCompanyDTO validate() - keyPerson.keyPersonId validation should throw ValidationException when keyPersonId is not a valid UUID
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/application/dtos/update-company.dto.ts:360:76
       }
     }
 
-    if (isDefined(keyPerson?.firstName) && !isString(keyPerson.firstName)) {
-      throw new ValidationException('Invalid firstName: must be a string')
-    }
+    if (isDefined(keyPerson?.firstName) && !isString(keyPerson.firstName)) {}
 
     if (
killedBy: UpdateCompanyDTO validate() - keyPerson.firstName validation should throw ValidationException when firstName is not a string
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/application/dtos/update-company.dto.ts:360:9
       }
     }
 
-    if (isDefined(keyPerson?.firstName) && !isString(keyPerson.firstName)) {
+    if (false) {
       throw new ValidationException('Invalid firstName: must be a string')
     }
killedBy: UpdateCompanyDTO validate() - keyPerson.firstName validation should throw ValidationException when firstName is not a string
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/application/dtos/update-company.dto.ts:365:7
     }
 
     if (
-      isDefined(keyPerson?.firstName) &&
-      (keyPerson.firstName.length < 1 || keyPerson.firstName.length > 100)
+      false
     ) {
       throw new ValidationException('Invalid firstName: must be between 1 and 100 characters long')
killedBy: UpdateCompanyDTO validate() - keyPerson.firstName validation should throw ValidationException when firstName is too short
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/application/dtos/update-company.dto.ts:366:42
 
     if (
       isDefined(keyPerson?.firstName) &&
-      (keyPerson.firstName.length < 1 || keyPerson.firstName.length > 100)
+      (keyPerson.firstName.length < 1 || keyPerson.firstName.length >= 100)
     ) {
       throw new ValidationException('Invalid firstName: must be between 1 and 100 characters long')
killedBy: UpdateCompanyDTO validate() - keyPerson.firstName validation should accept firstName at maximum length
statusReason: Invalid firstName: must be between 1 and 100 characters long

[Killed] ConditionalExpression
src/application/dtos/update-company.dto.ts:366:8
 
     if (
       isDefined(keyPerson?.firstName) &&
-      (keyPerson.firstName.length < 1 || keyPerson.firstName.length > 100)
+      (true)
     ) {
       throw new ValidationException('Invalid firstName: must be between 1 and 100 characters long')
killedBy: UpdateCompanyDTO validate() - keyPerson.firstName validation should accept valid firstName
statusReason: Invalid firstName: must be between 1 and 100 characters long

[Killed] BlockStatement
src/application/dtos/update-company.dto.ts:367:7
     if (
       isDefined(keyPerson?.firstName) &&
       (keyPerson.firstName.length < 1 || keyPerson.firstName.length > 100)
-    ) {
-      throw new ValidationException('Invalid firstName: must be between 1 and 100 characters long')
-    }
+    ) {}
 
     if (isDefined(keyPerson?.lastName) && !isString(keyPerson.lastName)) {
killedBy: UpdateCompanyDTO validate() - keyPerson.firstName validation should throw ValidationException when firstName is too short
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/application/dtos/update-company.dto.ts:371:74
       throw new ValidationException('Invalid firstName: must be between 1 and 100 characters long')
     }
 
-    if (isDefined(keyPerson?.lastName) && !isString(keyPerson.lastName)) {
-      throw new ValidationException('Invalid lastName: must be a string')
-    }
+    if (isDefined(keyPerson?.lastName) && !isString(keyPerson.lastName)) {}
 
     if (
killedBy: UpdateCompanyDTO validate() - keyPerson.lastName validation should throw ValidationException when lastName is not a string
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/application/dtos/update-company.dto.ts:371:9
       throw new ValidationException('Invalid firstName: must be between 1 and 100 characters long')
     }
 
-    if (isDefined(keyPerson?.lastName) && !isString(keyPerson.lastName)) {
+    if (false) {
       throw new ValidationException('Invalid lastName: must be a string')
     }
killedBy: UpdateCompanyDTO validate() - keyPerson.lastName validation should throw ValidationException when lastName is not a string
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/application/dtos/update-company.dto.ts:372:37
     }
 
     if (isDefined(keyPerson?.lastName) && !isString(keyPerson.lastName)) {
-      throw new ValidationException('Invalid lastName: must be a string')
+      throw new ValidationException("")
     }
 
killedBy: UpdateCompanyDTO validate() - keyPerson.lastName validation should throw ValidationException when lastName is not a string
statusReason: expected [Function] to throw error including 'Invalid lastName: must be a string' but got ''

[Killed] ConditionalExpression
src/application/dtos/update-company.dto.ts:376:7
     }
 
     if (
-      isDefined(keyPerson?.lastName) &&
-      (keyPerson.lastName.length < 1 || keyPerson.lastName.length > 100)
+      false
     ) {
       throw new ValidationException('Invalid lastName: must be between 1 and 100 characters long')
killedBy: UpdateCompanyDTO validate() - keyPerson.lastName validation should throw ValidationException when lastName is too short
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/application/dtos/update-company.dto.ts:377:8
 
     if (
       isDefined(keyPerson?.lastName) &&
-      (keyPerson.lastName.length < 1 || keyPerson.lastName.length > 100)
+      (true)
     ) {
       throw new ValidationException('Invalid lastName: must be between 1 and 100 characters long')
killedBy: UpdateCompanyDTO validate() - keyPerson.lastName validation should accept valid lastName
statusReason: Invalid lastName: must be between 1 and 100 characters long

[Killed] LogicalOperator
src/application/dtos/update-company.dto.ts:377:8
 
     if (
       isDefined(keyPerson?.lastName) &&
-      (keyPerson.lastName.length < 1 || keyPerson.lastName.length > 100)
+      (keyPerson.lastName.length < 1 && keyPerson.lastName.length > 100)
     ) {
       throw new ValidationException('Invalid lastName: must be between 1 and 100 characters long')
killedBy: UpdateCompanyDTO validate() - keyPerson.lastName validation should throw ValidationException when lastName is too short
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/application/dtos/update-company.dto.ts:378:7
     if (
       isDefined(keyPerson?.lastName) &&
       (keyPerson.lastName.length < 1 || keyPerson.lastName.length > 100)
-    ) {
-      throw new ValidationException('Invalid lastName: must be between 1 and 100 characters long')
-    }
+    ) {}
 
     if (isDefined(keyPerson?.email) && !isString(keyPerson.email)) {
killedBy: UpdateCompanyDTO validate() - keyPerson.lastName validation should throw ValidationException when lastName is too short
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/application/dtos/update-company.dto.ts:382:68
       throw new ValidationException('Invalid lastName: must be between 1 and 100 characters long')
     }
 
-    if (isDefined(keyPerson?.email) && !isString(keyPerson.email)) {
-      throw new ValidationException('Invalid email: must be a string')
-    }
+    if (isDefined(keyPerson?.email) && !isString(keyPerson.email)) {}
 
     if (isDefined(keyPerson?.email) && !/^[^\s@]+@[^\s@]+\.[^\s@]+$/.test(keyPerson.email)) {
killedBy: UpdateCompanyDTO validate() - keyPerson.email validation should throw ValidationException when email is not a string
statusReason: expected [Function] to throw error including 'Invalid email: must be a string' but got 'Invalid email: must be a valid email …'

[Killed] ConditionalExpression
src/application/dtos/update-company.dto.ts:382:9
       throw new ValidationException('Invalid lastName: must be between 1 and 100 characters long')
     }
 
-    if (isDefined(keyPerson?.email) && !isString(keyPerson.email)) {
+    if (false) {
       throw new ValidationException('Invalid email: must be a string')
     }
killedBy: UpdateCompanyDTO validate() - keyPerson.email validation should throw ValidationException when email is not a string
statusReason: expected [Function] to throw error including 'Invalid email: must be a string' but got 'Invalid email: must be a valid email …'

[Killed] StringLiteral
src/application/dtos/update-company.dto.ts:383:37
     }
 
     if (isDefined(keyPerson?.email) && !isString(keyPerson.email)) {
-      throw new ValidationException('Invalid email: must be a string')
+      throw new ValidationException("")
     }
 
killedBy: UpdateCompanyDTO validate() - keyPerson.email validation should throw ValidationException when email is not a string
statusReason: expected [Function] to throw error including 'Invalid email: must be a string' but got ''

[Killed] BooleanLiteral
src/application/dtos/update-company.dto.ts:386:40
       throw new ValidationException('Invalid email: must be a string')
     }
 
-    if (isDefined(keyPerson?.email) && !/^[^\s@]+@[^\s@]+\.[^\s@]+$/.test(keyPerson.email)) {
+    if (isDefined(keyPerson?.email) && /^[^\s@]+@[^\s@]+\.[^\s@]+$/.test(keyPerson.email)) {
       throw new ValidationException('Invalid email: must be a valid email address')
     }
killedBy: UpdateCompanyDTO validate() - keyPerson.email validation should accept valid email
statusReason: Invalid email: must be a valid email address

[Killed] ConditionalExpression
src/application/dtos/update-company.dto.ts:386:9
       throw new ValidationException('Invalid email: must be a string')
     }
 
-    if (isDefined(keyPerson?.email) && !/^[^\s@]+@[^\s@]+\.[^\s@]+$/.test(keyPerson.email)) {
+    if (false) {
       throw new ValidationException('Invalid email: must be a valid email address')
     }
killedBy: UpdateCompanyDTO validate() - keyPerson.email validation should throw ValidationException when email is invalid
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/application/dtos/update-company.dto.ts:390:68
       throw new ValidationException('Invalid email: must be a valid email address')
     }
 
-    if (isDefined(keyPerson?.phone) && !isString(keyPerson.phone)) {
-      throw new ValidationException('Invalid phone: must be a string')
-    }
+    if (isDefined(keyPerson?.phone) && !isString(keyPerson.phone)) {}
 
     if (isDefined(keyPerson?.phone) && keyPerson.phone.length > 30) {
killedBy: UpdateCompanyDTO validate() - keyPerson.phone validation should throw ValidationException when phone is not a string
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/application/dtos/update-company.dto.ts:390:9
       throw new ValidationException('Invalid email: must be a valid email address')
     }
 
-    if (isDefined(keyPerson?.phone) && !isString(keyPerson.phone)) {
+    if (false) {
       throw new ValidationException('Invalid phone: must be a string')
     }
killedBy: UpdateCompanyDTO validate() - keyPerson.phone validation should throw ValidationException when phone is not a string
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/application/dtos/update-company.dto.ts:394:69
       throw new ValidationException('Invalid phone: must be a string')
     }
 
-    if (isDefined(keyPerson?.phone) && keyPerson.phone.length > 30) {
-      throw new ValidationException('Invalid phone: must be less than 30 characters long')
-    }
+    if (isDefined(keyPerson?.phone) && keyPerson.phone.length > 30) {}
 
     if (isDefined(keyPerson?.jobTitle) && !isString(keyPerson.jobTitle)) {
killedBy: UpdateCompanyDTO validate() - keyPerson.phone validation should throw ValidationException when phone is too long
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/application/dtos/update-company.dto.ts:394:40
       throw new ValidationException('Invalid phone: must be a string')
     }
 
-    if (isDefined(keyPerson?.phone) && keyPerson.phone.length > 30) {
+    if (isDefined(keyPerson?.phone) && keyPerson.phone.length >= 30) {
       throw new ValidationException('Invalid phone: must be less than 30 characters long')
     }
killedBy: UpdateCompanyDTO validate() - keyPerson.phone validation should accept phone at maximum length
statusReason: Invalid phone: must be less than 30 characters long

[Killed] StringLiteral
src/application/dtos/update-company.dto.ts:395:37
     }
 
     if (isDefined(keyPerson?.phone) && keyPerson.phone.length > 30) {
-      throw new ValidationException('Invalid phone: must be less than 30 characters long')
+      throw new ValidationException("")
     }
 
killedBy: UpdateCompanyDTO validate() - keyPerson.phone validation should throw ValidationException when phone is too long
statusReason: expected [Function] to throw error including 'Invalid phone: must be less than 30 c…' but got ''

[Killed] BlockStatement
src/application/dtos/update-company.dto.ts:398:74
       throw new ValidationException('Invalid phone: must be less than 30 characters long')
     }
 
-    if (isDefined(keyPerson?.jobTitle) && !isString(keyPerson.jobTitle)) {
-      throw new ValidationException('Invalid jobTitle: must be a string')
-    }
+    if (isDefined(keyPerson?.jobTitle) && !isString(keyPerson.jobTitle)) {}
 
     if (isDefined(keyPerson?.jobTitle) && keyPerson.jobTitle.length > 100) {
killedBy: UpdateCompanyDTO validate() - keyPerson.jobTitle validation should throw ValidationException when jobTitle is not a string
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/application/dtos/update-company.dto.ts:398:9
       throw new ValidationException('Invalid phone: must be less than 30 characters long')
     }
 
-    if (isDefined(keyPerson?.jobTitle) && !isString(keyPerson.jobTitle)) {
+    if (false) {
       throw new ValidationException('Invalid jobTitle: must be a string')
     }
killedBy: UpdateCompanyDTO validate() - keyPerson.jobTitle validation should throw ValidationException when jobTitle is not a string
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/application/dtos/update-company.dto.ts:399:37
     }
 
     if (isDefined(keyPerson?.jobTitle) && !isString(keyPerson.jobTitle)) {
-      throw new ValidationException('Invalid jobTitle: must be a string')
+      throw new ValidationException("")
     }
 
killedBy: UpdateCompanyDTO validate() - keyPerson.jobTitle validation should throw ValidationException when jobTitle is not a string
statusReason: expected [Function] to throw error including 'Invalid jobTitle: must be a string' but got ''

[Killed] ConditionalExpression
src/application/dtos/update-company.dto.ts:402:43
       throw new ValidationException('Invalid jobTitle: must be a string')
     }
 
-    if (isDefined(keyPerson?.jobTitle) && keyPerson.jobTitle.length > 100) {
+    if (isDefined(keyPerson?.jobTitle) && true) {
       throw new ValidationException('Invalid jobTitle: must be less than 100 characters long')
     }
killedBy: UpdateCompanyDTO validate() - keyPerson.jobTitle validation should accept valid jobTitle
statusReason: Invalid jobTitle: must be less than 100 characters long

[Killed] ConditionalExpression
src/application/dtos/update-company.dto.ts:402:9
       throw new ValidationException('Invalid jobTitle: must be a string')
     }
 
-    if (isDefined(keyPerson?.jobTitle) && keyPerson.jobTitle.length > 100) {
+    if (false) {
       throw new ValidationException('Invalid jobTitle: must be less than 100 characters long')
     }
killedBy: UpdateCompanyDTO validate() - keyPerson.jobTitle validation should throw ValidationException when jobTitle is too long
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/application/dtos/update-company.dto.ts:406:9
       throw new ValidationException('Invalid jobTitle: must be less than 100 characters long')
     }
 
-    if (isDefined(keyPerson?.isActive) && !isBoolean(keyPerson.isActive)) {
+    if (false) {
       throw new ValidationException('Invalid isActive: must be a boolean')
     }
killedBy: UpdateCompanyDTO validate() - keyPerson.isActive validation should throw ValidationException when isActive is not a boolean
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/application/dtos/update-company.dto.ts:406:75
       throw new ValidationException('Invalid jobTitle: must be less than 100 characters long')
     }
 
-    if (isDefined(keyPerson?.isActive) && !isBoolean(keyPerson.isActive)) {
-      throw new ValidationException('Invalid isActive: must be a boolean')
-    }
+    if (isDefined(keyPerson?.isActive) && !isBoolean(keyPerson.isActive)) {}
 
     return new UpdateCompanyDTO(company, keyPerson)
killedBy: UpdateCompanyDTO validate() - keyPerson.isActive validation should throw ValidationException when isActive is not a boolean
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/application/dtos/update-company.dto.ts:407:37
     }
 
     if (isDefined(keyPerson?.isActive) && !isBoolean(keyPerson.isActive)) {
-      throw new ValidationException('Invalid isActive: must be a boolean')
+      throw new ValidationException("")
     }
 
killedBy: UpdateCompanyDTO validate() - keyPerson.isActive validation should throw ValidationException when isActive is not a boolean
statusReason: expected [Function] to throw error including 'Invalid isActive: must be a boolean' but got ''
