[Killed] StringLiteral
src/application/use-cases/get-company-details.use-case.ts:146:71
       this.companyDetailsRepo.getKeyPersonDetails(),
     ])
 
-    this.logger.info('Company details fetched successfully', { event: 'company.fetch.success' })
+    this.logger.info('Company details fetched successfully', { event: "" })
     return { company, keyPerson }
   }
killedBy: GetCompanyDetailsUseCase execute() - successful scenarios should retrieve company and key person details successfully
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
-   "Company details fetched successfully",

[Killed] StringLiteral
src/application/use-cases/get-company-details.use-case.ts:146:22
       this.companyDetailsRepo.getKeyPersonDetails(),
     ])
 
-    this.logger.info('Company details fetched successfully', { event: 'company.fetch.success' })
+    this.logger.info("", { event: 'company.fetch.success' })
     return { company, keyPerson }
   }
killedBy: GetCompanyDetailsUseCase execute() - successful scenarios should retrieve company and key person details successfully
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
-   "Company details fetched successfully",
