[Killed] LogicalOperator
src/application/dtos/post-chat-types.dto.ts:48:9
    *   content or length constraints.
    */
   static validate(data: components['schemas']['CreateAIChatTypeRequest']): PostChatType {
-    if (!isDefined(data) || !isObject(data)) {
+    if (!isDefined(data) && !isObject(data)) {
       throw new TypeException('Invalid data: expected an object')
     }
killedBy: AIConfigController createAIChatType() validation failures should return 500 when body is not an object
statusReason: expected "vi.fn()" to be called with arguments: [ 500 ]

Received:

  1st vi.fn() call:

  [
-   500,

[Killed] ConditionalExpression
src/application/dtos/post-chat-types.dto.ts:48:9
    *   content or length constraints.
    */
   static validate(data: components['schemas']['CreateAIChatTypeRequest']): PostChatType {
-    if (!isDefined(data) || !isObject(data)) {
+    if (false) {
       throw new TypeException('Invalid data: expected an object')
     }
killedBy: AIConfigController createAIChatType() validation failures should return 500 when body is not an object
statusReason: expected "vi.fn()" to be called with arguments: [ 500 ]

Received:

  1st vi.fn() call:

  [
-   500,

[Killed] StringLiteral
src/application/dtos/post-chat-types.dto.ts:49:31
    */
   static validate(data: components['schemas']['CreateAIChatTypeRequest']): PostChatType {
     if (!isDefined(data) || !isObject(data)) {
-      throw new TypeException('Invalid data: expected an object')
+      throw new TypeException("")
     }
     if (!isString(data.name) || !data.name.trim()) {
killedBy: AIConfigController createAIChatType() validation failures should return 500 when body is not an object
statusReason: expected "vi.fn()" to be called with arguments: [ { success: false, …(1) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] ConditionalExpression
src/application/dtos/post-chat-types.dto.ts:51:9
     if (!isDefined(data) || !isObject(data)) {
       throw new TypeException('Invalid data: expected an object')
     }
-    if (!isString(data.name) || !data.name.trim()) {
+    if (false) {
       throw new ValidationException('Invalid name: must be a non-empty string')
     }
killedBy: AIConfigController createAIChatType() validation failures should return 400 when name is missing
statusReason: expected "vi.fn()" to be called with arguments: [ { success: false, …(1) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] BooleanLiteral
src/application/dtos/post-chat-types.dto.ts:51:33
     if (!isDefined(data) || !isObject(data)) {
       throw new TypeException('Invalid data: expected an object')
     }
-    if (!isString(data.name) || !data.name.trim()) {
+    if (!isString(data.name) || data.name.trim()) {
       throw new ValidationException('Invalid name: must be a non-empty string')
     }
killedBy: AIConfigController createAIChatType() successful scenarios should create a chat type successfully and respond with 201
statusReason: expected "vi.fn()" to be called with arguments: [ 201 ]

Received:

  1st vi.fn() call:

  [
-   201,

[Killed] StringLiteral
src/application/dtos/post-chat-types.dto.ts:52:37
       throw new TypeException('Invalid data: expected an object')
     }
     if (!isString(data.name) || !data.name.trim()) {
-      throw new ValidationException('Invalid name: must be a non-empty string')
+      throw new ValidationException("")
     }
     if (!isString(data.description) || !data.description.trim()) {
killedBy: AIConfigController createAIChatType() validation failures should return 400 when name is missing
statusReason: expected "vi.fn()" to be called with arguments: [ { success: false, …(1) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] BlockStatement
src/application/dtos/post-chat-types.dto.ts:54:66
     if (!isString(data.name) || !data.name.trim()) {
       throw new ValidationException('Invalid name: must be a non-empty string')
     }
-    if (!isString(data.description) || !data.description.trim()) {
-      throw new ValidationException('Invalid description: must be a non-empty string')
-    }
+    if (!isString(data.description) || !data.description.trim()) {}
     if (!isBoolean(data.rag) || isNullOrUndefined(data.rag)) {
       throw new ValidationException('Invalid rag: must be a boolean')
killedBy: AIConfigController createAIChatType() validation failures should return 400 when description is missing
statusReason: expected "vi.fn()" to be called with arguments: [ { success: false, …(1) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] ConditionalExpression
src/application/dtos/post-chat-types.dto.ts:54:9
     if (!isString(data.name) || !data.name.trim()) {
       throw new ValidationException('Invalid name: must be a non-empty string')
     }
-    if (!isString(data.description) || !data.description.trim()) {
+    if (false) {
       throw new ValidationException('Invalid description: must be a non-empty string')
     }
killedBy: AIConfigController createAIChatType() validation failures should return 400 when description is missing
statusReason: expected "vi.fn()" to be called with arguments: [ { success: false, …(1) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] StringLiteral
src/application/dtos/post-chat-types.dto.ts:55:37
       throw new ValidationException('Invalid name: must be a non-empty string')
     }
     if (!isString(data.description) || !data.description.trim()) {
-      throw new ValidationException('Invalid description: must be a non-empty string')
+      throw new ValidationException("")
     }
     if (!isBoolean(data.rag) || isNullOrUndefined(data.rag)) {
killedBy: PostChatType validate() - description validation should throw ValidationException when description is missing
statusReason: expected [Function] to throw error including 'Invalid description: must be a non-em…' but got ''

[Killed] BooleanLiteral
src/application/dtos/post-chat-types.dto.ts:57:9
     if (!isString(data.description) || !data.description.trim()) {
       throw new ValidationException('Invalid description: must be a non-empty string')
     }
-    if (!isBoolean(data.rag) || isNullOrUndefined(data.rag)) {
+    if (isBoolean(data.rag) || isNullOrUndefined(data.rag)) {
       throw new ValidationException('Invalid rag: must be a boolean')
     }
killedBy: AIConfigController createAIChatType() successful scenarios should create a chat type successfully and respond with 201
statusReason: expected "vi.fn()" to be called with arguments: [ 201 ]

Received:

  1st vi.fn() call:

  [
-   201,

[Killed] LogicalOperator
src/application/dtos/post-chat-types.dto.ts:57:9
     if (!isString(data.description) || !data.description.trim()) {
       throw new ValidationException('Invalid description: must be a non-empty string')
     }
-    if (!isBoolean(data.rag) || isNullOrUndefined(data.rag)) {
+    if (!isBoolean(data.rag) && isNullOrUndefined(data.rag)) {
       throw new ValidationException('Invalid rag: must be a boolean')
     }
killedBy: PostChatType validate() - rag validation should throw ValidationException when rag is a string
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
src/application/dtos/post-chat-types.dto.ts:60:9
     if (!isBoolean(data.rag) || isNullOrUndefined(data.rag)) {
       throw new ValidationException('Invalid rag: must be a boolean')
     }
-    if (data.name.trim().length > 200) {
+    if (false) {
       throw new ValidationException('Invalid name: must be less than 200 characters')
     }
killedBy: PostChatType validate() - name validation should throw ValidationException when name exceeds 200 characters
statusReason: expected function to throw an error, but it didn't

[Killed] EqualityOperator
src/application/dtos/post-chat-types.dto.ts:60:9
     if (!isBoolean(data.rag) || isNullOrUndefined(data.rag)) {
       throw new ValidationException('Invalid rag: must be a boolean')
     }
-    if (data.name.trim().length > 200) {
+    if (data.name.trim().length <= 200) {
       throw new ValidationException('Invalid name: must be less than 200 characters')
     }
killedBy: PostChatType validate() - name validation should throw ValidationException when name exceeds 200 characters
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
src/application/dtos/post-chat-types.dto.ts:63:47
     if (data.name.trim().length > 200) {
       throw new ValidationException('Invalid name: must be less than 200 characters')
     }
-    if (data.description.trim().length > 500) {
-      throw new ValidationException('Invalid description: must be less than 500 characters')
-    }
+    if (data.description.trim().length > 500) {}
     return new PostChatType(data.name.trim(), data.description.trim(), data.rag)
   }
killedBy: AIConfigController createAIChatType() validation failures should return 400 when description exceeds 500 characters
statusReason: expected "vi.fn()" to be called with arguments: [ 400 ]

Received:

  1st vi.fn() call:

  [
-   400,

[Killed] ConditionalExpression
src/application/dtos/post-chat-types.dto.ts:63:9
     if (data.name.trim().length > 200) {
       throw new ValidationException('Invalid name: must be less than 200 characters')
     }
-    if (data.description.trim().length > 500) {
+    if (false) {
       throw new ValidationException('Invalid description: must be less than 500 characters')
     }
killedBy: AIConfigController createAIChatType() validation failures should return 400 when description exceeds 500 characters
statusReason: expected "vi.fn()" to be called with arguments: [ 400 ]

Received:

  1st vi.fn() call:

  [
-   400,

[Killed] MethodExpression
src/application/dtos/post-chat-types.dto.ts:66:29
     if (data.description.trim().length > 500) {
       throw new ValidationException('Invalid description: must be less than 500 characters')
     }
-    return new PostChatType(data.name.trim(), data.description.trim(), data.rag)
+    return new PostChatType(data.name, data.description.trim(), data.rag)
   }
 }
killedBy: AIConfigController createAIChatType() successful scenarios should pass trimmed name and description to the use case
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Object>, ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   Any<Object>,

[Killed] MethodExpression
src/application/dtos/post-chat-types.dto.ts:66:47
     if (data.description.trim().length > 500) {
       throw new ValidationException('Invalid description: must be less than 500 characters')
     }
-    return new PostChatType(data.name.trim(), data.description.trim(), data.rag)
+    return new PostChatType(data.name.trim(), data.description, data.rag)
   }
 }
killedBy: PostChatType validate() - description validation should trim leading and trailing whitespace from description
statusReason: expected '  A helpful assistant  ' to be 'A helpful assistant' // Object.is equality
