[Killed] StringLiteral
src/application/use-cases/get-chat-details.use-case.ts:70:14
   public async execute(_auditContext: AuditContext): Promise<DBChatType[]> {
     const result = await this.aiChatContent.fetchChatContent()
     this.logger.info('Fetched chat types from AIContentPort', {
-      event: 'chat_types.fetch.success',
+      event: "",
       count: result.length,
     })
killedBy: GetChatDetailsUseCase execute() - successful scenarios should fetch and return chat types with existing SEO fields
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
    "Fetched chat types from AIContentPort",

[Killed] BooleanLiteral
src/application/use-cases/get-chat-details.use-case.ts:77:11
       let seoFriendlyId = chatType.seoFriendlyId
       let seoFriendlyBase64Id = chatType.seoFriendlyBase64Id
 
-      if (!seoFriendlyId) {
+      if (seoFriendlyId) {
         seoFriendlyId = SEO.generateSeoFriendlyTitle(chatType.name)
       }
killedBy: GetChatDetailsUseCase execute() - successful scenarios should generate seoFriendlyId when missing
statusReason: expected null to be 'test-chat-type' // Object.is equality

[Killed] ConditionalExpression
src/application/use-cases/get-chat-details.use-case.ts:77:11
       let seoFriendlyId = chatType.seoFriendlyId
       let seoFriendlyBase64Id = chatType.seoFriendlyBase64Id
 
-      if (!seoFriendlyId) {
+      if (true) {
         seoFriendlyId = SEO.generateSeoFriendlyTitle(chatType.name)
       }
killedBy: GetChatDetailsUseCase execute() - successful scenarios should preserve existing seoFriendlyId when it differs from what the SEO utility would generate
statusReason: expected 'custom-name-type' to be 'my-custom-slug' // Object.is equality

[Killed] BooleanLiteral
src/application/use-cases/get-chat-details.use-case.ts:80:11
       if (!seoFriendlyId) {
         seoFriendlyId = SEO.generateSeoFriendlyTitle(chatType.name)
       }
-      if (!seoFriendlyBase64Id && chatType.id) {
+      if (seoFriendlyBase64Id && chatType.id) {
         const base64Id = Uuid7Util.toBase64(chatType.id)
         if (!base64Id) {
killedBy: GetChatDetailsUseCase execute() - successful scenarios should fetch and return chat types with existing SEO fields
statusReason: expected 'AZ5hDTdSc3WmBImOUVvYUQ' to be 'AbCdEfGhIjKlMnOpQrStUv' // Object.is equality

[Killed] BlockStatement
src/application/use-cases/get-chat-details.use-case.ts:80:48
       if (!seoFriendlyId) {
         seoFriendlyId = SEO.generateSeoFriendlyTitle(chatType.name)
       }
-      if (!seoFriendlyBase64Id && chatType.id) {
-        const base64Id = Uuid7Util.toBase64(chatType.id)
-        if (!base64Id) {
-          const error = new Error('Failed to generate seoFriendlyBase64Id from chat type ID')
-          this.logger.error('Failed to generate seoFriendlyBase64Id', error, {
-            event: 'chat_types.base64_generation.failed',
-            chatTypeId: chatType.id,
-          })
-          throw error
-        }
-        seoFriendlyBase64Id = base64Id
-      }
+      if (!seoFriendlyBase64Id && chatType.id) {}
 
       return {
killedBy: GetChatDetailsUseCase execute() - successful scenarios should generate seoFriendlyBase64Id when missing
statusReason: expected null to be truthy

[Killed] StringLiteral
src/application/use-cases/get-chat-details.use-case.ts:85:20
         if (!base64Id) {
           const error = new Error('Failed to generate seoFriendlyBase64Id from chat type ID')
           this.logger.error('Failed to generate seoFriendlyBase64Id', error, {
-            event: 'chat_types.base64_generation.failed',
+            event: "",
             chatTypeId: chatType.id,
           })
killedBy: GetChatDetailsUseCase execute() - base64 generation failure should call logger.error with exact message when toBase64 returns falsy
statusReason: expected "vi.fn()" to be called with arguments: [ …(3) ]

Received:

  1st vi.fn() call:

  [
    "Failed to generate seoFriendlyBase64Id",
