[Killed] StringLiteral
src/application/use-cases/post-chat-types.use-case.ts:62:22
    * @throws {ConflictException} If a unique constraint is violated (duplicate name or identifiers).
    */
   async execute(auditContext: AuditContext, data: PostChatTypesData): Promise<DBChatType> {
-    this.logger.info('Executing PostChatTypesUseCase', { event: 'chat_type.create.attempt', data })
+    this.logger.info("", { event: 'chat_type.create.attempt', data })
 
     const { description, name, rag } = data
killedBy: PostChatTypesUseCase execute() - successful scenarios should log the initial info message
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

@@ -1,7 +1,7 @@
  [

[Killed] EqualityOperator
src/application/use-cases/post-chat-types.use-case.ts:70:49
     const newId = Uuid7Util.createUuidv7()
     const seoFriendlyId = SEO.generateSeoFriendlyTitle(name)
     const seoFriendlyBase64IdResult = Uuid7Util.toBase64(newId)
-    if (!isString(seoFriendlyBase64IdResult) || seoFriendlyBase64IdResult.length !== 22) {
+    if (!isString(seoFriendlyBase64IdResult) || seoFriendlyBase64IdResult.length === 22) {
       throw new Error('Failed to generate a valid base64 ID for the new chat type')
     }
killedBy: PostChatTypesUseCase execute() - successful scenarios should call createChatType with correctly shaped data
statusReason: Failed to generate a valid base64 ID for the new chat type

[Survived] ConditionalExpression
src/application/use-cases/post-chat-types.use-case.ts:70:49
     const newId = Uuid7Util.createUuidv7()
     const seoFriendlyId = SEO.generateSeoFriendlyTitle(name)
     const seoFriendlyBase64IdResult = Uuid7Util.toBase64(newId)
-    if (!isString(seoFriendlyBase64IdResult) || seoFriendlyBase64IdResult.length !== 22) {
+    if (!isString(seoFriendlyBase64IdResult) || false) {
       throw new Error('Failed to generate a valid base64 ID for the new chat type')
     }

[Killed] StringLiteral
src/application/use-cases/post-chat-types.use-case.ts:71:23
     const seoFriendlyId = SEO.generateSeoFriendlyTitle(name)
     const seoFriendlyBase64IdResult = Uuid7Util.toBase64(newId)
     if (!isString(seoFriendlyBase64IdResult) || seoFriendlyBase64IdResult.length !== 22) {
-      throw new Error('Failed to generate a valid base64 ID for the new chat type')
+      throw new Error("")
     }
     const seoFriendlyBase64Id: string = seoFriendlyBase64IdResult
killedBy: PostChatTypesUseCase execute() - error scenarios should throw when Uuid7Util.toBase64 returns undefined (non-v7 UUID mocked)
statusReason: expected [Function] to throw error including 'Failed to generate a valid base64 ID …' but got ''

[Killed] ObjectLiteral
src/application/use-cases/post-chat-types.use-case.ts:91:16
       entityType: EntityType.CHAT_TYPE,
       entityId: newId,
       action: AuditAction.CREATE,
-      changes: {
-        reason: 'creation_successful',
-      },
+      changes: {},
       ipAddress: auditContext.ipAddress,
       userAgent: auditContext.userAgent ?? undefined,
killedBy: PostChatTypesUseCase execute() - successful scenarios should set audit changes reason to "creation_successful" when createChatType returns a truthy result
statusReason: expected {} to deeply equal { reason: 'creation_successful' }

[Killed] StringLiteral
src/application/use-cases/post-chat-types.use-case.ts:92:17
       entityId: newId,
       action: AuditAction.CREATE,
       changes: {
-        reason: 'creation_successful',
+        reason: "",
       },
       ipAddress: auditContext.ipAddress,
killedBy: PostChatTypesUseCase execute() - successful scenarios should set audit changes reason to "creation_successful" when createChatType returns a truthy result
statusReason: expected { reason: '' } to deeply equal { reason: 'creation_successful' }
