[Killed] StringLiteral
src/shared/utils/SEO.util.ts:4:5
 export class SEO {
   private static readonly unnecessaryWords = new Set([
     // Articles
-    'a',
+    "",
     'an',
     'the',
killedBy: SEO removeUnnecessaryWords should remove articles (a, an, the)
statusReason: expected 'a guide best practices' to be 'guide best practices' // Object.is equality

[Killed] StringLiteral
src/shared/utils/SEO.util.ts:5:5
   private static readonly unnecessaryWords = new Set([
     // Articles
     'a',
-    'an',
+    "",
     'the',
 
killedBy: SEO removeUnnecessaryWords should remove the article "an"
statusReason: expected 'pick an option' to be 'pick option' // Object.is equality

[Killed] StringLiteral
src/shared/utils/SEO.util.ts:6:5
     // Articles
     'a',
     'an',
-    'the',
+    "",
 
     // Conjunctions
killedBy: PostChatTypesUseCase execute() - SEO id generation should filter stop-words from the name when building seoFriendlyId
statusReason: expected 'the-general-assistant' not to match /^the-/i

[Killed] StringLiteral
src/shared/utils/SEO.util.ts:9:5
     'the',
 
     // Conjunctions
-    'and',
+    "",
     'or',
     'but',
killedBy: SEO removeUnnecessaryWords should remove conjunctions (and, or, but)
statusReason: expected 'dogs and cats birds not fish' to be 'dogs cats birds not fish' // Object.is equality

[Killed] StringLiteral
src/shared/utils/SEO.util.ts:11:5
     // Conjunctions
     'and',
     'or',
-    'but',
+    "",
     'nor',
     'yet',
killedBy: SEO removeUnnecessaryWords should remove conjunctions (and, or, but)
statusReason: expected 'dogs cats birds but not fish' to be 'dogs cats birds not fish' // Object.is equality

[Killed] StringLiteral
src/shared/utils/SEO.util.ts:18:5
 
     // Prepositions
     'of',
-    'in',
+    "",
     'on',
     'at',
killedBy: SEO removeUnnecessaryWords should remove prepositions (of, in, on, at, to, from)
statusReason: expected 'tips success in business web' to be 'tips success business web' // Object.is equality

[Killed] StringLiteral
src/shared/utils/SEO.util.ts:26:5
     'by',
     'for',
     'with',
-    'about',
+    "",
     'against',
     'between',
killedBy: SEO removeUnnecessaryWords should remove prepositions "about", "against", and "between"
statusReason: expected 'talk about conflict divide teams' to be 'talk conflict divide teams' // Object.is equality

[Killed] StringLiteral
src/shared/utils/SEO.util.ts:29:5
     'about',
     'against',
     'between',
-    'into',
+    "",
     'through',
     'during',
killedBy: SEO removeUnnecessaryWords should remove prepositions "into", "through", and "during"
statusReason: expected 'jump into pool crowds summer' to be 'jump pool crowds summer' // Object.is equality

[Killed] StringLiteral
src/shared/utils/SEO.util.ts:30:5
     'against',
     'between',
     'into',
-    'through',
+    "",
     'during',
     'before',
killedBy: SEO removeUnnecessaryWords should remove prepositions "into", "through", and "during"
statusReason: expected 'jump pool through crowds summer' to be 'jump pool crowds summer' // Object.is equality

[Killed] StringLiteral
src/shared/utils/SEO.util.ts:33:5
     'through',
     'during',
     'before',
-    'after',
+    "",
     'above',
     'below',
killedBy: SEO removeUnnecessaryWords should remove prepositions "before", "after", "above", and "below"
statusReason: expected 'check submit limit threshold after re…' to be 'check submit limit threshold review' // Object.is equality

[Killed] StringLiteral
src/shared/utils/SEO.util.ts:38:5
     'below',
     'over',
     'under',
-    'within',
+    "",
     'without',
 
killedBy: SEO removeUnnecessaryWords should remove prepositions "over", "under", "within", and "without"
statusReason: expected 'working time pressure within budget b…' to be 'working time pressure budget breaks' // Object.is equality

[Killed] StringLiteral
src/shared/utils/SEO.util.ts:43:5
 
     // Pronouns
     'i',
-    'me',
+    "",
     'my',
     'mine',
killedBy: SEO removeUnnecessaryWords should remove pronouns "me", "my", and "mine"
statusReason: expected 'tell me ideas' to be 'tell ideas' // Object.is equality

[Killed] StringLiteral
src/shared/utils/SEO.util.ts:52:5
     'ours',
     'you',
     'your',
-    'yours',
+    "",
     'he',
     'him',
killedBy: SEO removeUnnecessaryWords should remove pronouns "you", "us", "our", "ours", and "yours"
statusReason: expected 'sharing story yours' to be 'sharing story' // Object.is equality

[Killed] StringLiteral
src/shared/utils/SEO.util.ts:54:5
     'your',
     'yours',
     'he',
-    'him',
+    "",
     'his',
     'she',
killedBy: SEO removeUnnecessaryWords should remove pronouns "he", "him", "his", "she", "her", and "hers"
statusReason: expected 'told him secret gave' to be 'told secret gave' // Object.is equality

[Killed] StringLiteral
src/shared/utils/SEO.util.ts:56:5
     'he',
     'him',
     'his',
-    'she',
+    "",
     'her',
     'hers',
killedBy: SEO removeUnnecessaryWords should remove pronouns "he", "him", "his", "she", "her", and "hers"
statusReason: expected 'told secret she gave' to be 'told secret gave' // Object.is equality

[Killed] StringLiteral
src/shared/utils/SEO.util.ts:57:5
     'him',
     'his',
     'she',
-    'her',
+    "",
     'hers',
     'it',
killedBy: SEO removeUnnecessaryWords should remove pronouns "he", "him", "his", "she", "her", and "hers"
statusReason: expected 'told secret gave her' to be 'told secret gave' // Object.is equality

[Killed] StringLiteral
src/shared/utils/SEO.util.ts:59:5
     'she',
     'her',
     'hers',
-    'it',
+    "",
     'its',
     'they',
killedBy: SEO removeUnnecessaryWords should remove pronouns "it", "its", "they", and "theirs"
statusReason: expected 'it lost value claimed' to be 'lost value claimed' // Object.is equality

[Killed] StringLiteral
src/shared/utils/SEO.util.ts:60:5
     'her',
     'hers',
     'it',
-    'its',
+    "",
     'they',
     'them',
killedBy: SEO removeUnnecessaryWords should remove pronouns "it", "its", "they", and "theirs"
statusReason: expected 'lost its value claimed' to be 'lost value claimed' // Object.is equality

[Killed] StringLiteral
src/shared/utils/SEO.util.ts:62:5
     'it',
     'its',
     'they',
-    'them',
+    "",
     'their',
     'theirs',
killedBy: SEO removeUnnecessaryWords should remove pronouns (I, me, we, you, they)
statusReason: expected 'think should help them project' to be 'think should help project' // Object.is equality

[Killed] StringLiteral
src/shared/utils/SEO.util.ts:63:5
     'its',
     'they',
     'them',
-    'their',
+    "",
     'theirs',
 
killedBy: SEO removeUnnecessaryWords should remove pronouns (I, me, we, you, they)
statusReason: expected 'think should help their project' to be 'think should help project' // Object.is equality

[Killed] StringLiteral
src/shared/utils/SEO.util.ts:64:5
     'they',
     'them',
     'their',
-    'theirs',
+    "",
 
     // Auxiliary / linking verbs
killedBy: SEO removeUnnecessaryWords should remove pronouns "it", "its", "they", and "theirs"
statusReason: expected 'lost value claimed theirs' to be 'lost value claimed' // Object.is equality

[Killed] StringLiteral
src/shared/utils/SEO.util.ts:74:5
     'were',
     'be',
     'been',
-    'being',
+    "",
     'have',
     'has',
killedBy: SEO removeUnnecessaryWords should remove auxiliary verbs "be" and "being"
statusReason: expected 'try brave being afraid' to be 'try brave afraid' // Object.is equality

[Killed] StringLiteral
src/shared/utils/SEO.util.ts:86:5
     'very',
     'really',
     'quite',
-    'just',
+    "",
     'only',
     'even',
killedBy: SEO removeUnnecessaryWords should remove low-value modifiers (very, really, quite, just)
statusReason: expected 'good great just perfect' to be 'good great perfect' // Object.is equality

[Killed] StringLiteral
src/shared/utils/SEO.util.ts:87:5
     'really',
     'quite',
     'just',
-    'only',
+    "",
     'even',
     'almost',
killedBy: SEO removeUnnecessaryWords should remove low-value modifiers "quite", "only", "even", "almost", "mostly", and "maybe"
statusReason: expected 'interesting only child counts always …' to be 'interesting child counts always right…' // Object.is equality

[Killed] StringLiteral
src/shared/utils/SEO.util.ts:100:5
     'those',
     'there',
     'here',
-    'when',
+    "",
     'where',
     'why',
killedBy: SEO removeUnnecessaryWords should remove common fillers "when", "where", and "why"
statusReason: expected 'when learning matters most' to be 'learning matters most' // Object.is equality

[Killed] StringLiteral
src/shared/utils/SEO.util.ts:102:5
     'here',
     'when',
     'where',
-    'why',
+    "",
     'how',
   ])
killedBy: SEO removeUnnecessaryWords should remove common fillers "when", "where", and "why"
statusReason: expected 'why learning matters most' to be 'learning matters most' // Object.is equality

[Killed] MethodExpression
src/shared/utils/SEO.util.ts:107:12
   ])
 
   static removeUnnecessaryWords(title: string): string {
-    return title
-      .toLowerCase()
-      .split(/\s+/)
-      .filter((word) => !SEO.unnecessaryWords.has(word))
+    return title.toLowerCase().split(/\s+/)
       .join(' ')
       .trim()
killedBy: SEO removeUnnecessaryWords should remove articles (a, an, the)
statusReason: expected 'a guide to the best practices' to be 'guide best practices' // Object.is equality

[Killed] MethodExpression
src/shared/utils/SEO.util.ts:107:12
   ])
 
   static removeUnnecessaryWords(title: string): string {
-    return title
-      .toLowerCase()
-      .split(/\s+/)
-      .filter((word) => !SEO.unnecessaryWords.has(word))
-      .join(' ')
-      .trim()
+    return title.toLowerCase().split(/\s+/).filter(word => !SEO.unnecessaryWords.has(word)).join(' ')
   }
 
killedBy: SEO removeUnnecessaryWords should handle leading and trailing spaces
statusReason: expected ' best practices guide ' to be 'best practices guide' // Object.is equality

[Killed] Regex
src/shared/utils/SEO.util.ts:109:14
   static removeUnnecessaryWords(title: string): string {
     return title
       .toLowerCase()
-      .split(/\s+/)
+      .split(/\S+/)
       .filter((word) => !SEO.unnecessaryWords.has(word))
       .join(' ')
killedBy: SEO removeUnnecessaryWords should remove articles (a, an, the)
statusReason: expected '' to be 'guide best practices' // Object.is equality

[Killed] Regex
src/shared/utils/SEO.util.ts:109:14
   static removeUnnecessaryWords(title: string): string {
     return title
       .toLowerCase()
-      .split(/\s+/)
+      .split(/\s/)
       .filter((word) => !SEO.unnecessaryWords.has(word))
       .join(' ')
killedBy: SEO removeUnnecessaryWords should handle multiple spaces between words
statusReason: expected 'quick   brown    fox' to be 'quick brown fox' // Object.is equality

[Killed] ArrowFunction
src/shared/utils/SEO.util.ts:110:15
     return title
       .toLowerCase()
       .split(/\s+/)
-      .filter((word) => !SEO.unnecessaryWords.has(word))
+      .filter(() => undefined)
       .join(' ')
       .trim()
killedBy: SEO removeUnnecessaryWords should remove articles (a, an, the)
statusReason: expected '' to be 'guide best practices' // Object.is equality

[Killed] BooleanLiteral
src/shared/utils/SEO.util.ts:110:25
     return title
       .toLowerCase()
       .split(/\s+/)
-      .filter((word) => !SEO.unnecessaryWords.has(word))
+      .filter((word) => SEO.unnecessaryWords.has(word))
       .join(' ')
       .trim()
killedBy: SEO removeUnnecessaryWords should remove articles (a, an, the)
statusReason: expected 'a to the' to be 'guide best practices' // Object.is equality

[Survived] MethodExpression
src/shared/utils/SEO.util.ts:117:12
 
   static generateSeoFriendlyTitle(title: string): string {
     const cleanedTitle = SEO.removeUnnecessaryWords(title)
-    return cleanedTitle
-      .split(/\s+/)
-      .filter((word) => word.length > 0)
+    return cleanedTitle.split(/\s+/)
       .join('-')
   }

[Killed] EqualityOperator
src/shared/utils/SEO.util.ts:119:25
     const cleanedTitle = SEO.removeUnnecessaryWords(title)
     return cleanedTitle
       .split(/\s+/)
-      .filter((word) => word.length > 0)
+      .filter((word) => word.length <= 0)
       .join('-')
   }
killedBy: PostChatTypesUseCase execute() - SEO id generation should produce a kebab-case seoFriendlyId for multi-word names
statusReason: expected '' to match /^[a-z0-9]+(?:-[a-z0-9]+)*$/

[Killed] ConditionalExpression
src/shared/utils/SEO.util.ts:119:25
     const cleanedTitle = SEO.removeUnnecessaryWords(title)
     return cleanedTitle
       .split(/\s+/)
-      .filter((word) => word.length > 0)
+      .filter((word) => false)
       .join('-')
   }
killedBy: SEO generateSeoFriendlyTitle should generate slug with hyphens between words
statusReason: expected '' to be 'best-guide-seo' // Object.is equality

[Killed] StringLiteral
src/shared/utils/SEO.util.ts:120:13
     return cleanedTitle
       .split(/\s+/)
       .filter((word) => word.length > 0)
-      .join('-')
+      .join("")
   }
 }
killedBy: SEO generateSeoFriendlyTitle should generate slug with hyphens between words
statusReason: expected 'bestguideseo' to be 'best-guide-seo' // Object.is equality
