[Killed] BlockStatement
src/application/dtos/post-refresh.dto.ts:81:46
    * ```
    */
   static validate(data: components['schemas']['RefreshTokenRequest']): PostRefreshDTO {
-    if (!isDefined(data) || !isObject(data)) {
-      throw new TypeException('Expected an object')
-    }
+    if (!isDefined(data) || !isObject(data)) {}
 
     if (!isDefined((data as any).refreshToken) || typeof (data as any).refreshToken !== 'string') {
killedBy: PostRefreshDTO validate() TypeException - invalid data shape should throw TypeException when data is null
statusReason: expected error to be instance of TypeException

[Killed] ConditionalExpression
src/application/dtos/post-refresh.dto.ts:81:9
    * ```
    */
   static validate(data: components['schemas']['RefreshTokenRequest']): PostRefreshDTO {
-    if (!isDefined(data) || !isObject(data)) {
+    if (true) {
       throw new TypeException('Expected an object')
     }
killedBy: AuthController refresh() successful refresh should return 200 with new tokens for a valid refresh token
statusReason: expected "vi.fn()" to be called with arguments: [ 200 ]

Received:

  1st vi.fn() call:

  [
-   200,

[Killed] StringLiteral
src/application/dtos/post-refresh.dto.ts:82:31
    */
   static validate(data: components['schemas']['RefreshTokenRequest']): PostRefreshDTO {
     if (!isDefined(data) || !isObject(data)) {
-      throw new TypeException('Expected an object')
+      throw new TypeException("")
     }
 
killedBy: PostRefreshDTO validate() TypeException - invalid data shape should throw TypeException when data is null
statusReason: expected [Function] to throw error including 'Expected an object' but got ''

[Killed] BooleanLiteral
src/application/dtos/post-refresh.dto.ts:85:9
       throw new TypeException('Expected an object')
     }
 
-    if (!isDefined((data as any).refreshToken) || typeof (data as any).refreshToken !== 'string') {
+    if (isDefined((data as any).refreshToken) || typeof (data as any).refreshToken !== 'string') {
       throw new TypeException('Expected refreshToken to be a string')
     }
killedBy: AuthController refresh() successful refresh should return 200 with new tokens for a valid refresh token
statusReason: expected "vi.fn()" to be called with arguments: [ 200 ]

Received:

  1st vi.fn() call:

  [
-   200,

[Killed] EqualityOperator
src/application/dtos/post-refresh.dto.ts:85:51
       throw new TypeException('Expected an object')
     }
 
-    if (!isDefined((data as any).refreshToken) || typeof (data as any).refreshToken !== 'string') {
+    if (!isDefined((data as any).refreshToken) || typeof (data as any).refreshToken === 'string') {
       throw new TypeException('Expected refreshToken to be a string')
     }
killedBy: AuthController refresh() successful refresh should return 200 with new tokens for a valid refresh token
statusReason: expected "vi.fn()" to be called with arguments: [ 200 ]

Received:

  1st vi.fn() call:

  [
-   200,

[Survived] StringLiteral
src/application/dtos/post-refresh.dto.ts:86:31
     }
 
     if (!isDefined((data as any).refreshToken) || typeof (data as any).refreshToken !== 'string') {
-      throw new TypeException('Expected refreshToken to be a string')
+      throw new TypeException("")
     }
 

[Killed] MethodExpression
src/application/dtos/post-refresh.dto.ts:89:33
       throw new TypeException('Expected refreshToken to be a string')
     }
 
-    const trimmedRefreshToken = (data as any).refreshToken.trim()
+    const trimmedRefreshToken = (data as any).refreshToken
 
     if (!is64CharHexString(trimmedRefreshToken)) {
killedBy: PostRefreshDTO validate() successful validation should trim whitespace from the refreshToken before validation
statusReason: Invalid refreshToken: must be a 64-character hexadecimal string

[Killed] ConditionalExpression
src/application/dtos/post-refresh.dto.ts:91:9
 
     const trimmedRefreshToken = (data as any).refreshToken.trim()
 
-    if (!is64CharHexString(trimmedRefreshToken)) {
+    if (false) {
       throw new ValidationException(
         'Invalid refreshToken: must be a 64-character hexadecimal string'
killedBy: AuthController refresh() validation errors should return 400 when refreshToken is not a valid 64-char hex string
statusReason: expected "vi.fn()" to be called with arguments: [ 400 ]

Received:

  1st vi.fn() call:

  [
-   400,

[Killed] BooleanLiteral
src/application/dtos/post-refresh.dto.ts:91:9
 
     const trimmedRefreshToken = (data as any).refreshToken.trim()
 
-    if (!is64CharHexString(trimmedRefreshToken)) {
+    if (is64CharHexString(trimmedRefreshToken)) {
       throw new ValidationException(
         'Invalid refreshToken: must be a 64-character hexadecimal string'
killedBy: PostRefreshDTO validate() successful validation should validate and create PostRefreshDTO with a valid 64-char hex string
statusReason: Invalid refreshToken: must be a 64-character hexadecimal string
