[Killed] ObjectLiteral
src/application/use-cases/register-user-with-provider.use-case.ts:121:52
     expiresInSeconds: number
     roles: string[]
   }> {
-    this.logger.info('Starting user registration', { event: 'user.oauth_registration.attempt' })
+    this.logger.info('Starting user registration', {})
 
     // Create domain objects
killedBy: RegisterUserWithProviderUseCase execute() successful registration with OAuth provider should log registration start with email
statusReason: expected "vi.fn()" to be called with arguments: [ 'Starting user registration', …(1) ]

Received:

  1st vi.fn() call:

  [
    "Starting user registration",

[Killed] StringLiteral
src/application/use-cases/register-user-with-provider.use-case.ts:121:61
     expiresInSeconds: number
     roles: string[]
   }> {
-    this.logger.info('Starting user registration', { event: 'user.oauth_registration.attempt' })
+    this.logger.info('Starting user registration', { event: "" })
 
     // Create domain objects
killedBy: RegisterUserWithProviderUseCase execute() successful registration with OAuth provider should log registration start with email
statusReason: expected "vi.fn()" to be called with arguments: [ 'Starting user registration', …(1) ]

Received:

  1st vi.fn() call:

  [
    "Starting user registration",

[Killed] StringLiteral
src/application/use-cases/register-user-with-provider.use-case.ts:153:25
       userId = result.userId
       isNewUser = result.isNewUser
     } catch (error) {
-      this.logger.error('Failed to save user', error as Error, {
+      this.logger.error("", error as Error, {
         event: 'user.oauth_registration.failed',
         reason: 'save_failed',
killedBy: RegisterUserWithProviderUseCase execute() duplicate email handling should log error when duplicate email is detected
statusReason: expected "vi.fn()" to be called with arguments: [ 'Failed to save user', …(2) ]

Received:

  1st vi.fn() call:

@@ -1,7 +1,7 @@
  [

[Killed] ConditionalExpression
src/application/use-cases/register-user-with-provider.use-case.ts:157:11
         event: 'user.oauth_registration.failed',
         reason: 'save_failed',
       })
-      if (DatabaseUtil.isDuplicateKeyError(error)) {
+      if (true) {
         // For failed registration: entityId = email (no user entity created yet)
         const auditEntry: CreateAuditLogDTO = {
killedBy: RegisterUserWithProviderUseCase execute() database error handling should throw original error when save fails with non-duplicate error
statusReason: expected [Function] to throw error including 'Connection timeout' but got 'User with this email already exists'

[Killed] ConditionalExpression
src/application/use-cases/register-user-with-provider.use-case.ts:157:11
         event: 'user.oauth_registration.failed',
         reason: 'save_failed',
       })
-      if (DatabaseUtil.isDuplicateKeyError(error)) {
+      if (false) {
         // For failed registration: entityId = email (no user entity created yet)
         const auditEntry: CreateAuditLogDTO = {
killedBy: RegisterUserWithProviderUseCase execute() duplicate email handling should throw ConflictException when database rejects duplicate email
statusReason: expected error to be instance of ConflictException

[Killed] ConditionalExpression
src/application/use-cases/register-user-with-provider.use-case.ts:176:9
     }
 
     // Only log audit for new user registrations, not returning users
-    if (isNewUser) {
+    if (false) {
       const auditEntry: CreateAuditLogDTO = {
         userId: userId,
killedBy: RegisterUserWithProviderUseCase execute() successful registration with OAuth provider should log successful registration to audit log
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] ConditionalExpression
src/application/use-cases/register-user-with-provider.use-case.ts:176:9
     }
 
     // Only log audit for new user registrations, not returning users
-    if (isNewUser) {
+    if (true) {
       const auditEntry: CreateAuditLogDTO = {
         userId: userId,
killedBy: RegisterUserWithProviderUseCase returning user (isNewUser = false) should not write user CREATE audit entry for a returning user
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] ConditionalExpression
src/application/use-cases/register-user-with-provider.use-case.ts:191:9
     }
 
     // Send welcome email only for new users
-    if (isNewUser) {
+    if (false) {
       try {
         await this.emailService.sendWelcomeEmail(dto.email, dto.name)
killedBy: RegisterUserWithProviderUseCase execute() successful registration with OAuth provider should send a welcome email to the user
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/application/use-cases/register-user-with-provider.use-case.ts:191:20
     }
 
     // Send welcome email only for new users
-    if (isNewUser) {
-      try {
-        await this.emailService.sendWelcomeEmail(dto.email, dto.name)
-      } catch (error) {
-        this.logger.error('Failed to send welcome email', error as Error, {
-          event: 'user.welcome_email.failed',
-          userId: userId,
-        })
-        // Don't fail registration if email fails
-      }
-    }
+    if (isNewUser) {}
 
     this.logger.info(isNewUser ? 'User registered successfully' : 'Returning user signed in', {
killedBy: RegisterUserWithProviderUseCase execute() successful registration with OAuth provider should send a welcome email to the user
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/application/use-cases/register-user-with-provider.use-case.ts:192:11
 
     // Send welcome email only for new users
     if (isNewUser) {
-      try {
-        await this.emailService.sendWelcomeEmail(dto.email, dto.name)
-      } catch (error) {
+      try {} catch (error) {
         this.logger.error('Failed to send welcome email', error as Error, {
           event: 'user.welcome_email.failed',
killedBy: RegisterUserWithProviderUseCase execute() successful registration with OAuth provider should send a welcome email to the user
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/application/use-cases/register-user-with-provider.use-case.ts:194:23
     if (isNewUser) {
       try {
         await this.emailService.sendWelcomeEmail(dto.email, dto.name)
-      } catch (error) {
-        this.logger.error('Failed to send welcome email', error as Error, {
-          event: 'user.welcome_email.failed',
-          userId: userId,
-        })
-        // Don't fail registration if email fails
-      }
+      } catch (error) {}
     }
 
killedBy: RegisterUserWithProviderUseCase execute() email service failure handling should log error when email fails but not throw
statusReason: expected "vi.fn()" to be called with arguments: [ Array(3) ]

Number of calls: 0

[Killed] StringLiteral
src/application/use-cases/register-user-with-provider.use-case.ts:204:46
     }
 
     this.logger.info(isNewUser ? 'User registered successfully' : 'Returning user signed in', {
-      event: isNewUser ? 'user.registered' : 'user.oauth_login.success',
+      event: isNewUser ? 'user.registered' : "",
       userId: userId,
     })
killedBy: RegisterUserWithProviderUseCase returning user (isNewUser = false) should log "Returning user signed in" with event "user.oauth_login.success"
statusReason: expected "vi.fn()" to be called with arguments: [ Array(2) ]

Received:

  1st vi.fn() call:

  [
-   "Returning user signed in",

[Killed] StringLiteral
src/application/use-cases/register-user-with-provider.use-case.ts:204:26
     }
 
     this.logger.info(isNewUser ? 'User registered successfully' : 'Returning user signed in', {
-      event: isNewUser ? 'user.registered' : 'user.oauth_login.success',
+      event: isNewUser ? "" : 'user.oauth_login.success',
       userId: userId,
     })
killedBy: RegisterUserWithProviderUseCase execute() successful registration with OAuth provider should log successful registration with userId
statusReason: expected "vi.fn()" to be called with arguments: [ Array(2) ]

Received:

  1st vi.fn() call:

  [
-   "User registered successfully",

[Killed] ArrayDeclaration
src/application/use-cases/register-user-with-provider.use-case.ts:212:14
     const accessToken = this.tokenGenerator.generateToken({
       sub: userId,
       email: dto.email,
-      roles: [dto.role],
+      roles: [],
     })
 
killedBy: RegisterUserWithProviderUseCase execute() successful registration with OAuth provider should generate JWT token with correct payload
statusReason: expected "vi.fn()" to be called with arguments: [ { …(3) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] EqualityOperator
src/application/use-cases/register-user-with-provider.use-case.ts:221:44
     // Calculate expiration date
     const parsedExpiration = Number(EnvConfig.REFRESH_TOKEN_EXPIRATION)
     const expiresInSeconds =
-      Number.isFinite(parsedExpiration) && parsedExpiration > 0
+      Number.isFinite(parsedExpiration) && parsedExpiration >= 0
         ? parsedExpiration
         : 7 * 24 * 60 * 60
killedBy: RegisterUserWithProviderUseCase expiration boundary conditions should use fallback value 604800 when REFRESH_TOKEN_EXPIRATION is 0
statusReason: expected +0 to be 604800 // Object.is equality

[Killed] LogicalOperator
src/application/use-cases/register-user-with-provider.use-case.ts:221:7
     // Calculate expiration date
     const parsedExpiration = Number(EnvConfig.REFRESH_TOKEN_EXPIRATION)
     const expiresInSeconds =
-      Number.isFinite(parsedExpiration) && parsedExpiration > 0
+      Number.isFinite(parsedExpiration) || parsedExpiration > 0
         ? parsedExpiration
         : 7 * 24 * 60 * 60
killedBy: RegisterUserWithProviderUseCase expiration boundary conditions should use fallback value 604800 when REFRESH_TOKEN_EXPIRATION is 0
statusReason: expected +0 to be 604800 // Object.is equality

[Killed] ArithmeticOperator
src/application/use-cases/register-user-with-provider.use-case.ts:223:11
     const expiresInSeconds =
       Number.isFinite(parsedExpiration) && parsedExpiration > 0
         ? parsedExpiration
-        : 7 * 24 * 60 * 60
+        : 7 * 24 / 60 * 60
     const expiresAt = UtcDate.create(Date.now() + expiresInSeconds * 1000).toDate()
 
killedBy: RegisterUserWithProviderUseCase expiration boundary conditions should use fallback value 604800 when REFRESH_TOKEN_EXPIRATION is 0
statusReason: expected 168 to be 604800 // Object.is equality

[Killed] ArithmeticOperator
src/application/use-cases/register-user-with-provider.use-case.ts:223:11
     const expiresInSeconds =
       Number.isFinite(parsedExpiration) && parsedExpiration > 0
         ? parsedExpiration
-        : 7 * 24 * 60 * 60
+        : 7 * 24 * 60 / 60
     const expiresAt = UtcDate.create(Date.now() + expiresInSeconds * 1000).toDate()
 
killedBy: RegisterUserWithProviderUseCase expiration boundary conditions should use fallback value 604800 when REFRESH_TOKEN_EXPIRATION is 0
statusReason: expected 168 to be 604800 // Object.is equality

[Killed] ArithmeticOperator
src/application/use-cases/register-user-with-provider.use-case.ts:224:38
       Number.isFinite(parsedExpiration) && parsedExpiration > 0
         ? parsedExpiration
         : 7 * 24 * 60 * 60
-    const expiresAt = UtcDate.create(Date.now() + expiresInSeconds * 1000).toDate()
+    const expiresAt = UtcDate.create(Date.now() - expiresInSeconds * 1000).toDate()
 
     try {
killedBy: RegisterUserWithProviderUseCase expiration boundary conditions should set expiresAt to a future date approximately expiresInSeconds seconds from now
statusReason: expected 1779741660303 to be greater than or equal to 1779748860303

[Killed] ArithmeticOperator
src/application/use-cases/register-user-with-provider.use-case.ts:224:51
       Number.isFinite(parsedExpiration) && parsedExpiration > 0
         ? parsedExpiration
         : 7 * 24 * 60 * 60
-    const expiresAt = UtcDate.create(Date.now() + expiresInSeconds * 1000).toDate()
+    const expiresAt = UtcDate.create(Date.now() + expiresInSeconds / 1000).toDate()
 
     try {
killedBy: RegisterUserWithProviderUseCase expiration boundary conditions should set expiresAt to a future date approximately expiresInSeconds seconds from now
statusReason: expected 1779745265939 to be greater than or equal to 1779748865936

[Killed] BlockStatement
src/application/use-cases/register-user-with-provider.use-case.ts:226:9
         : 7 * 24 * 60 * 60
     const expiresAt = UtcDate.create(Date.now() + expiresInSeconds * 1000).toDate()
 
-    try {
-      // Store the refresh token in the database
-      await this.refreshTokenRepo.create({
-        userId: userId,
-        tokenHash: newRefreshToken.getHash(),
-        tokenFamily: new Uuid(tokenFamily).getValue(),
-        expiresAt: expiresAt,
-        ipAddress: auditContext.ipAddress ?? undefined,
-        userAgent: auditContext.userAgent ?? undefined,
-      })
-      const auditEntry: CreateAuditLogDTO = {
-        userId: userId,
-        entityType: EntityType.TOKEN,
-        entityId: new Uuid(tokenFamily).getValue(),
-        action: AuditAction.TOKEN_ISSUED,
-        changes: {
-          reason: 'refresh_token_stored',
-        },
-        ipAddress: auditContext.ipAddress ?? undefined,
-        userAgent: auditContext.userAgent ?? undefined,
-      }
-      // AuditLogPort.log() never throws per contract
-      await this.auditLog.log(auditEntry)
-    } catch (err) {
+    try {} catch (err) {
       this.logger.error(
         'Failed to store refresh token',
killedBy: RegisterUserWithProviderUseCase execute() successful registration with OAuth provider should log successful registration to audit log
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] LogicalOperator
src/application/use-cases/register-user-with-provider.use-case.ts:244:20
         changes: {
           reason: 'refresh_token_stored',
         },
-        ipAddress: auditContext.ipAddress ?? undefined,
+        ipAddress: auditContext.ipAddress && undefined,
         userAgent: auditContext.userAgent ?? undefined,
       }
killedBy: RegisterUserWithProviderUseCase execute() successful registration with OAuth provider should log successful registration to audit log
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
src/application/use-cases/register-user-with-provider.use-case.ts:249:19
       }
       // AuditLogPort.log() never throws per contract
       await this.auditLog.log(auditEntry)
-    } catch (err) {
-      this.logger.error(
-        'Failed to store refresh token',
-        err instanceof Error ? err : new Error(String(err)),
-        {
-          event: 'token.store.failed',
-          userId,
-        }
-      )
-      const auditEntry: CreateAuditLogDTO = {
-        userId: userId,
-        entityType: EntityType.TOKEN,
-        entityId: new Uuid(tokenFamily).getValue(),
-        action: AuditAction.TOKEN_ISSUED,
-        changes: {
-          reason: 'refresh_token_storage_failed',
-        },
-        ipAddress: auditContext.ipAddress ?? undefined,
-        userAgent: auditContext.userAgent ?? undefined,
-      }
-      // AuditLogPort.log() never throws per contract
-      await this.auditLog.log(auditEntry)
-      throw new InternalErrorException('Failed to store refresh token')
-    }
+    } catch (err) {}
 
     return {
killedBy: RegisterUserWithProviderUseCase refresh token storage failure should log error with correct message and context when create throws
statusReason: promise resolved "{ …(6) }" instead of rejecting

[Killed] StringLiteral
src/application/use-cases/register-user-with-provider.use-case.ts:254:18
         'Failed to store refresh token',
         err instanceof Error ? err : new Error(String(err)),
         {
-          event: 'token.store.failed',
+          event: "",
           userId,
         }
killedBy: RegisterUserWithProviderUseCase refresh token storage failure should log error with correct message and context when create throws
statusReason: expected "vi.fn()" to be called with arguments: [ …(3) ]

Received:

  1st vi.fn() call:

@@ -2,9 +2,9 @@
    "Failed to store refresh token",

[Killed] ObjectLiteral
src/application/use-cases/register-user-with-provider.use-case.ts:263:18
         entityType: EntityType.TOKEN,
         entityId: new Uuid(tokenFamily).getValue(),
         action: AuditAction.TOKEN_ISSUED,
-        changes: {
-          reason: 'refresh_token_storage_failed',
-        },
+        changes: {},
         ipAddress: auditContext.ipAddress ?? undefined,
         userAgent: auditContext.userAgent ?? undefined,
killedBy: RegisterUserWithProviderUseCase refresh token storage failure should log audit entry with reason refresh_token_storage_failed when create throws
statusReason: expected {} to deeply equal { Object (reason) }

[Killed] StringLiteral
src/application/use-cases/register-user-with-provider.use-case.ts:271:40
       }
       // AuditLogPort.log() never throws per contract
       await this.auditLog.log(auditEntry)
-      throw new InternalErrorException('Failed to store refresh token')
+      throw new InternalErrorException("")
     }
 
killedBy: RegisterUserWithProviderUseCase refresh token storage failure should throw InternalErrorException with "Failed to store refresh token" when create throws
statusReason: expected '' to be 'Failed to store refresh token' // Object.is equality
