[Killed] StringLiteral
src/application/use-cases/log-out.use-case.ts:128:22
    * ```
    */
   async execute(userId: UserIdType, auditContext: AuditContext): Promise<void> {
-    this.logger.info('Executing LogOutUseCase', { event: 'user.logout.attempt', userId })
+    this.logger.info("", { event: 'user.logout.attempt', userId })
 
     try {
killedBy: LogOutUseCase execute successful logout should log info message when starting logout
statusReason: expected "vi.fn()" to be called with arguments: [ 'Executing LogOutUseCase', { …(2) } ]

Received:

  1st vi.fn() call:

  [
-   "Executing LogOutUseCase",

[Killed] ObjectLiteral
src/application/use-cases/log-out.use-case.ts:128:49
    * ```
    */
   async execute(userId: UserIdType, auditContext: AuditContext): Promise<void> {
-    this.logger.info('Executing LogOutUseCase', { event: 'user.logout.attempt', userId })
+    this.logger.info('Executing LogOutUseCase', {})
 
     try {
killedBy: LogOutUseCase execute successful logout should log info message when starting logout
statusReason: expected "vi.fn()" to be called with arguments: [ 'Executing LogOutUseCase', { …(2) } ]

Received:

  1st vi.fn() call:

  [
    "Executing LogOutUseCase",

[Killed] BlockStatement
src/application/use-cases/log-out.use-case.ts:130:9
   async execute(userId: UserIdType, auditContext: AuditContext): Promise<void> {
     this.logger.info('Executing LogOutUseCase', { event: 'user.logout.attempt', userId })
 
-    try {
-      // Revoke all refresh tokens for the user (log out from all devices)
-      await this.refreshTokenRepo.revokeAllForUser(userId)
-      const auditEntry: CreateAuditLogDTO = {
-        userId: auditContext.userId,
-        entityType: EntityType.USER,
-        entityId: userId,
-        action: AuditAction.USER_LOGOUT,
-        changes: {
-          reason: 'refresh_token_revoke_successful',
-        },
-        ipAddress: auditContext.ipAddress ?? undefined,
-        userAgent: auditContext.userAgent ?? undefined,
-      }
-      // AuditLogPort.log() never throws per contract
-      await this.auditLog.log(auditEntry)
-    } catch (err) {
+    try {} catch (err) {
       this.logger.error(
         'Failed to revoke all refresh tokens for user during logout',
killedBy: LogOutUseCase execute successful logout should revoke all refresh tokens for the user
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0
