[NoCoverage] BlockStatement
adapters/secondary/repositories/ai-rag.repository.ts:52:60
    *
    * @todo Implement the actual vector insertion logic using `_data`.
    */
-  async createRagVectorEntry(_data: RagDto): Promise<void> {
-    const error = new Error('createRagVectorEntry is not implemented yet')
-    this.logger.error('createRagVectorEntry called before implementation', error)
-    throw error
-  }
+  async createRagVectorEntry(_data: RagDto): Promise<void> {}
 
   /**

[NoCoverage] StringLiteral
adapters/secondary/repositories/ai-rag.repository.ts:53:29
    * @todo Implement the actual vector insertion logic using `_data`.
    */
   async createRagVectorEntry(_data: RagDto): Promise<void> {
-    const error = new Error('createRagVectorEntry is not implemented yet')
+    const error = new Error("")
     this.logger.error('createRagVectorEntry called before implementation', error)
     throw error

[NoCoverage] StringLiteral
adapters/secondary/repositories/ai-rag.repository.ts:54:23
    */
   async createRagVectorEntry(_data: RagDto): Promise<void> {
     const error = new Error('createRagVectorEntry is not implemented yet')
-    this.logger.error('createRagVectorEntry called before implementation', error)
+    this.logger.error("", error)
     throw error
   }

[Killed] StringLiteral
adapters/secondary/repositories/ai-rag.repository.ts:103:27
           })
 
         if (!vectorStore) {
-          throw new Error('Failed to insert vector store record')
+          throw new Error("")
         }
 
killedBy: AIRAGRepository createVectorStore should throw when the vector store insert returns no row
statusReason: expected [Function] to throw error including 'Failed to insert vector store record' but got ''

[NoCoverage] StringLiteral
adapters/secondary/repositories/ai-rag.repository.ts:130:29
             })
 
           if (!insertedDoc) {
-            throw new Error(`Failed to insert document record for: ${doc.title}`)
+            throw new Error(``)
           }
 

[Killed] StringLiteral
adapters/secondary/repositories/ai-rag.repository.ts:134:29
           }
 
           if (insertedDoc.checksum == null) {
-            throw new Error(`Document checksum is null after insert for: ${doc.title}`)
+            throw new Error(``)
           }
 
killedBy: AIRAGRepository createVectorStore should throw when a document checksum is null after insert
statusReason: expected [Function] to throw error including 'Document checksum is null after inser…' but got ''

[Killed] EqualityOperator
adapters/secondary/repositories/ai-rag.repository.ts:153:15
           })
 
           // 2c. Persist chunk embeddings in the dimension-specific table.
-          if (doc.records.length > 0) {
+          if (doc.records.length <= 0) {
             const embeddingRows = doc.records.map((record, index) => ({
               documentId: insertedDoc.id,
killedBy: AIRAGRepository createVectorStore should create a vector store and return the result
statusReason: Failed to insert or update chat AI options record

[Survived] ConditionalExpression
adapters/secondary/repositories/ai-rag.repository.ts:153:15
           })
 
           // 2c. Persist chunk embeddings in the dimension-specific table.
-          if (doc.records.length > 0) {
+          if (true) {
             const embeddingRows = doc.records.map((record, index) => ({
               documentId: insertedDoc.id,

[NoCoverage] ConditionalExpression
adapters/secondary/repositories/ai-rag.repository.ts:165:15
             }))
 
             switch (data.dimension) {
-              case 384:
-                await tx.insert(vectorEmbeddings384).values(embeddingRows)
-                break
+              case 384:
               case 768:
                 await tx.insert(vectorEmbeddings768).values(embeddingRows)

[NoCoverage] ConditionalExpression
adapters/secondary/repositories/ai-rag.repository.ts:168:15
               case 384:
                 await tx.insert(vectorEmbeddings384).values(embeddingRows)
                 break
-              case 768:
-                await tx.insert(vectorEmbeddings768).values(embeddingRows)
-                break
+              case 768:
               case 1024:
                 await tx.insert(vectorEmbeddings1024).values(embeddingRows)

[NoCoverage] ConditionalExpression
adapters/secondary/repositories/ai-rag.repository.ts:171:15
               case 768:
                 await tx.insert(vectorEmbeddings768).values(embeddingRows)
                 break
-              case 1024:
-                await tx.insert(vectorEmbeddings1024).values(embeddingRows)
-                break
+              case 1024:
               case 1536:
                 await tx.insert(vectorEmbeddings1536).values(embeddingRows)

[Survived] ConditionalExpression
adapters/secondary/repositories/ai-rag.repository.ts:174:15
               case 1024:
                 await tx.insert(vectorEmbeddings1024).values(embeddingRows)
                 break
-              case 1536:
-                await tx.insert(vectorEmbeddings1536).values(embeddingRows)
-                break
+              case 1536:
               case 3072:
                 await tx.insert(vectorEmbeddings3072).values(embeddingRows)

[NoCoverage] ConditionalExpression
adapters/secondary/repositories/ai-rag.repository.ts:177:15
               case 1536:
                 await tx.insert(vectorEmbeddings1536).values(embeddingRows)
                 break
-              case 3072:
-                await tx.insert(vectorEmbeddings3072).values(embeddingRows)
-                break
+              case 3072:
               default:
                 throw new Error(`Unsupported embedding dimension: ${String(data.dimension)}`)

[NoCoverage] ConditionalExpression
adapters/secondary/repositories/ai-rag.repository.ts:180:15
               case 3072:
                 await tx.insert(vectorEmbeddings3072).values(embeddingRows)
                 break
-              default:
-                throw new Error(`Unsupported embedding dimension: ${String(data.dimension)}`)
+              default:
             }
           }

[Survived] LogicalOperator
adapters/secondary/repositories/ai-rag.repository.ts:196:24
           .values({
             chatTypeId: data.chatAIOptions.chatTypeId,
             prompt: data.chatAIOptions.prompt,
-            maxTokens: data.chatAIOptions.maxTokens ?? null,
+            maxTokens: data.chatAIOptions.maxTokens && null,
             temperature:
               data.chatAIOptions.temperature != null

[Survived] EqualityOperator
adapters/secondary/repositories/ai-rag.repository.ts:198:15
             prompt: data.chatAIOptions.prompt,
             maxTokens: data.chatAIOptions.maxTokens ?? null,
             temperature:
-              data.chatAIOptions.temperature != null
+              data.chatAIOptions.temperature == null
                 ? String(data.chatAIOptions.temperature)
                 : null,

[Survived] ConditionalExpression
adapters/secondary/repositories/ai-rag.repository.ts:198:15
             prompt: data.chatAIOptions.prompt,
             maxTokens: data.chatAIOptions.maxTokens ?? null,
             temperature:
-              data.chatAIOptions.temperature != null
+              true
                 ? String(data.chatAIOptions.temperature)
                 : null,

[Survived] EqualityOperator
adapters/secondary/repositories/ai-rag.repository.ts:201:19
               data.chatAIOptions.temperature != null
                 ? String(data.chatAIOptions.temperature)
                 : null,
-            topP: data.chatAIOptions.topP != null ? String(data.chatAIOptions.topP) : null,
+            topP: data.chatAIOptions.topP == null ? String(data.chatAIOptions.topP) : null,
             frequencyPenalty:
               data.chatAIOptions.frequencyPenalty != null

[Survived] ConditionalExpression
adapters/secondary/repositories/ai-rag.repository.ts:201:19
               data.chatAIOptions.temperature != null
                 ? String(data.chatAIOptions.temperature)
                 : null,
-            topP: data.chatAIOptions.topP != null ? String(data.chatAIOptions.topP) : null,
+            topP: false ? String(data.chatAIOptions.topP) : null,
             frequencyPenalty:
               data.chatAIOptions.frequencyPenalty != null

[Survived] EqualityOperator
adapters/secondary/repositories/ai-rag.repository.ts:203:15
                 : null,
             topP: data.chatAIOptions.topP != null ? String(data.chatAIOptions.topP) : null,
             frequencyPenalty:
-              data.chatAIOptions.frequencyPenalty != null
+              data.chatAIOptions.frequencyPenalty == null
                 ? String(data.chatAIOptions.frequencyPenalty)
                 : null,

[Survived] ConditionalExpression
adapters/secondary/repositories/ai-rag.repository.ts:203:15
                 : null,
             topP: data.chatAIOptions.topP != null ? String(data.chatAIOptions.topP) : null,
             frequencyPenalty:
-              data.chatAIOptions.frequencyPenalty != null
+              true
                 ? String(data.chatAIOptions.frequencyPenalty)
                 : null,

[Survived] ConditionalExpression
adapters/secondary/repositories/ai-rag.repository.ts:207:15
                 ? String(data.chatAIOptions.frequencyPenalty)
                 : null,
             presencePenalty:
-              data.chatAIOptions.presencePenalty != null
+              false
                 ? String(data.chatAIOptions.presencePenalty)
                 : null,

[Survived] EqualityOperator
adapters/secondary/repositories/ai-rag.repository.ts:207:15
                 ? String(data.chatAIOptions.frequencyPenalty)
                 : null,
             presencePenalty:
-              data.chatAIOptions.presencePenalty != null
+              data.chatAIOptions.presencePenalty == null
                 ? String(data.chatAIOptions.presencePenalty)
                 : null,

[Survived] LogicalOperator
adapters/secondary/repositories/ai-rag.repository.ts:210:28
               data.chatAIOptions.presencePenalty != null
                 ? String(data.chatAIOptions.presencePenalty)
                 : null,
-            stopSequences: data.chatAIOptions.stopSequences ?? null,
+            stopSequences: data.chatAIOptions.stopSequences && null,
             maxRetries: data.chatAIOptions.maxRetries ?? null,
           })

[Survived] LogicalOperator
adapters/secondary/repositories/ai-rag.repository.ts:211:25
                 ? String(data.chatAIOptions.presencePenalty)
                 : null,
             stopSequences: data.chatAIOptions.stopSequences ?? null,
-            maxRetries: data.chatAIOptions.maxRetries ?? null,
+            maxRetries: data.chatAIOptions.maxRetries && null,
           })
           .onConflictDoUpdate({

[Survived] ConditionalExpression
adapters/secondary/repositories/ai-rag.repository.ts:219:17
               prompt: data.chatAIOptions.prompt,
               maxTokens: data.chatAIOptions.maxTokens ?? null,
               temperature:
-                data.chatAIOptions.temperature != null
+                false
                   ? String(data.chatAIOptions.temperature)
                   : null,

[Survived] ConditionalExpression
adapters/secondary/repositories/ai-rag.repository.ts:224:17
                   : null,
               topP: data.chatAIOptions.topP != null ? String(data.chatAIOptions.topP) : null,
               frequencyPenalty:
-                data.chatAIOptions.frequencyPenalty != null
+                false
                   ? String(data.chatAIOptions.frequencyPenalty)
                   : null,

[Survived] ConditionalExpression
adapters/secondary/repositories/ai-rag.repository.ts:228:17
                   ? String(data.chatAIOptions.frequencyPenalty)
                   : null,
               presencePenalty:
-                data.chatAIOptions.presencePenalty != null
+                true
                   ? String(data.chatAIOptions.presencePenalty)
                   : null,

[Killed] BlockStatement
adapters/secondary/repositories/ai-rag.repository.ts:280:21
         .where(eq(embeddingModels.id, id))
         .limit(1)
       return rows[0]
-    } catch (error) {
-      this.logger.error(
-        'Error in getEmbeddingModelById',
-        error instanceof Error ? error : new Error(String(error))
-      )
-      throw error
-    }
+    } catch (error) {}
   }
 }
killedBy: AIRAGRepository getEmbeddingModelById should throw and log an error when the database throws
statusReason: promise resolved "undefined" instead of rejecting

[Killed] StringLiteral
adapters/secondary/repositories/ai-rag.repository.ts:282:9
       return rows[0]
     } catch (error) {
       this.logger.error(
-        'Error in getEmbeddingModelById',
+        "",
         error instanceof Error ? error : new Error(String(error))
       )
killedBy: AIRAGRepository getEmbeddingModelById should throw and log an error when the database throws
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
-   "Error in getEmbeddingModelById",
