[Killed] ObjectLiteral
src/shared/exceptions/not-found.exception.ts:11:63
       ? `${resource} with identifier '${identifier}' not found`
       : `${resource} not found`
 
-    super(message, ErrorCode.NOT_FOUND, HttpStatus.NOT_FOUND, { resource, identifier }, options)
+    super(message, ErrorCode.NOT_FOUND, HttpStatus.NOT_FOUND, {}, options)
   }
 }
killedBy: NotFoundException constructor should create exception with resource name only
statusReason: expected {} to deeply equal { resource: 'User', …(1) }
