[Killed] ConditionalExpression
src/application/dtos/delete-users.dto.ts:85:18
    * ```
    */
   static validate(data: components['schemas']['UserDeleteRequest']): DeleteUsersDto {
-    if (!data || typeof data !== 'object' || Array.isArray(data)) {
+    if (!data || false || Array.isArray(data)) {
       throw new TypeException('Data must be a valid array of user IDs')
     }
killedBy: DeleteUsersDto validate() data validation failures should throw TypeException when data is a string
statusReason: expected [Function] to throw error including 'Data must be a valid array of user IDs' but got 'userIds must be an array of strings'

[Killed] ConditionalExpression
src/application/dtos/delete-users.dto.ts:85:9
    * ```
    */
   static validate(data: components['schemas']['UserDeleteRequest']): DeleteUsersDto {
-    if (!data || typeof data !== 'object' || Array.isArray(data)) {
+    if (true) {
       throw new TypeException('Data must be a valid array of user IDs')
     }
killedBy: UserController deleteUsers() successful deletion should delete single user successfully
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] StringLiteral
src/application/dtos/delete-users.dto.ts:86:31
    */
   static validate(data: components['schemas']['UserDeleteRequest']): DeleteUsersDto {
     if (!data || typeof data !== 'object' || Array.isArray(data)) {
-      throw new TypeException('Data must be a valid array of user IDs')
+      throw new TypeException("")
     }
 
killedBy: UserController deleteUsers() validation errors should handle invalid request body
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
src/application/dtos/delete-users.dto.ts:89:99
       throw new TypeException('Data must be a valid array of user IDs')
     }
 
-    if (!Array.isArray(data.userIds) || !data.userIds.every((id: any) => typeof id === 'string')) {
-      throw new TypeException('userIds must be an array of strings')
-    }
+    if (!Array.isArray(data.userIds) || !data.userIds.every((id: any) => typeof id === 'string')) {}
 
     // Validate each userId is a valid UUIDv7
killedBy: DeleteUsersDto validate() data validation failures should throw TypeException for empty object
statusReason: expected error to be instance of TypeException

[Killed] EqualityOperator
src/application/dtos/delete-users.dto.ts:89:74
       throw new TypeException('Data must be a valid array of user IDs')
     }
 
-    if (!Array.isArray(data.userIds) || !data.userIds.every((id: any) => typeof id === 'string')) {
+    if (!Array.isArray(data.userIds) || !data.userIds.every((id: any) => typeof id !== 'string')) {
       throw new TypeException('userIds must be an array of strings')
     }
killedBy: UserController deleteUsers() successful deletion should delete single user successfully
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/application/dtos/delete-users.dto.ts:94:36
     }
 
     // Validate each userId is a valid UUIDv7
-    for (const id of data.userIds) {
-      const version = Uuid7Util.uuidVersionValidation(id)
-      if (version !== 'v7') {
-        throw new TypeException(`Invalid UUIDv7 format for userId: ${id}`)
-      }
-    }
+    for (const id of data.userIds) {}
 
     return new DeleteUsersDto(data.userIds as UserIdType[])
killedBy: DeleteUsersDto validate() UUID validation failures should throw TypeException for invalid UUID format
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
src/application/dtos/delete-users.dto.ts:96:29
     // Validate each userId is a valid UUIDv7
     for (const id of data.userIds) {
       const version = Uuid7Util.uuidVersionValidation(id)
-      if (version !== 'v7') {
-        throw new TypeException(`Invalid UUIDv7 format for userId: ${id}`)
-      }
+      if (version !== 'v7') {}
     }
 
killedBy: UserController deleteUsers() validation errors should handle invalid UUID format
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] EqualityOperator
src/application/dtos/delete-users.dto.ts:96:11
     // Validate each userId is a valid UUIDv7
     for (const id of data.userIds) {
       const version = Uuid7Util.uuidVersionValidation(id)
-      if (version !== 'v7') {
+      if (version === 'v7') {
         throw new TypeException(`Invalid UUIDv7 format for userId: ${id}`)
       }
killedBy: UserController deleteUsers() successful deletion should delete single user successfully
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] StringLiteral
src/application/dtos/delete-users.dto.ts:97:33
     for (const id of data.userIds) {
       const version = Uuid7Util.uuidVersionValidation(id)
       if (version !== 'v7') {
-        throw new TypeException(`Invalid UUIDv7 format for userId: ${id}`)
+        throw new TypeException(``)
       }
     }
killedBy: DeleteUsersDto validate() UUID validation failures should throw TypeException for invalid UUID format
statusReason: expected [Function] to throw error including 'Invalid UUIDv7 format for userId: not…' but got ''
