[Killed] StringLiteral
src/application/use-cases/delete-users.use-case.ts:112:22
    * ```
    */
   async execute(userIds: UserIdType[], auditContext: AuditContext): Promise<boolean> {
-    this.logger.info('Deleting users', { event: 'user.delete.attempt', userIds })
+    this.logger.info("", { event: 'user.delete.attempt', userIds })
 
     try {
killedBy: DeleteUsersUseCase execute() logging should log info message before deletion
statusReason: expected "vi.fn()" to be called with arguments: [ 'Deleting users', { …(2) } ]

Received:

  1st vi.fn() call:

@@ -1,7 +1,7 @@
  [

[Killed] BlockStatement
src/application/use-cases/delete-users.use-case.ts:114:9
   async execute(userIds: UserIdType[], auditContext: AuditContext): Promise<boolean> {
     this.logger.info('Deleting users', { event: 'user.delete.attempt', userIds })
 
-    try {
-      // Chat records are deleted by a database cascade constraint on the chats table.
-      // We intentionally do not call a separate chat history deletion here to avoid
-      // redundant operations and potential race conditions with the cascade.
-      await this.userRepository.deleteUsers(userIds)
-    } catch (error) {
+    try {} catch (error) {
       this.logger.error('Error deleting users', error as Error, {
         event: 'user.delete.failed',
killedBy: DeleteUsersUseCase execute() successful deletion should delete single user successfully
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/application/use-cases/delete-users.use-case.ts:119:21
       // We intentionally do not call a separate chat history deletion here to avoid
       // redundant operations and potential race conditions with the cascade.
       await this.userRepository.deleteUsers(userIds)
-    } catch (error) {
-      this.logger.error('Error deleting users', error as Error, {
-        event: 'user.delete.failed',
-        userIds,
-      })
-      throw error
-    }
+    } catch (error) {}
 
     const auditEntry: CreateAuditLogDTO = {
killedBy: DeleteUsersUseCase execute() error handling should throw error if repository deletion fails
statusReason: promise resolved "true" instead of rejecting

[Killed] ObjectLiteral
src/application/use-cases/delete-users.use-case.ts:133:18
       entityId: userIds.join(','),
       action: AuditAction.DELETE,
       changes: {
-        deleted: {
-          userIds: userIds,
-          count: userIds.length,
-        },
+        deleted: {},
       } satisfies DeleteChanges,
       ipAddress: auditContext.ipAddress,
killedBy: DeleteUsersUseCase execute() audit logging should log audit with deletion changes
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {
