[Killed] StringLiteral
src/application/use-cases/get-all-users.use-case.ts:73:53
    * ```
    */
   async execute(params?: PaginationParams): Promise<PaginatedUsersDto> {
-    this.logger.info('Fetching all users', { event: 'user.fetch_all.attempt', params })
+    this.logger.info('Fetching all users', { event: "", params })
 
     try {
killedBy: GetAllUsersUseCase execute() - logging should log before fetching users
statusReason: expected "vi.fn()" to be called with arguments: [ 'Fetching all users', { …(2) } ]

Received:

  1st vi.fn() call:

@@ -1,9 +1,9 @@
  [

[Killed] ObjectLiteral
src/application/use-cases/get-all-users.use-case.ts:95:58
         }
       })
 
-      this.logger.info('Successfully fetched all users', {
-        event: 'user.fetch_all.success',
-        count: userDtos.length,
-        total: result.total,
-      })
+      this.logger.info('Successfully fetched all users', {})
 
       return {
killedBy: GetAllUsersUseCase execute() - logging should log after successfully fetching users
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
-   "Successfully fetched all users",

[Killed] ObjectLiteral
src/application/use-cases/get-all-users.use-case.ts:108:70
         offset: result.offset,
       }
     } catch (error) {
-      this.logger.error('Failed to fetch all users', error as Error, {
-        event: 'user.fetch_all.failed',
-      })
+      this.logger.error('Failed to fetch all users', error as Error, {})
       throw error
     }
killedBy: GetAllUsersUseCase execute() - error handling should log error when repository fails
statusReason: expected "vi.fn()" to be called with arguments: [ 'Failed to fetch all users', …(2) ]

Received:

  1st vi.fn() call:

  [
    "Failed to fetch all users",
