[Killed] StringLiteral
src/application/use-cases/get-user-by-id.use-case.ts:89:22
    * ```
    */
   async execute(userId: UserIdType, _auditContext: AuditContext): Promise<User | null> {
-    this.logger.info('Executing GetUserByIdUseCase', { event: 'user.fetch.attempt', userId })
+    this.logger.info("", { event: 'user.fetch.attempt', userId })
 
     const user = await this.userRepository.findById(userId)
killedBy: GetUserByIdUseCase execute() successful retrieval should log info message with user ID
statusReason: expected "vi.fn()" to be called with arguments: [ Array(2) ]

Received:

  1st vi.fn() call:

  [
-   "Executing GetUserByIdUseCase",

[Killed] StringLiteral
src/application/use-cases/get-user-by-id.use-case.ts:89:63
    * ```
    */
   async execute(userId: UserIdType, _auditContext: AuditContext): Promise<User | null> {
-    this.logger.info('Executing GetUserByIdUseCase', { event: 'user.fetch.attempt', userId })
+    this.logger.info('Executing GetUserByIdUseCase', { event: "", userId })
 
     const user = await this.userRepository.findById(userId)
killedBy: GetUserByIdUseCase execute() successful retrieval should log info message with user ID
statusReason: expected "vi.fn()" to be called with arguments: [ Array(2) ]

Received:

  1st vi.fn() call:

  [
    "Executing GetUserByIdUseCase",

[Killed] BlockStatement
src/application/use-cases/get-user-by-id.use-case.ts:93:16
 
     const user = await this.userRepository.findById(userId)
 
-    if (!user) {
-      this.logger.warn('User not found', { event: 'user.fetch.not_found', userId })
-      return null
-    }
+    if (!user) {}
 
     return user
killedBy: GetUserByIdUseCase execute() user not found should log warning when user not found
statusReason: expected "vi.fn()" to be called with arguments: [ 'User not found', …(1) ]

Number of calls: 0

[Killed] ObjectLiteral
src/application/use-cases/get-user-by-id.use-case.ts:94:42
     const user = await this.userRepository.findById(userId)
 
     if (!user) {
-      this.logger.warn('User not found', { event: 'user.fetch.not_found', userId })
+      this.logger.warn('User not found', {})
       return null
     }
killedBy: GetUserByIdUseCase execute() user not found should log warning when user not found
statusReason: expected "vi.fn()" to be called with arguments: [ 'User not found', …(1) ]

Received:

  1st vi.fn() call:

  [
    "User not found",

[Killed] StringLiteral
src/application/use-cases/get-user-by-id.use-case.ts:94:24
     const user = await this.userRepository.findById(userId)
 
     if (!user) {
-      this.logger.warn('User not found', { event: 'user.fetch.not_found', userId })
+      this.logger.warn("", { event: 'user.fetch.not_found', userId })
       return null
     }
killedBy: GetUserByIdUseCase execute() user not found should log warning when user not found
statusReason: expected "vi.fn()" to be called with arguments: [ 'User not found', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "User not found",
