[Killed] BooleanLiteral
src/shared/utils/database.util.ts:56:14
   static isDuplicateKeyError(error: unknown): boolean {
     // Type guard: check if error is an object with a 'code' property
     if (!error || typeof error !== 'object') {
-      return false
+      return true
     }
 
killedBy: DatabaseUtil isDuplicateKeyError should return false for null
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/shared/utils/database.util.ts:62:28
     // PostgreSQL errors from node-postgres have a 'code' property
     // For unique constraint violations, code is '23505'
     // Drizzle ORM may wrap the error in a 'cause' property
-    if ('code' in error && error.code === this.PG_UNIQUE_VIOLATION) {
+    if ('code' in error && true) {
       return true
     }
killedBy: UserRepository saveUserWithProvider should throw DatabaseException if no user ID is returned
statusReason: expected error to be instance of DatabaseException

[Killed] ConditionalExpression
src/shared/utils/database.util.ts:62:9
     // PostgreSQL errors from node-postgres have a 'code' property
     // For unique constraint violations, code is '23505'
     // Drizzle ORM may wrap the error in a 'cause' property
-    if ('code' in error && error.code === this.PG_UNIQUE_VIOLATION) {
+    if (false) {
       return true
     }
killedBy: UserRepository saveUserWithProvider should throw ConflictException on duplicate email
statusReason: expected error to be instance of ConflictException

[Killed] BooleanLiteral
src/shared/utils/database.util.ts:63:14
     // For unique constraint violations, code is '23505'
     // Drizzle ORM may wrap the error in a 'cause' property
     if ('code' in error && error.code === this.PG_UNIQUE_VIOLATION) {
-      return true
+      return false
     }
 
killedBy: UserRepository saveUserWithProvider should throw ConflictException on duplicate email
statusReason: expected error to be instance of ConflictException

[Killed] BlockStatement
src/shared/utils/database.util.ts:67:77
     }
 
     // Check if the error is wrapped in a 'cause' property (Drizzle ORM pattern)
-    if ('cause' in error && error.cause && typeof error.cause === 'object') {
-      return 'code' in error.cause && error.cause.code === this.PG_UNIQUE_VIOLATION
-    }
+    if ('cause' in error && error.cause && typeof error.cause === 'object') {}
 
     return false
killedBy: AIAdminRepository createChatAIOptions should throw ConflictException when the duplicate key error is wrapped in cause (Drizzle ORM pattern)
statusReason: expected error to be instance of ConflictException

[Killed] EqualityOperator
src/shared/utils/database.util.ts:68:39
 
     // Check if the error is wrapped in a 'cause' property (Drizzle ORM pattern)
     if ('cause' in error && error.cause && typeof error.cause === 'object') {
-      return 'code' in error.cause && error.cause.code === this.PG_UNIQUE_VIOLATION
+      return 'code' in error.cause && error.cause.code !== this.PG_UNIQUE_VIOLATION
     }
 
killedBy: AIAdminRepository createChatAIOptions should throw ConflictException when the duplicate key error is wrapped in cause (Drizzle ORM pattern)
statusReason: expected error to be instance of ConflictException

[Killed] ConditionalExpression
src/shared/utils/database.util.ts:68:14
 
     // Check if the error is wrapped in a 'cause' property (Drizzle ORM pattern)
     if ('cause' in error && error.cause && typeof error.cause === 'object') {
-      return 'code' in error.cause && error.cause.code === this.PG_UNIQUE_VIOLATION
+      return false
     }
 
killedBy: AIAdminRepository createChatAIOptions should throw ConflictException when the duplicate key error is wrapped in cause (Drizzle ORM pattern)
statusReason: expected error to be instance of ConflictException
