[Killed] BlockStatement
src/application/dtos/presignedUrl.dto.ts:50:40
   static validate(data: components['schemas']['AIPreSignedRequest']): PresignedUrlDto {
     const d = data as Record<string, unknown>
 
-    if (!isDefined(d) || !isObject(d)) {
-      throw new TypeException('Request body must be a valid object')
-    }
+    if (!isDefined(d) || !isObject(d)) {}
 
     if (!isDefined(d['files']) || !isArray(d['files'])) {
killedBy: AIExtractDataController generatePresignedUrls() validation errors should return 422 when body is undefined
statusReason: expected "vi.fn()" to be called with arguments: [ 422 ]

Received:

  1st vi.fn() call:

  [
-   422,

[Killed] ConditionalExpression
src/application/dtos/presignedUrl.dto.ts:50:9
   static validate(data: components['schemas']['AIPreSignedRequest']): PresignedUrlDto {
     const d = data as Record<string, unknown>
 
-    if (!isDefined(d) || !isObject(d)) {
+    if (false) {
       throw new TypeException('Request body must be a valid object')
     }
killedBy: AIExtractDataController generatePresignedUrls() validation errors should return 422 when body is undefined
statusReason: expected "vi.fn()" to be called with arguments: [ 422 ]

Received:

  1st vi.fn() call:

  [
-   422,

[Killed] BooleanLiteral
src/application/dtos/presignedUrl.dto.ts:54:35
       throw new TypeException('Request body must be a valid object')
     }
 
-    if (!isDefined(d['files']) || !isArray(d['files'])) {
+    if (!isDefined(d['files']) || isArray(d['files'])) {
       throw new TypeException('files is required and must be an array')
     }
killedBy: AIExtractDataController generatePresignedUrls() successful operations should generate presigned URLs for valid PDF file
statusReason: expected "vi.fn()" to be called with arguments: [ 200 ]

Number of calls: 0

[Killed] BlockStatement
src/application/dtos/presignedUrl.dto.ts:54:57
       throw new TypeException('Request body must be a valid object')
     }
 
-    if (!isDefined(d['files']) || !isArray(d['files'])) {
-      throw new TypeException('files is required and must be an array')
-    }
+    if (!isDefined(d['files']) || !isArray(d['files'])) {}
 
     if (!d['files'] || !Array.isArray(d['files']) || d['files'].length === 0) {
killedBy: AIExtractDataController generatePresignedUrls() validation errors should return 422 when files array is missing
statusReason: expected "vi.fn()" to be called with arguments: [ { success: false, …(1) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] EqualityOperator
src/application/dtos/presignedUrl.dto.ts:58:54
       throw new TypeException('files is required and must be an array')
     }
 
-    if (!d['files'] || !Array.isArray(d['files']) || d['files'].length === 0) {
+    if (!d['files'] || !Array.isArray(d['files']) || d['files'].length !== 0) {
       throw new UnprocessableEntityException('No files provided. Expected { files: [...] }')
     }
killedBy: AIExtractDataController generatePresignedUrls() successful operations should generate presigned URLs for valid PDF file
statusReason: expected "vi.fn()" to be called with arguments: [ 200 ]

Number of calls: 0

[Killed] BlockStatement
src/application/dtos/presignedUrl.dto.ts:58:79
       throw new TypeException('files is required and must be an array')
     }
 
-    if (!d['files'] || !Array.isArray(d['files']) || d['files'].length === 0) {
-      throw new UnprocessableEntityException('No files provided. Expected { files: [...] }')
-    }
+    if (!d['files'] || !Array.isArray(d['files']) || d['files'].length === 0) {}
 
     const rawFiles = d['files'] as unknown[]
killedBy: AIExtractDataController generatePresignedUrls() validation errors should return 422 when files array is empty
statusReason: expected "vi.fn()" to be called with arguments: [ { success: false, …(1) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] StringLiteral
src/application/dtos/presignedUrl.dto.ts:59:46
     }
 
     if (!d['files'] || !Array.isArray(d['files']) || d['files'].length === 0) {
-      throw new UnprocessableEntityException('No files provided. Expected { files: [...] }')
+      throw new UnprocessableEntityException("")
     }
 
killedBy: AIExtractDataController generatePresignedUrls() validation errors should return 422 when files array is empty
statusReason: expected "vi.fn()" to be called with arguments: [ { success: false, …(1) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] ConditionalExpression
src/application/dtos/presignedUrl.dto.ts:64:9
 
     const rawFiles = d['files'] as unknown[]
 
-    if (rawFiles.length === 0) {
+    if (true) {
       throw new TypeException('files must contain at least one entry')
     }
killedBy: AIExtractDataController generatePresignedUrls() successful operations should generate presigned URLs for valid PDF file
statusReason: expected "vi.fn()" to be called with arguments: [ 200 ]

Number of calls: 0

[Killed] EqualityOperator
src/application/dtos/presignedUrl.dto.ts:64:9
 
     const rawFiles = d['files'] as unknown[]
 
-    if (rawFiles.length === 0) {
+    if (rawFiles.length !== 0) {
       throw new TypeException('files must contain at least one entry')
     }
killedBy: AIExtractDataController generatePresignedUrls() successful operations should generate presigned URLs for valid PDF file
statusReason: expected "vi.fn()" to be called with arguments: [ 200 ]

Number of calls: 0

[Killed] BooleanLiteral
src/application/dtos/presignedUrl.dto.ts:69:11
     }
 
     const files: PresignedUrlFileMetadata[] = rawFiles.map((item, index) => {
-      if (!isDefined(item) || !isObject(item)) {
+      if (isDefined(item) || !isObject(item)) {
         throw new TypeException(`files[${index}] must be a valid object`)
       }
killedBy: AIExtractDataController generatePresignedUrls() successful operations should generate presigned URLs for valid PDF file
statusReason: expected "vi.fn()" to be called with arguments: [ 200 ]

Number of calls: 0

[Killed] ConditionalExpression
src/application/dtos/presignedUrl.dto.ts:69:11
     }
 
     const files: PresignedUrlFileMetadata[] = rawFiles.map((item, index) => {
-      if (!isDefined(item) || !isObject(item)) {
+      if (true) {
         throw new TypeException(`files[${index}] must be a valid object`)
       }
killedBy: AIExtractDataController generatePresignedUrls() successful operations should generate presigned URLs for valid PDF file
statusReason: expected "vi.fn()" to be called with arguments: [ 200 ]

Number of calls: 0

[NoCoverage] StringLiteral
src/application/dtos/presignedUrl.dto.ts:70:33
 
     const files: PresignedUrlFileMetadata[] = rawFiles.map((item, index) => {
       if (!isDefined(item) || !isObject(item)) {
-        throw new TypeException(`files[${index}] must be a valid object`)
+        throw new TypeException(``)
       }
 

[Killed] BlockStatement
src/application/dtos/presignedUrl.dto.ts:75:72
 
       const file = item as Record<string, unknown>
 
-      if (!isDefined(file['filename']) || !isString(file['filename'])) {
-        throw new TypeException(`files[${index}].filename is required and must be a string`)
-      }
+      if (!isDefined(file['filename']) || !isString(file['filename'])) {}
 
       if (!isDefined(file['mimetype']) || !isString(file['mimetype'])) {
killedBy: AIExtractDataController generatePresignedUrls() validation errors should return 422 when file is missing filename
statusReason: expected "vi.fn()" to be called with arguments: [ { success: false, …(1) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] ConditionalExpression
src/application/dtos/presignedUrl.dto.ts:75:11
 
       const file = item as Record<string, unknown>
 
-      if (!isDefined(file['filename']) || !isString(file['filename'])) {
+      if (true) {
         throw new TypeException(`files[${index}].filename is required and must be a string`)
       }
killedBy: AIExtractDataController generatePresignedUrls() successful operations should generate presigned URLs for valid PDF file
statusReason: expected "vi.fn()" to be called with arguments: [ 200 ]

Number of calls: 0

[Killed] StringLiteral
src/application/dtos/presignedUrl.dto.ts:76:33
       const file = item as Record<string, unknown>
 
       if (!isDefined(file['filename']) || !isString(file['filename'])) {
-        throw new TypeException(`files[${index}].filename is required and must be a string`)
+        throw new TypeException(``)
       }
 
killedBy: AIExtractDataController generatePresignedUrls() validation errors should return 422 when file is missing filename
statusReason: expected "vi.fn()" to be called with arguments: [ { success: false, …(1) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] ConditionalExpression
src/application/dtos/presignedUrl.dto.ts:79:11
         throw new TypeException(`files[${index}].filename is required and must be a string`)
       }
 
-      if (!isDefined(file['mimetype']) || !isString(file['mimetype'])) {
+      if (false) {
         throw new TypeException(`files[${index}].mimetype is required and must be a string`)
       }
killedBy: AIExtractDataController generatePresignedUrls() validation errors should return 422 when file is missing mimetype
statusReason: expected "vi.fn()" to be called with arguments: [ { success: false, …(1) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] ConditionalExpression
src/application/dtos/presignedUrl.dto.ts:79:11
         throw new TypeException(`files[${index}].filename is required and must be a string`)
       }
 
-      if (!isDefined(file['mimetype']) || !isString(file['mimetype'])) {
+      if (true) {
         throw new TypeException(`files[${index}].mimetype is required and must be a string`)
       }
killedBy: AIExtractDataController generatePresignedUrls() successful operations should generate presigned URLs for valid PDF file
statusReason: expected "vi.fn()" to be called with arguments: [ 200 ]

Number of calls: 0

[Killed] StringLiteral
src/application/dtos/presignedUrl.dto.ts:80:33
       }
 
       if (!isDefined(file['mimetype']) || !isString(file['mimetype'])) {
-        throw new TypeException(`files[${index}].mimetype is required and must be a string`)
+        throw new TypeException(``)
       }
 
killedBy: AIExtractDataController generatePresignedUrls() validation errors should return 422 when file is missing mimetype
statusReason: expected "vi.fn()" to be called with arguments: [ { success: false, …(1) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] ConditionalExpression
src/application/dtos/presignedUrl.dto.ts:84:9
       }
 
       const flow =
-        isDefined(file['flow']) && isString(file['flow']) ? (file['flow'] as string) : undefined
+        false ? (file['flow'] as string) : undefined
 
       return {
killedBy: AIExtractDataController generatePresignedUrls() successful operations should accept valid rag flow value
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Array>, Any<Object>, 'rag' ]

Received:

  1st vi.fn() call:

  [
-   Any<Array>,

[Survived] LogicalOperator
src/application/dtos/presignedUrl.dto.ts:84:9
       }
 
       const flow =
-        isDefined(file['flow']) && isString(file['flow']) ? (file['flow'] as string) : undefined
+        isDefined(file['flow']) || isString(file['flow']) ? (file['flow'] as string) : undefined
 
       return {

[Survived] LogicalOperator
src/application/dtos/presignedUrl.dto.ts:94:7
     })
 
     const chatTypeId =
-      isDefined(d['chatTypeId']) && isString(d['chatTypeId'])
+      isDefined(d['chatTypeId']) || isString(d['chatTypeId'])
         ? (d['chatTypeId'] as string)
         : undefined

[Survived] ConditionalExpression
src/application/dtos/presignedUrl.dto.ts:94:7
     })
 
     const chatTypeId =
-      isDefined(d['chatTypeId']) && isString(d['chatTypeId'])
+      false
         ? (d['chatTypeId'] as string)
         : undefined
