[Killed] BlockStatement
src/application/dtos/extract-data.dto.ts:68:46
    * ```
    */
   static validate(data: any): ExtractDataDto {
-    if (!isDefined(data) || !isObject(data)) {
-      throw new TypeError('Data must be a valid object')
-    }
+    if (!isDefined(data) || !isObject(data)) {}
     if (!isDefined(data.bucketName) || !isString(data.bucketName)) {
       throw new TypeError('bucketName is required and must be a string')
killedBy: ExtractDataDto validate() validation errors - data parameter should throw TypeError when data is undefined
statusReason: expected [Function] to throw error including 'Data must be a valid object' but got 'Cannot read properties of undefined (…'

[Killed] BooleanLiteral
src/application/dtos/extract-data.dto.ts:68:29
    * ```
    */
   static validate(data: any): ExtractDataDto {
-    if (!isDefined(data) || !isObject(data)) {
+    if (!isDefined(data) || isObject(data)) {
       throw new TypeError('Data must be a valid object')
     }
killedBy: ExtractDataDto validate() successful validation should validate and create ExtractDataDto with valid data
statusReason: Data must be a valid object

[Killed] StringLiteral
src/application/dtos/extract-data.dto.ts:69:27
    */
   static validate(data: any): ExtractDataDto {
     if (!isDefined(data) || !isObject(data)) {
-      throw new TypeError('Data must be a valid object')
+      throw new TypeError("")
     }
     if (!isDefined(data.bucketName) || !isString(data.bucketName)) {
killedBy: ExtractDataDto validate() validation errors - data parameter should throw TypeError when data is undefined
statusReason: expected [Function] to throw error including 'Data must be a valid object' but got ''

[Killed] BooleanLiteral
src/application/dtos/extract-data.dto.ts:71:9
     if (!isDefined(data) || !isObject(data)) {
       throw new TypeError('Data must be a valid object')
     }
-    if (!isDefined(data.bucketName) || !isString(data.bucketName)) {
+    if (isDefined(data.bucketName) || !isString(data.bucketName)) {
       throw new TypeError('bucketName is required and must be a string')
     }
killedBy: ExtractDataDto validate() successful validation should validate and create ExtractDataDto with valid data
statusReason: bucketName is required and must be a string

[Killed] ConditionalExpression
src/application/dtos/extract-data.dto.ts:71:9
     if (!isDefined(data) || !isObject(data)) {
       throw new TypeError('Data must be a valid object')
     }
-    if (!isDefined(data.bucketName) || !isString(data.bucketName)) {
+    if (true) {
       throw new TypeError('bucketName is required and must be a string')
     }
killedBy: AIExtractDataController extractData() PDF file extraction should stream extracted text for a PDF file and call raw.end()
statusReason: expected "vi.fn()" to be called with arguments: [ 'Content-Type', …(1) ]

Number of calls: 0

[Killed] BooleanLiteral
src/application/dtos/extract-data.dto.ts:74:9
     if (!isDefined(data.bucketName) || !isString(data.bucketName)) {
       throw new TypeError('bucketName is required and must be a string')
     }
-    if (!isDefined(data.fileKey) || !isString(data.fileKey)) {
+    if (isDefined(data.fileKey) || !isString(data.fileKey)) {
       throw new TypeError('fileKeys is required and must be a string')
     }
killedBy: ExtractDataDto validate() successful validation should validate and create ExtractDataDto with valid data
statusReason: fileKeys is required and must be a string

[Killed] ConditionalExpression
src/application/dtos/extract-data.dto.ts:74:9
     if (!isDefined(data.bucketName) || !isString(data.bucketName)) {
       throw new TypeError('bucketName is required and must be a string')
     }
-    if (!isDefined(data.fileKey) || !isString(data.fileKey)) {
+    if (true) {
       throw new TypeError('fileKeys is required and must be a string')
     }
killedBy: AIExtractDataController extractData() PDF file extraction should stream extracted text for a PDF file and call raw.end()
statusReason: expected "vi.fn()" to be called with arguments: [ 'Content-Type', …(1) ]

Number of calls: 0
