[Killed] EqualityOperator
src/application/use-cases/extract-data.use-case.ts:21:7
  * @returns `'pdf'` | `'zip'` | `'unknown'`.
  */
 function detectFileType(buffer: Uint8Array): 'pdf' | 'zip' | 'unknown' {
-  if (buffer.length < 4) {
+  if (buffer.length >= 4) {
     return 'unknown'
   }
killedBy: ExtractDataUseCase execute() successful operations with PDF files should extract PDF file and return buffer with file type
statusReason: Invalid file type. Only PDF and ZIP files are supported.

[Killed] EqualityOperator
src/application/use-cases/extract-data.use-case.ts:21:7
  * @returns `'pdf'` | `'zip'` | `'unknown'`.
  */
 function detectFileType(buffer: Uint8Array): 'pdf' | 'zip' | 'unknown' {
-  if (buffer.length < 4) {
+  if (buffer.length <= 4) {
     return 'unknown'
   }
killedBy: ExtractDataUseCase execute() magic byte near-miss boundary tests should accept a buffer of exactly 4 bytes with valid PDF magic bytes
statusReason: Invalid file type. Only PDF and ZIP files are supported.

[Killed] ConditionalExpression
src/application/use-cases/extract-data.use-case.ts:26:51
   }
 
   // PDF magic bytes: %PDF (25 50 44 46)
-  if (buffer[0] === 0x25 && buffer[1] === 0x50 && buffer[2] === 0x44 && buffer[3] === 0x46) {
+  if (buffer[0] === 0x25 && buffer[1] === 0x50 && true && buffer[3] === 0x46) {
     return 'pdf'
   }
killedBy: ExtractDataUseCase execute() magic byte near-miss boundary tests should reject buffer where only bytes 0, 1, 3 match PDF signature (byte 2 differs)
statusReason: promise resolved "{ …(2) }" instead of rejecting

[Killed] LogicalOperator
src/application/use-cases/extract-data.use-case.ts:26:7
   }
 
   // PDF magic bytes: %PDF (25 50 44 46)
-  if (buffer[0] === 0x25 && buffer[1] === 0x50 && buffer[2] === 0x44 && buffer[3] === 0x46) {
+  if (buffer[0] === 0x25 || buffer[1] === 0x50 && buffer[2] === 0x44 && buffer[3] === 0x46) {
     return 'pdf'
   }
killedBy: ExtractDataUseCase execute() magic byte near-miss boundary tests should reject buffer where only bytes 1–3 match PDF signature (byte 0 differs)
statusReason: promise resolved "{ …(2) }" instead of rejecting

[Killed] EqualityOperator
src/application/use-cases/extract-data.use-case.ts:31:7
   }
 
   // ZIP magic bytes: PK (50 4B 03 04 or 50 4B 05 06 or 50 4B 07 08)
-  if (buffer[0] === 0x50 && buffer[1] === 0x4b) {
+  if (buffer[0] !== 0x50 && buffer[1] === 0x4b) {
     if (
       (buffer[2] === 0x03 && buffer[3] === 0x04) ||
killedBy: ExtractDataUseCase execute() successful operations with ZIP files should extract ZIP file and return buffer with file type
statusReason: Invalid file type. Only PDF and ZIP files are supported.

[Killed] ConditionalExpression
src/application/use-cases/extract-data.use-case.ts:31:7
   }
 
   // ZIP magic bytes: PK (50 4B 03 04 or 50 4B 05 06 or 50 4B 07 08)
-  if (buffer[0] === 0x50 && buffer[1] === 0x4b) {
+  if (true) {
     if (
       (buffer[2] === 0x03 && buffer[3] === 0x04) ||
killedBy: ExtractDataUseCase execute() magic byte near-miss boundary tests should reject buffer where byte 1 matches ZIP PK but byte 0 does not (0x25 0x4b)
statusReason: promise resolved "{ …(2) }" instead of rejecting

[Killed] EqualityOperator
src/application/use-cases/extract-data.use-case.ts:33:30
   // ZIP magic bytes: PK (50 4B 03 04 or 50 4B 05 06 or 50 4B 07 08)
   if (buffer[0] === 0x50 && buffer[1] === 0x4b) {
     if (
-      (buffer[2] === 0x03 && buffer[3] === 0x04) ||
+      (buffer[2] === 0x03 && buffer[3] !== 0x04) ||
       (buffer[2] === 0x05 && buffer[3] === 0x06) ||
       (buffer[2] === 0x07 && buffer[3] === 0x08)
killedBy: ExtractDataUseCase execute() successful operations with ZIP files should extract ZIP file and return buffer with file type
statusReason: Invalid file type. Only PDF and ZIP files are supported.

[Killed] ConditionalExpression
src/application/use-cases/extract-data.use-case.ts:33:7
   // ZIP magic bytes: PK (50 4B 03 04 or 50 4B 05 06 or 50 4B 07 08)
   if (buffer[0] === 0x50 && buffer[1] === 0x4b) {
     if (
-      (buffer[2] === 0x03 && buffer[3] === 0x04) ||
-      (buffer[2] === 0x05 && buffer[3] === 0x06) ||
-      (buffer[2] === 0x07 && buffer[3] === 0x08)
+      true
     ) {
       return 'zip'
killedBy: ExtractDataUseCase execute() file type detection should reject file that starts with PK but wrong following bytes
statusReason: promise resolved "{ …(2) }" instead of rejecting

[Killed] ConditionalExpression
src/application/use-cases/extract-data.use-case.ts:34:8
   if (buffer[0] === 0x50 && buffer[1] === 0x4b) {
     if (
       (buffer[2] === 0x03 && buffer[3] === 0x04) ||
-      (buffer[2] === 0x05 && buffer[3] === 0x06) ||
+      (true && buffer[3] === 0x06) ||
       (buffer[2] === 0x07 && buffer[3] === 0x08)
     ) {
killedBy: ExtractDataUseCase execute() magic byte near-miss boundary tests should reject ZIP header where byte 2 mismatches second inner variant (0x00 0x06)
statusReason: promise resolved "{ …(2) }" instead of rejecting

[Killed] ConditionalExpression
src/application/use-cases/extract-data.use-case.ts:34:30
   if (buffer[0] === 0x50 && buffer[1] === 0x4b) {
     if (
       (buffer[2] === 0x03 && buffer[3] === 0x04) ||
-      (buffer[2] === 0x05 && buffer[3] === 0x06) ||
+      (buffer[2] === 0x05 && true) ||
       (buffer[2] === 0x07 && buffer[3] === 0x08)
     ) {
killedBy: ExtractDataUseCase execute() magic byte near-miss boundary tests should reject ZIP header where byte 3 mismatches second inner variant (0x05 0x07)
statusReason: promise resolved "{ …(2) }" instead of rejecting

[Killed] ConditionalExpression
src/application/use-cases/extract-data.use-case.ts:35:30
     if (
       (buffer[2] === 0x03 && buffer[3] === 0x04) ||
       (buffer[2] === 0x05 && buffer[3] === 0x06) ||
-      (buffer[2] === 0x07 && buffer[3] === 0x08)
+      (buffer[2] === 0x07 && true)
     ) {
       return 'zip'
killedBy: ExtractDataUseCase execute() magic byte near-miss boundary tests should reject ZIP header where byte 3 mismatches third inner variant (0x07 0x09)
statusReason: promise resolved "{ …(2) }" instead of rejecting

[Killed] EqualityOperator
src/application/use-cases/extract-data.use-case.ts:35:8
     if (
       (buffer[2] === 0x03 && buffer[3] === 0x04) ||
       (buffer[2] === 0x05 && buffer[3] === 0x06) ||
-      (buffer[2] === 0x07 && buffer[3] === 0x08)
+      (buffer[2] !== 0x07 && buffer[3] === 0x08)
     ) {
       return 'zip'
killedBy: ExtractDataUseCase execute() successful operations with ZIP files should handle ZIP file with alternative magic bytes (50 4B 07 08)
statusReason: Invalid file type. Only PDF and ZIP files are supported.

[Killed] BlockStatement
src/application/use-cases/extract-data.use-case.ts:36:7
       (buffer[2] === 0x03 && buffer[3] === 0x04) ||
       (buffer[2] === 0x05 && buffer[3] === 0x06) ||
       (buffer[2] === 0x07 && buffer[3] === 0x08)
-    ) {
-      return 'zip'
-    }
+    ) {}
   }
 
killedBy: ExtractDataUseCase execute() successful operations with ZIP files should extract ZIP file and return buffer with file type
statusReason: Invalid file type. Only PDF and ZIP files are supported.

[Killed] BlockStatement
src/application/use-cases/extract-data.use-case.ts:110:35
       // Detect file type from buffer
       const fileType = detectFileType(result)
 
-      if (fileType === 'unknown') {
-        throw new UnprocessableEntityException(
-          'Invalid file type. Only PDF and ZIP files are supported.'
-        )
-      }
+      if (fileType === 'unknown') {}
 
       this.logger.info('File type detected', {
killedBy: ExtractDataUseCase execute() error handling - invalid file type should throw UnprocessableEntityException for invalid file type
statusReason: promise resolved "{ …(2) }" instead of rejecting

[Killed] ConditionalExpression
src/application/use-cases/extract-data.use-case.ts:110:11
       // Detect file type from buffer
       const fileType = detectFileType(result)
 
-      if (fileType === 'unknown') {
+      if (false) {
         throw new UnprocessableEntityException(
           'Invalid file type. Only PDF and ZIP files are supported.'
killedBy: ExtractDataUseCase execute() error handling - invalid file type should throw UnprocessableEntityException for invalid file type
statusReason: promise resolved "{ …(2) }" instead of rejecting

[Killed] StringLiteral
src/application/use-cases/extract-data.use-case.ts:112:11
 
       if (fileType === 'unknown') {
         throw new UnprocessableEntityException(
-          'Invalid file type. Only PDF and ZIP files are supported.'
+          ""
         )
       }
killedBy: ExtractDataUseCase execute() error handling - invalid file type should throw UnprocessableEntityException for invalid file type
statusReason: expected [Function] to throw error including 'Invalid file type. Only PDF and ZIP f…' but got ''

[Killed] StringLiteral
src/application/use-cases/extract-data.use-case.ts:116:24
         )
       }
 
-      this.logger.info('File type detected', {
+      this.logger.info("", {
         event: 'data_extraction.file_type_detected',
         fileKey: GetObjectCommandKeys.fileKey,
killedBy: ExtractDataUseCase execute() successful operations with PDF files should log info with detected file type
statusReason: expected "vi.fn()" to be called with arguments: [ 'File type detected', { …(3) } ]

Received:

  1st vi.fn() call:

  [
-   "File type detected",

[Killed] StringLiteral
src/application/use-cases/extract-data.use-case.ts:139:18
       this.logger.error(
         'Error during data extraction',
         error instanceof Error ? error : new Error(String(error)),
-        { event: 'data_extraction.failed' }
+        { event: "" }
       )
 
killedBy: ExtractDataUseCase execute() error handling - file not found should log error when file is not found
statusReason: expected "vi.fn()" to be called with arguments: [ Array(3) ]

Received:

  1st vi.fn() call:

  [
    "Error during data extraction",

[Killed] ObjectLiteral
src/application/use-cases/extract-data.use-case.ts:147:18
         entityType: EntityType.DATA_EXTRACTION,
         entityId: GetObjectCommandKeys.fileKey,
         action: AuditAction.FETCH,
-        changes: { reason: 'get_from_bucket_failed' },
+        changes: {},
         ipAddress: auditContext.ipAddress,
         userAgent: auditContext.userAgent ?? undefined,
killedBy: ExtractDataUseCase execute() error handling - file not found should create audit log with failure reason
statusReason: expected "vi.fn()" to be called with arguments: [ { …(7) } ]

Received:

  1st vi.fn() call:

@@ -1,11 +1,9 @@
  [
