[Killed] ConditionalExpression
src/application/dtos/rag.dto.ts:48:9
   ) {}
 
   static validate(data: components['schemas']['CreateVectorStoreRequest']): RagDto {
-    if (!isDefined(data) || !isObject(data)) {
+    if (false) {
       throw new TypeException('Data must be a valid object')
     }
killedBy: RagDto validate() — top-level type checks should throw TypeException when data is null
statusReason: expected error to be instance of TypeException

[Killed] BlockStatement
src/application/dtos/rag.dto.ts:48:46
   ) {}
 
   static validate(data: components['schemas']['CreateVectorStoreRequest']): RagDto {
-    if (!isDefined(data) || !isObject(data)) {
-      throw new TypeException('Data must be a valid object')
-    }
+    if (!isDefined(data) || !isObject(data)) {}
 
     if (
killedBy: RagDto validate() — top-level type checks should throw TypeException when data is null
statusReason: expected error to be instance of TypeException

[Killed] ConditionalExpression
src/application/dtos/rag.dto.ts:53:7
     }
 
     if (
-      !isDefined(data.documents) ||
-      !Array.isArray(data.documents) ||
-      data.documents.length === 0
+      false
     ) {
       throw new TypeException('Data must be a valid object')
killedBy: RagDto validate() — top-level type checks should throw TypeException when documents is missing
statusReason: expected error to be instance of TypeException

[Killed] ConditionalExpression
src/application/dtos/rag.dto.ts:53:7
     }
 
     if (
-      !isDefined(data.documents) ||
-      !Array.isArray(data.documents) ||
+      false ||
       data.documents.length === 0
     ) {
killedBy: RagDto validate() — top-level type checks should throw TypeException when documents is missing
statusReason: expected error to be instance of TypeException

[Killed] EqualityOperator
src/application/dtos/rag.dto.ts:55:7
     if (
       !isDefined(data.documents) ||
       !Array.isArray(data.documents) ||
-      data.documents.length === 0
+      data.documents.length !== 0
     ) {
       throw new TypeException('Data must be a valid object')
killedBy: RagDto validate() — id validation should throw ValidationException when id is missing
statusReason: expected error to be instance of ValidationException

[Survived] ConditionalExpression
src/application/dtos/rag.dto.ts:55:7
     if (
       !isDefined(data.documents) ||
       !Array.isArray(data.documents) ||
-      data.documents.length === 0
+      false
     ) {
       throw new TypeException('Data must be a valid object')

[Killed] BlockStatement
src/application/dtos/rag.dto.ts:56:7
       !isDefined(data.documents) ||
       !Array.isArray(data.documents) ||
       data.documents.length === 0
-    ) {
-      throw new TypeException('Data must be a valid object')
-    }
+    ) {}
 
     if (!isDefined(data.embeddingModels) || !isObject(data.embeddingModels)) {
killedBy: RagDto validate() — top-level type checks should throw TypeException when documents is missing
statusReason: expected error to be instance of TypeException

[Survived] StringLiteral
src/application/dtos/rag.dto.ts:57:31
       !Array.isArray(data.documents) ||
       data.documents.length === 0
     ) {
-      throw new TypeException('Data must be a valid object')
+      throw new TypeException("")
     }
 

[Killed] ConditionalExpression
src/application/dtos/rag.dto.ts:60:9
       throw new TypeException('Data must be a valid object')
     }
 
-    if (!isDefined(data.embeddingModels) || !isObject(data.embeddingModels)) {
+    if (false) {
       throw new TypeException('Data must be a valid object')
     }
killedBy: RagDto validate() — top-level type checks should throw TypeException when embeddingModels is missing
statusReason: expected error to be instance of TypeException

[Killed] LogicalOperator
src/application/dtos/rag.dto.ts:60:9
       throw new TypeException('Data must be a valid object')
     }
 
-    if (!isDefined(data.embeddingModels) || !isObject(data.embeddingModels)) {
+    if (!isDefined(data.embeddingModels) && !isObject(data.embeddingModels)) {
       throw new TypeException('Data must be a valid object')
     }
killedBy: RagDto validate() — top-level type checks should throw TypeException when embeddingModels is not an object
statusReason: expected error to be instance of TypeException

[Killed] BlockStatement
src/application/dtos/rag.dto.ts:64:80
       throw new TypeException('Data must be a valid object')
     }
 
-    if (!isDefined(data.vectorEmbeddings) || !isObject(data.vectorEmbeddings)) {
-      throw new TypeException('Data must be a valid object')
-    }
+    if (!isDefined(data.vectorEmbeddings) || !isObject(data.vectorEmbeddings)) {}
 
     if (!isDefined(data.chatAIOptions) || !isObject(data.chatAIOptions)) {
killedBy: RagDto validate() — top-level type checks should throw TypeException when vectorEmbeddings is missing
statusReason: expected error to be instance of TypeException

[Killed] LogicalOperator
src/application/dtos/rag.dto.ts:64:9
       throw new TypeException('Data must be a valid object')
     }
 
-    if (!isDefined(data.vectorEmbeddings) || !isObject(data.vectorEmbeddings)) {
+    if (!isDefined(data.vectorEmbeddings) && !isObject(data.vectorEmbeddings)) {
       throw new TypeException('Data must be a valid object')
     }
killedBy: RagDto validate() — top-level type checks should throw TypeException when vectorEmbeddings is not an object
statusReason: expected error to be instance of TypeException

[Survived] StringLiteral
src/application/dtos/rag.dto.ts:65:31
     }
 
     if (!isDefined(data.vectorEmbeddings) || !isObject(data.vectorEmbeddings)) {
-      throw new TypeException('Data must be a valid object')
+      throw new TypeException("")
     }
 

[Killed] LogicalOperator
src/application/dtos/rag.dto.ts:68:9
       throw new TypeException('Data must be a valid object')
     }
 
-    if (!isDefined(data.chatAIOptions) || !isObject(data.chatAIOptions)) {
+    if (!isDefined(data.chatAIOptions) && !isObject(data.chatAIOptions)) {
       throw new TypeException('Data must be a valid object')
     }
killedBy: RagDto validate() — top-level type checks should throw TypeException when chatAIOptions is not an object
statusReason: expected error to be instance of TypeException

[Killed] ConditionalExpression
src/application/dtos/rag.dto.ts:68:9
       throw new TypeException('Data must be a valid object')
     }
 
-    if (!isDefined(data.chatAIOptions) || !isObject(data.chatAIOptions)) {
+    if (false) {
       throw new TypeException('Data must be a valid object')
     }
killedBy: RagDto validate() — top-level type checks should throw TypeException when chatAIOptions is missing
statusReason: expected error to be instance of TypeException

[Killed] BooleanLiteral
src/application/dtos/rag.dto.ts:72:9
       throw new TypeException('Data must be a valid object')
     }
 
-    if (!isString(data.id)) {
+    if (isString(data.id)) {
       throw new ValidationException('id is required and must be a string')
     }
killedBy: RagDto validate() — id validation should throw ValidationException when id is missing
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
src/application/dtos/rag.dto.ts:72:9
       throw new TypeException('Data must be a valid object')
     }
 
-    if (!isString(data.id)) {
+    if (false) {
       throw new ValidationException('id is required and must be a string')
     }
killedBy: RagDto validate() — id validation should throw ValidationException when id is missing
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
src/application/dtos/rag.dto.ts:76:39
       throw new ValidationException('id is required and must be a string')
     }
 
-    for (const doc of data.documents) {
-      if (!isObject(doc)) {
-        throw new ValidationException('each document must be a valid object')
-      }
-
-      if (!isString(doc.title)) {
-        throw new ValidationException('documents.title is required and must be a string')
-      }
-
-      if (!isString(doc.source)) {
-        throw new ValidationException('documents.source is required and must be a string')
-      }
-    }
+    for (const doc of data.documents) {}
 
     // Type narrowing for discriminated union
killedBy: RagDto validate() — documents validation should throw ValidationException when a document element is null
statusReason: expected error to be instance of ValidationException

[Killed] ConditionalExpression
src/application/dtos/rag.dto.ts:77:11
     }
 
     for (const doc of data.documents) {
-      if (!isObject(doc)) {
+      if (true) {
         throw new ValidationException('each document must be a valid object')
       }
killedBy: RagDto validate() — id validation should throw ValidationException when id is an empty string
statusReason: expected [Function] to not throw an error but 'ValidationException: each document mu…' was thrown

[Killed] BlockStatement
src/application/dtos/rag.dto.ts:77:27
     }
 
     for (const doc of data.documents) {
-      if (!isObject(doc)) {
-        throw new ValidationException('each document must be a valid object')
-      }
+      if (!isObject(doc)) {}
 
       if (!isString(doc.title)) {
killedBy: RagDto validate() — documents validation should throw ValidationException when a document element is null
statusReason: expected error to be instance of ValidationException

[Killed] BlockStatement
src/application/dtos/rag.dto.ts:81:33
         throw new ValidationException('each document must be a valid object')
       }
 
-      if (!isString(doc.title)) {
-        throw new ValidationException('documents.title is required and must be a string')
-      }
+      if (!isString(doc.title)) {}
 
       if (!isString(doc.source)) {
killedBy: RagDto validate() — documents validation should throw ValidationException when documents.title is missing
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
src/application/dtos/rag.dto.ts:81:11
         throw new ValidationException('each document must be a valid object')
       }
 
-      if (!isString(doc.title)) {
+      if (true) {
         throw new ValidationException('documents.title is required and must be a string')
       }
killedBy: RagDto validate() — id validation should throw ValidationException when id is an empty string
statusReason: expected [Function] to not throw an error but 'ValidationException: documents.title …' was thrown

[Killed] StringLiteral
src/application/dtos/rag.dto.ts:82:39
       }
 
       if (!isString(doc.title)) {
-        throw new ValidationException('documents.title is required and must be a string')
+        throw new ValidationException("")
       }
 
killedBy: RagDto validate() — documents validation should throw ValidationException when documents.title is missing
statusReason: expected [Function] to throw error including 'documents.title is required and must …' but got ''

[Killed] ConditionalExpression
src/application/dtos/rag.dto.ts:85:11
         throw new ValidationException('documents.title is required and must be a string')
       }
 
-      if (!isString(doc.source)) {
+      if (false) {
         throw new ValidationException('documents.source is required and must be a string')
       }
killedBy: RagDto validate() — documents validation should throw ValidationException when documents.source is missing
statusReason: expected function to throw an error, but it didn't

[Killed] BooleanLiteral
src/application/dtos/rag.dto.ts:85:11
         throw new ValidationException('documents.title is required and must be a string')
       }
 
-      if (!isString(doc.source)) {
+      if (isString(doc.source)) {
         throw new ValidationException('documents.source is required and must be a string')
       }
killedBy: RagDto validate() — id validation should throw ValidationException when id is an empty string
statusReason: expected [Function] to not throw an error but 'ValidationException: documents.source…' was thrown

[Killed] EqualityOperator
src/application/dtos/rag.dto.ts:98:7
     if (
       'existingModelId' in data.embeddingModels &&
       isString(data.embeddingModels.existingModelId) &&
-      data.embeddingModels.existingModelId.trim() !== ''
+      data.embeddingModels.existingModelId.trim() === ''
     ) {
       validatedEmbeddingModels = {
killedBy: RagDto validate() — embeddingModels validation should accept existingModelId alone (branch 1 of oneOf)
statusReason: embeddingModels.modelName is required and must be a string

[Survived] ConditionalExpression
src/application/dtos/rag.dto.ts:98:7
     if (
       'existingModelId' in data.embeddingModels &&
       isString(data.embeddingModels.existingModelId) &&
-      data.embeddingModels.existingModelId.trim() !== ''
+      true
     ) {
       validatedEmbeddingModels = {

[Killed] StringLiteral
src/application/dtos/rag.dto.ts:114:39
       }
 
       if (!isString(embeddingData.modelName)) {
-        throw new ValidationException('embeddingModels.modelName is required and must be a string')
+        throw new ValidationException("")
       }
 
killedBy: RagDto validate() — embeddingModels validation should throw ValidationException when modelName is missing
statusReason: expected [Function] to throw error including 'embeddingModels.modelName is required…' but got ''

[Killed] ConditionalExpression
src/application/dtos/rag.dto.ts:117:11
         throw new ValidationException('embeddingModels.modelName is required and must be a string')
       }
 
-      if (!isNumber(embeddingData.dimension)) {
+      if (false) {
         throw new ValidationException('embeddingModels.dimension is required and must be a number')
       }
killedBy: RagDto validate() — embeddingModels validation should throw ValidationException when dimension is missing
statusReason: expected [Function] to throw error including 'embeddingModels.dimension is required…' but got 'embeddingModels.dimension must be eit…'

[Killed] BlockStatement
src/application/dtos/rag.dto.ts:117:47
         throw new ValidationException('embeddingModels.modelName is required and must be a string')
       }
 
-      if (!isNumber(embeddingData.dimension)) {
-        throw new ValidationException('embeddingModels.dimension is required and must be a number')
-      }
+      if (!isNumber(embeddingData.dimension)) {}
 
       const VALID_DIMENSIONS = [1536, 768, 384, 3072, 1024] as const
killedBy: RagDto validate() — embeddingModels validation should throw ValidationException when dimension is missing
statusReason: expected [Function] to throw error including 'embeddingModels.dimension is required…' but got 'embeddingModels.dimension must be eit…'

[Killed] StringLiteral
src/application/dtos/rag.dto.ts:118:39
       }
 
       if (!isNumber(embeddingData.dimension)) {
-        throw new ValidationException('embeddingModels.dimension is required and must be a number')
+        throw new ValidationException("")
       }
 
killedBy: RagDto validate() — embeddingModels validation should throw ValidationException when dimension is missing
statusReason: expected [Function] to throw error including 'embeddingModels.dimension is required…' but got ''

[Killed] BlockStatement
src/application/dtos/rag.dto.ts:123:82
 
       const VALID_DIMENSIONS = [1536, 768, 384, 3072, 1024] as const
       type ValidDimension = (typeof VALID_DIMENSIONS)[number]
-      if (!VALID_DIMENSIONS.includes(embeddingData.dimension as ValidDimension)) {
-        throw new ValidationException(
-          'embeddingModels.dimension must be either 1536, 768, 384, 3072, or 1024'
-        )
-      }
+      if (!VALID_DIMENSIONS.includes(embeddingData.dimension as ValidDimension)) {}
 
       if (!isString(embeddingData.modelProvider)) {
killedBy: RagDto validate() — embeddingModels validation should throw ValidationException when dimension is not one of the allowed values
statusReason: expected [Function] to throw error including 'embeddingModels.dimension must be eit…' but got 'embeddingModels.releaseYear is requir…'

[Killed] ConditionalExpression
src/application/dtos/rag.dto.ts:123:11
 
       const VALID_DIMENSIONS = [1536, 768, 384, 3072, 1024] as const
       type ValidDimension = (typeof VALID_DIMENSIONS)[number]
-      if (!VALID_DIMENSIONS.includes(embeddingData.dimension as ValidDimension)) {
+      if (false) {
         throw new ValidationException(
           'embeddingModels.dimension must be either 1536, 768, 384, 3072, or 1024'
killedBy: RagDto validate() — embeddingModels validation should throw ValidationException when dimension is not one of the allowed values
statusReason: expected [Function] to throw error including 'embeddingModels.dimension must be eit…' but got 'embeddingModels.releaseYear is requir…'

[Killed] BlockStatement
src/application/dtos/rag.dto.ts:129:51
         )
       }
 
-      if (!isString(embeddingData.modelProvider)) {
-        throw new ValidationException(
-          'embeddingModels.modelProvider is required and must be a string'
-        )
-      }
+      if (!isString(embeddingData.modelProvider)) {}
 
       const VALID_PROVIDERS = ['openai', 'google', 'cohere', 'amazon', 'voyage', 'mistral'] as const
killedBy: RagDto validate() — embeddingModels validation should throw ValidationException when modelProvider is missing
statusReason: expected [Function] to throw error including 'embeddingModels.modelProvider is requ…' but got 'embeddingModels.modelProvider must be…'

[Killed] ConditionalExpression
src/application/dtos/rag.dto.ts:129:11
         )
       }
 
-      if (!isString(embeddingData.modelProvider)) {
+      if (false) {
         throw new ValidationException(
           'embeddingModels.modelProvider is required and must be a string'
killedBy: RagDto validate() — embeddingModels validation should throw ValidationException when modelProvider is missing
statusReason: expected [Function] to throw error including 'embeddingModels.modelProvider is requ…' but got 'embeddingModels.modelProvider must be…'

[Killed] ConditionalExpression
src/application/dtos/rag.dto.ts:137:11
 
       const VALID_PROVIDERS = ['openai', 'google', 'cohere', 'amazon', 'voyage', 'mistral'] as const
       type ValidProvider = (typeof VALID_PROVIDERS)[number]
-      if (!VALID_PROVIDERS.includes(embeddingData.modelProvider as ValidProvider)) {
+      if (false) {
         throw new ValidationException(
           'embeddingModels.modelProvider must be one of: openai, google, cohere, amazon, voyage, mistral'
killedBy: RagDto validate() — embeddingModels validation should throw ValidationException when modelProvider is not a valid provider
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
src/application/dtos/rag.dto.ts:137:84
 
       const VALID_PROVIDERS = ['openai', 'google', 'cohere', 'amazon', 'voyage', 'mistral'] as const
       type ValidProvider = (typeof VALID_PROVIDERS)[number]
-      if (!VALID_PROVIDERS.includes(embeddingData.modelProvider as ValidProvider)) {
-        throw new ValidationException(
-          'embeddingModels.modelProvider must be one of: openai, google, cohere, amazon, voyage, mistral'
-        )
-      }
+      if (!VALID_PROVIDERS.includes(embeddingData.modelProvider as ValidProvider)) {}
 
       if (!isDefined(embeddingData.releaseYear)) {
killedBy: RagDto validate() — embeddingModels validation should throw ValidationException when modelProvider is not a valid provider
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
src/application/dtos/rag.dto.ts:143:50
         )
       }
 
-      if (!isDefined(embeddingData.releaseYear)) {
-        throw new ValidationException(
-          'embeddingModels.releaseYear is required and must be a number'
-        )
-      }
+      if (!isDefined(embeddingData.releaseYear)) {}
 
       if (!isNumber(embeddingData.releaseYear) || !Number.isInteger(embeddingData.releaseYear)) {
killedBy: RagDto validate() — embeddingModels validation should throw ValidationException when releaseYear is omitted for a new model
statusReason: expected [Function] to throw error including 'embeddingModels.releaseYear is requir…' but got 'embeddingModels.releaseYear must be a…'

[Killed] ConditionalExpression
src/application/dtos/rag.dto.ts:143:11
         )
       }
 
-      if (!isDefined(embeddingData.releaseYear)) {
+      if (false) {
         throw new ValidationException(
           'embeddingModels.releaseYear is required and must be a number'
killedBy: RagDto validate() — embeddingModels validation should throw ValidationException when releaseYear is omitted for a new model
statusReason: expected [Function] to throw error including 'embeddingModels.releaseYear is requir…' but got 'embeddingModels.releaseYear must be a…'

[Killed] BooleanLiteral
src/application/dtos/rag.dto.ts:149:51
         )
       }
 
-      if (!isNumber(embeddingData.releaseYear) || !Number.isInteger(embeddingData.releaseYear)) {
+      if (!isNumber(embeddingData.releaseYear) || Number.isInteger(embeddingData.releaseYear)) {
         throw new ValidationException('embeddingModels.releaseYear must be an integer')
       }
killedBy: RagDto validate() — id validation should throw ValidationException when id is an empty string
statusReason: expected [Function] to not throw an error but 'ValidationException: embeddingModels.…' was thrown

[Killed] StringLiteral
src/application/dtos/rag.dto.ts:150:39
       }
 
       if (!isNumber(embeddingData.releaseYear) || !Number.isInteger(embeddingData.releaseYear)) {
-        throw new ValidationException('embeddingModels.releaseYear must be an integer')
+        throw new ValidationException("")
       }
 
killedBy: RagDto validate() — embeddingModels validation should throw ValidationException when releaseYear is present but not a number
statusReason: expected [Function] to throw error including 'embeddingModels.releaseYear must be a…' but got ''

[Killed] ArithmeticOperator
src/application/dtos/rag.dto.ts:154:30
       }
 
       const currentYear = new Date().getFullYear()
-      const maxReleaseYear = currentYear + 1
+      const maxReleaseYear = currentYear - 1
       if (embeddingData.releaseYear < 2000 || embeddingData.releaseYear > maxReleaseYear) {
         throw new ValidationException(
killedBy: RagDto validate() — embeddingModels validation should throw ValidationException when releaseYear is below minimum (2000)
statusReason: expected [Function] to throw error including 'embeddingModels.releaseYear must be b…' but got 'embeddingModels.releaseYear must be b…'

[Killed] ConditionalExpression
src/application/dtos/rag.dto.ts:155:47
 
       const currentYear = new Date().getFullYear()
       const maxReleaseYear = currentYear + 1
-      if (embeddingData.releaseYear < 2000 || embeddingData.releaseYear > maxReleaseYear) {
+      if (embeddingData.releaseYear < 2000 || false) {
         throw new ValidationException(
           `embeddingModels.releaseYear must be between 2000 and ${maxReleaseYear}`
killedBy: RagDto validate() — embeddingModels validation should throw ValidationException when releaseYear is above maximum (2027)
statusReason: expected function to throw an error, but it didn't

[Killed] LogicalOperator
src/application/dtos/rag.dto.ts:155:11
 
       const currentYear = new Date().getFullYear()
       const maxReleaseYear = currentYear + 1
-      if (embeddingData.releaseYear < 2000 || embeddingData.releaseYear > maxReleaseYear) {
+      if (embeddingData.releaseYear < 2000 && embeddingData.releaseYear > maxReleaseYear) {
         throw new ValidationException(
           `embeddingModels.releaseYear must be between 2000 and ${maxReleaseYear}`
killedBy: RagDto validate() — embeddingModels validation should throw ValidationException when releaseYear is below minimum (2000)
statusReason: expected function to throw an error, but it didn't

[Killed] LogicalOperator
src/application/dtos/rag.dto.ts:166:9
         'text-multilingual-embedding-002',
       ] as const
       const requiresTaskType =
-        embeddingData.modelProvider === 'google' &&
-        GOOGLE_TASK_TYPE_REQUIRED_MODELS.includes(
-          embeddingData.modelName as (typeof GOOGLE_TASK_TYPE_REQUIRED_MODELS)[number]
-        )
+        embeddingData.modelProvider === 'google' || GOOGLE_TASK_TYPE_REQUIRED_MODELS.includes(embeddingData.modelName as (typeof GOOGLE_TASK_TYPE_REQUIRED_MODELS)[number])
 
       if (requiresTaskType && !isDefined(embeddingData.taskType)) {
killedBy: RagDto validate() — embeddingModels validation should accept all valid provider enum values
statusReason: embeddingModels.taskType is required for google models text-embedding-004 and text-multilingual-embedding-002

[Killed] ConditionalExpression
src/application/dtos/rag.dto.ts:166:9
         'text-multilingual-embedding-002',
       ] as const
       const requiresTaskType =
-        embeddingData.modelProvider === 'google' &&
-        GOOGLE_TASK_TYPE_REQUIRED_MODELS.includes(
-          embeddingData.modelName as (typeof GOOGLE_TASK_TYPE_REQUIRED_MODELS)[number]
-        )
+        false
 
       if (requiresTaskType && !isDefined(embeddingData.taskType)) {
killedBy: RagDto validate() — embeddingModels validation should throw ValidationException when google + text-embedding-004 and taskType is missing
statusReason: expected function to throw an error, but it didn't

[Killed] LogicalOperator
src/application/dtos/rag.dto.ts:171:11
           embeddingData.modelName as (typeof GOOGLE_TASK_TYPE_REQUIRED_MODELS)[number]
         )
 
-      if (requiresTaskType && !isDefined(embeddingData.taskType)) {
+      if (requiresTaskType || !isDefined(embeddingData.taskType)) {
         throw new ValidationException(
           'embeddingModels.taskType is required for google models text-embedding-004 and text-multilingual-embedding-002'
killedBy: RagDto validate() — id validation should throw ValidationException when id is an empty string
statusReason: expected [Function] to not throw an error but 'ValidationException: embeddingModels.…' was thrown

[Killed] BooleanLiteral
src/application/dtos/rag.dto.ts:171:31
           embeddingData.modelName as (typeof GOOGLE_TASK_TYPE_REQUIRED_MODELS)[number]
         )
 
-      if (requiresTaskType && !isDefined(embeddingData.taskType)) {
+      if (requiresTaskType && isDefined(embeddingData.taskType)) {
         throw new ValidationException(
           'embeddingModels.taskType is required for google models text-embedding-004 and text-multilingual-embedding-002'
killedBy: RagDto validate() — embeddingModels validation should throw ValidationException when google + text-embedding-004 and taskType is missing
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
src/application/dtos/rag.dto.ts:177:11
         )
       }
 
-      if (isDefined(embeddingData.taskType)) {
+      if (false) {
         const VALID_TASK_TYPES = [
           'RETRIEVAL_QUERY',
killedBy: RagDto validate() — embeddingModels validation should throw ValidationException when taskType is an invalid enum value
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
src/application/dtos/rag.dto.ts:177:11
         )
       }
 
-      if (isDefined(embeddingData.taskType)) {
+      if (true) {
         const VALID_TASK_TYPES = [
           'RETRIEVAL_QUERY',
killedBy: RagDto validate() — id validation should throw ValidationException when id is an empty string
statusReason: expected [Function] to not throw an error but 'ValidationException: embeddingModels.…' was thrown

[Killed] ConditionalExpression
src/application/dtos/rag.dto.ts:186:13
           'CLUSTERING',
         ] as const
         type ValidTaskType = (typeof VALID_TASK_TYPES)[number]
-        if (!isString(embeddingData.taskType)) {
+        if (true) {
           throw new ValidationException('embeddingModels.taskType must be a string')
         }
killedBy: RagDto validate() — embeddingModels validation should accept a valid taskType for a google model that requires it
statusReason: embeddingModels.taskType must be a string

[Killed] BooleanLiteral
src/application/dtos/rag.dto.ts:186:13
           'CLUSTERING',
         ] as const
         type ValidTaskType = (typeof VALID_TASK_TYPES)[number]
-        if (!isString(embeddingData.taskType)) {
+        if (isString(embeddingData.taskType)) {
           throw new ValidationException('embeddingModels.taskType must be a string')
         }
killedBy: RagDto validate() — embeddingModels validation should accept a valid taskType for a google model that requires it
statusReason: embeddingModels.taskType must be a string

[NoCoverage] StringLiteral
src/application/dtos/rag.dto.ts:187:41
         ] as const
         type ValidTaskType = (typeof VALID_TASK_TYPES)[number]
         if (!isString(embeddingData.taskType)) {
-          throw new ValidationException('embeddingModels.taskType must be a string')
+          throw new ValidationException("")
         }
         if (!VALID_TASK_TYPES.includes(embeddingData.taskType as ValidTaskType)) {
