[Killed] BooleanLiteral
src/application/dtos/rag.dto.ts:189:13
         if (!isString(embeddingData.taskType)) {
           throw new ValidationException('embeddingModels.taskType must be a string')
         }
-        if (!VALID_TASK_TYPES.includes(embeddingData.taskType as ValidTaskType)) {
+        if (VALID_TASK_TYPES.includes(embeddingData.taskType as ValidTaskType)) {
           throw new ValidationException(
             'embeddingModels.taskType must be one of: RETRIEVAL_QUERY, RETRIEVAL_DOCUMENT, SEMANTIC_SIMILARITY, CLASSIFICATION, CLUSTERING'
killedBy: RagDto validate() — embeddingModels validation should accept a valid taskType for a google model that requires it
statusReason: embeddingModels.taskType must be one of: RETRIEVAL_QUERY, RETRIEVAL_DOCUMENT, SEMANTIC_SIMILARITY, CLASSIFICATION, CLUSTERING

[Killed] ConditionalExpression
src/application/dtos/rag.dto.ts:189:13
         if (!isString(embeddingData.taskType)) {
           throw new ValidationException('embeddingModels.taskType must be a string')
         }
-        if (!VALID_TASK_TYPES.includes(embeddingData.taskType as ValidTaskType)) {
+        if (false) {
           throw new ValidationException(
             'embeddingModels.taskType must be one of: RETRIEVAL_QUERY, RETRIEVAL_DOCUMENT, SEMANTIC_SIMILARITY, CLASSIFICATION, CLUSTERING'
killedBy: RagDto validate() — embeddingModels validation should throw ValidationException when taskType is an invalid enum value
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
src/application/dtos/rag.dto.ts:211:9
       }
     }
 
-    if (!isNumber(data.vectorEmbeddings.chunkSize)) {
+    if (false) {
       throw new ValidationException('vectorEmbeddings.chunkSize is required and must be a number')
     }
killedBy: RagDto validate() — vectorEmbeddings validation should throw ValidationException when chunkSize is missing
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
src/application/dtos/rag.dto.ts:211:53
       }
     }
 
-    if (!isNumber(data.vectorEmbeddings.chunkSize)) {
-      throw new ValidationException('vectorEmbeddings.chunkSize is required and must be a number')
-    }
+    if (!isNumber(data.vectorEmbeddings.chunkSize)) {}
 
     if (!isNumber(data.vectorEmbeddings.chunkOverlap)) {
killedBy: RagDto validate() — vectorEmbeddings validation should throw ValidationException when chunkSize is missing
statusReason: expected function to throw an error, but it didn't

[Killed] StringLiteral
src/application/dtos/rag.dto.ts:212:37
     }
 
     if (!isNumber(data.vectorEmbeddings.chunkSize)) {
-      throw new ValidationException('vectorEmbeddings.chunkSize is required and must be a number')
+      throw new ValidationException("")
     }
 
killedBy: RagDto validate() — vectorEmbeddings validation should throw ValidationException when chunkSize is missing
statusReason: expected [Function] to throw error including 'vectorEmbeddings.chunkSize is require…' but got ''

[Killed] BlockStatement
src/application/dtos/rag.dto.ts:215:56
       throw new ValidationException('vectorEmbeddings.chunkSize is required and must be a number')
     }
 
-    if (!isNumber(data.vectorEmbeddings.chunkOverlap)) {
-      throw new ValidationException(
-        'vectorEmbeddings.chunkOverlap is required and must be a number'
-      )
-    }
+    if (!isNumber(data.vectorEmbeddings.chunkOverlap)) {}
 
     if (
killedBy: RagDto validate() — vectorEmbeddings validation should throw ValidationException when chunkOverlap is missing
statusReason: expected function to throw an error, but it didn't

[Killed] BooleanLiteral
src/application/dtos/rag.dto.ts:215:9
       throw new ValidationException('vectorEmbeddings.chunkSize is required and must be a number')
     }
 
-    if (!isNumber(data.vectorEmbeddings.chunkOverlap)) {
+    if (isNumber(data.vectorEmbeddings.chunkOverlap)) {
       throw new ValidationException(
         'vectorEmbeddings.chunkOverlap is required and must be a number'
killedBy: RagDto validate() — id validation should throw ValidationException when id is an empty string
statusReason: expected [Function] to not throw an error but 'ValidationException: vectorEmbeddings…' was thrown

[Killed] ConditionalExpression
src/application/dtos/rag.dto.ts:222:7
     }
 
     if (
-      isDefined(data.chatAIOptions.stopSequences) &&
-      !Array.isArray(data.chatAIOptions.stopSequences)
+      true
     ) {
       throw new ValidationException('chatAIOptions.stopSequences must be an array of strings')
killedBy: RagDto validate() — id validation should throw ValidationException when id is an empty string
statusReason: expected [Function] to not throw an error but 'ValidationException: chatAIOptions.st…' was thrown

[Survived] ConditionalExpression
src/application/dtos/rag.dto.ts:222:7
     }
 
     if (
-      isDefined(data.chatAIOptions.stopSequences) &&
-      !Array.isArray(data.chatAIOptions.stopSequences)
+      false
     ) {
       throw new ValidationException('chatAIOptions.stopSequences must be an array of strings')

[Survived] BlockStatement
src/application/dtos/rag.dto.ts:224:7
     if (
       isDefined(data.chatAIOptions.stopSequences) &&
       !Array.isArray(data.chatAIOptions.stopSequences)
-    ) {
-      throw new ValidationException('chatAIOptions.stopSequences must be an array of strings')
-    }
+    ) {}
 
     if (

[Killed] ConditionalExpression
src/application/dtos/rag.dto.ts:229:7
     }
 
     if (
-      isDefined(data.chatAIOptions.stopSequences) &&
-      Array.isArray(data.chatAIOptions.stopSequences) &&
-      !data.chatAIOptions.stopSequences.every(isString)
+      true
     ) {
       throw new ValidationException('chatAIOptions.stopSequences must be an array of strings')
killedBy: RagDto validate() — id validation should throw ValidationException when id is an empty string
statusReason: expected [Function] to not throw an error but 'ValidationException: chatAIOptions.st…' was thrown

[Killed] ConditionalExpression
src/application/dtos/rag.dto.ts:229:7
     }
 
     if (
-      isDefined(data.chatAIOptions.stopSequences) &&
-      Array.isArray(data.chatAIOptions.stopSequences) &&
+      true &&
       !data.chatAIOptions.stopSequences.every(isString)
     ) {
killedBy: RagDto validate() — chatAIOptions validation should accept chatAIOptions without stopSequences (it is optional)
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] MethodExpression
src/application/dtos/rag.dto.ts:231:8
     if (
       isDefined(data.chatAIOptions.stopSequences) &&
       Array.isArray(data.chatAIOptions.stopSequences) &&
-      !data.chatAIOptions.stopSequences.every(isString)
+      !data.chatAIOptions.stopSequences.some(isString)
     ) {
       throw new ValidationException('chatAIOptions.stopSequences must be an array of strings')
killedBy: RagDto validate() — chatAIOptions validation should throw ValidationException when stopSequences contains a non-string
statusReason: expected [Function] to throw error including 'chatAIOptions.stopSequences must be a…' but got 'chatAIOptions.prompt is required and …'

[Killed] BooleanLiteral
src/application/dtos/rag.dto.ts:231:7
     if (
       isDefined(data.chatAIOptions.stopSequences) &&
       Array.isArray(data.chatAIOptions.stopSequences) &&
-      !data.chatAIOptions.stopSequences.every(isString)
+      data.chatAIOptions.stopSequences.every(isString)
     ) {
       throw new ValidationException('chatAIOptions.stopSequences must be an array of strings')
killedBy: RagDto validate() — id validation should throw ValidationException when id is an empty string
statusReason: expected [Function] to not throw an error but 'ValidationException: chatAIOptions.st…' was thrown

[Killed] BlockStatement
src/application/dtos/rag.dto.ts:232:7
       isDefined(data.chatAIOptions.stopSequences) &&
       Array.isArray(data.chatAIOptions.stopSequences) &&
       !data.chatAIOptions.stopSequences.every(isString)
-    ) {
-      throw new ValidationException('chatAIOptions.stopSequences must be an array of strings')
-    }
+    ) {}
 
     if (isDefined(data.chatAIOptions.maxTokens) && !isNumber(data.chatAIOptions.maxTokens)) {
killedBy: RagDto validate() — chatAIOptions validation should throw ValidationException when stopSequences contains a non-string
statusReason: expected [Function] to throw error including 'chatAIOptions.stopSequences must be a…' but got 'chatAIOptions.prompt is required and …'

[Killed] StringLiteral
src/application/dtos/rag.dto.ts:233:37
       Array.isArray(data.chatAIOptions.stopSequences) &&
       !data.chatAIOptions.stopSequences.every(isString)
     ) {
-      throw new ValidationException('chatAIOptions.stopSequences must be an array of strings')
+      throw new ValidationException("")
     }
 
killedBy: RagDto validate() — chatAIOptions validation should throw ValidationException when stopSequences contains a non-string
statusReason: expected [Function] to throw error including 'chatAIOptions.stopSequences must be a…' but got ''

[Killed] BlockStatement
src/application/dtos/rag.dto.ts:236:93
       throw new ValidationException('chatAIOptions.stopSequences must be an array of strings')
     }
 
-    if (isDefined(data.chatAIOptions.maxTokens) && !isNumber(data.chatAIOptions.maxTokens)) {
-      throw new ValidationException('chatAIOptions.maxTokens must be a number')
-    }
+    if (isDefined(data.chatAIOptions.maxTokens) && !isNumber(data.chatAIOptions.maxTokens)) {}
 
     if (isDefined(data.chatAIOptions.temperature) && !isNumber(data.chatAIOptions.temperature)) {
killedBy: RagDto validate() — chatAIOptions validation should throw ValidationException when maxTokens is present but not a number
statusReason: expected function to throw an error, but it didn't

[Killed] BooleanLiteral
src/application/dtos/rag.dto.ts:236:52
       throw new ValidationException('chatAIOptions.stopSequences must be an array of strings')
     }
 
-    if (isDefined(data.chatAIOptions.maxTokens) && !isNumber(data.chatAIOptions.maxTokens)) {
+    if (isDefined(data.chatAIOptions.maxTokens) && isNumber(data.chatAIOptions.maxTokens)) {
       throw new ValidationException('chatAIOptions.maxTokens must be a number')
     }
killedBy: RagDto validate() — chatAIOptions validation should throw ValidationException when maxTokens is present but not a number
statusReason: expected function to throw an error, but it didn't

[Killed] LogicalOperator
src/application/dtos/rag.dto.ts:240:9
       throw new ValidationException('chatAIOptions.maxTokens must be a number')
     }
 
-    if (isDefined(data.chatAIOptions.temperature) && !isNumber(data.chatAIOptions.temperature)) {
+    if (isDefined(data.chatAIOptions.temperature) || !isNumber(data.chatAIOptions.temperature)) {
       throw new ValidationException('chatAIOptions.temperature must be a number')
     }
killedBy: RagDto validate() — id validation should throw ValidationException when id is an empty string
statusReason: expected [Function] to not throw an error but 'ValidationException: chatAIOptions.te…' was thrown

[Killed] ConditionalExpression
src/application/dtos/rag.dto.ts:240:9
       throw new ValidationException('chatAIOptions.maxTokens must be a number')
     }
 
-    if (isDefined(data.chatAIOptions.temperature) && !isNumber(data.chatAIOptions.temperature)) {
+    if (true) {
       throw new ValidationException('chatAIOptions.temperature must be a number')
     }
killedBy: RagDto validate() — id validation should throw ValidationException when id is an empty string
statusReason: expected [Function] to not throw an error but 'ValidationException: chatAIOptions.te…' was thrown

[Killed] LogicalOperator
src/application/dtos/rag.dto.ts:244:9
       throw new ValidationException('chatAIOptions.temperature must be a number')
     }
 
-    if (isDefined(data.chatAIOptions.topP) && !isNumber(data.chatAIOptions.topP)) {
+    if (isDefined(data.chatAIOptions.topP) || !isNumber(data.chatAIOptions.topP)) {
       throw new ValidationException('chatAIOptions.topP must be a number')
     }
killedBy: RagDto validate() — id validation should throw ValidationException when id is an empty string
statusReason: expected [Function] to not throw an error but 'ValidationException: chatAIOptions.to…' was thrown

[Killed] BlockStatement
src/application/dtos/rag.dto.ts:244:83
       throw new ValidationException('chatAIOptions.temperature must be a number')
     }
 
-    if (isDefined(data.chatAIOptions.topP) && !isNumber(data.chatAIOptions.topP)) {
-      throw new ValidationException('chatAIOptions.topP must be a number')
-    }
+    if (isDefined(data.chatAIOptions.topP) && !isNumber(data.chatAIOptions.topP)) {}
 
     if (
killedBy: RagDto validate() — chatAIOptions validation should throw ValidationException when topP is present but not a number
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
src/application/dtos/rag.dto.ts:249:7
     }
 
     if (
-      isDefined(data.chatAIOptions.frequencyPenalty) &&
-      !isNumber(data.chatAIOptions.frequencyPenalty)
+      true
     ) {
       throw new ValidationException('chatAIOptions.frequencyPenalty must be a number')
killedBy: RagDto validate() — id validation should throw ValidationException when id is an empty string
statusReason: expected [Function] to not throw an error but 'ValidationException: chatAIOptions.fr…' was thrown

[Killed] ConditionalExpression
src/application/dtos/rag.dto.ts:249:7
     }
 
     if (
-      isDefined(data.chatAIOptions.frequencyPenalty) &&
-      !isNumber(data.chatAIOptions.frequencyPenalty)
+      false
     ) {
       throw new ValidationException('chatAIOptions.frequencyPenalty must be a number')
killedBy: RagDto validate() — chatAIOptions validation should throw ValidationException when frequencyPenalty is present but not a number
statusReason: expected function to throw an error, but it didn't

[Killed] BooleanLiteral
src/application/dtos/rag.dto.ts:250:7
 
     if (
       isDefined(data.chatAIOptions.frequencyPenalty) &&
-      !isNumber(data.chatAIOptions.frequencyPenalty)
+      isNumber(data.chatAIOptions.frequencyPenalty)
     ) {
       throw new ValidationException('chatAIOptions.frequencyPenalty must be a number')
killedBy: RagDto validate() — chatAIOptions validation should throw ValidationException when frequencyPenalty is present but not a number
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
src/application/dtos/rag.dto.ts:251:7
     if (
       isDefined(data.chatAIOptions.frequencyPenalty) &&
       !isNumber(data.chatAIOptions.frequencyPenalty)
-    ) {
-      throw new ValidationException('chatAIOptions.frequencyPenalty must be a number')
-    }
+    ) {}
 
     if (
killedBy: RagDto validate() — chatAIOptions validation should throw ValidationException when frequencyPenalty is present but not a number
statusReason: expected function to throw an error, but it didn't

[Killed] StringLiteral
src/application/dtos/rag.dto.ts:252:37
       isDefined(data.chatAIOptions.frequencyPenalty) &&
       !isNumber(data.chatAIOptions.frequencyPenalty)
     ) {
-      throw new ValidationException('chatAIOptions.frequencyPenalty must be a number')
+      throw new ValidationException("")
     }
 
killedBy: RagDto validate() — chatAIOptions validation should throw ValidationException when frequencyPenalty is present but not a number
statusReason: expected [Function] to throw error including 'chatAIOptions.frequencyPenalty must b…' but got ''

[Killed] ConditionalExpression
src/application/dtos/rag.dto.ts:256:7
     }
 
     if (
-      isDefined(data.chatAIOptions.presencePenalty) &&
-      !isNumber(data.chatAIOptions.presencePenalty)
+      false
     ) {
       throw new ValidationException('chatAIOptions.presencePenalty must be a number')
killedBy: RagDto validate() — chatAIOptions validation should throw ValidationException when presencePenalty is present but not a number
statusReason: expected function to throw an error, but it didn't

[Killed] LogicalOperator
src/application/dtos/rag.dto.ts:256:7
     }
 
     if (
-      isDefined(data.chatAIOptions.presencePenalty) &&
-      !isNumber(data.chatAIOptions.presencePenalty)
+      isDefined(data.chatAIOptions.presencePenalty) || !isNumber(data.chatAIOptions.presencePenalty)
     ) {
       throw new ValidationException('chatAIOptions.presencePenalty must be a number')
killedBy: RagDto validate() — id validation should throw ValidationException when id is an empty string
statusReason: expected [Function] to not throw an error but 'ValidationException: chatAIOptions.pr…' was thrown

[Killed] BooleanLiteral
src/application/dtos/rag.dto.ts:257:7
 
     if (
       isDefined(data.chatAIOptions.presencePenalty) &&
-      !isNumber(data.chatAIOptions.presencePenalty)
+      isNumber(data.chatAIOptions.presencePenalty)
     ) {
       throw new ValidationException('chatAIOptions.presencePenalty must be a number')
killedBy: RagDto validate() — chatAIOptions validation should throw ValidationException when presencePenalty is present but not a number
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
src/application/dtos/rag.dto.ts:258:7
     if (
       isDefined(data.chatAIOptions.presencePenalty) &&
       !isNumber(data.chatAIOptions.presencePenalty)
-    ) {
-      throw new ValidationException('chatAIOptions.presencePenalty must be a number')
-    }
+    ) {}
 
     if (isDefined(data.chatAIOptions.maxRetries) && !isNumber(data.chatAIOptions.maxRetries)) {
killedBy: RagDto validate() — chatAIOptions validation should throw ValidationException when presencePenalty is present but not a number
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
src/application/dtos/rag.dto.ts:262:9
       throw new ValidationException('chatAIOptions.presencePenalty must be a number')
     }
 
-    if (isDefined(data.chatAIOptions.maxRetries) && !isNumber(data.chatAIOptions.maxRetries)) {
+    if (true) {
       throw new ValidationException('chatAIOptions.maxRetries must be a number')
     }
killedBy: RagDto validate() — id validation should throw ValidationException when id is an empty string
statusReason: expected [Function] to not throw an error but 'ValidationException: chatAIOptions.ma…' was thrown

[Killed] BlockStatement
src/application/dtos/rag.dto.ts:262:95
       throw new ValidationException('chatAIOptions.presencePenalty must be a number')
     }
 
-    if (isDefined(data.chatAIOptions.maxRetries) && !isNumber(data.chatAIOptions.maxRetries)) {
-      throw new ValidationException('chatAIOptions.maxRetries must be a number')
-    }
+    if (isDefined(data.chatAIOptions.maxRetries) && !isNumber(data.chatAIOptions.maxRetries)) {}
 
     if (!isDefined(data.chatAIOptions.chatTypeId)) {
killedBy: RagDto validate() — chatAIOptions validation should throw ValidationException when maxRetries is present but not a number
statusReason: expected function to throw an error, but it didn't

[Killed] StringLiteral
src/application/dtos/rag.dto.ts:263:37
     }
 
     if (isDefined(data.chatAIOptions.maxRetries) && !isNumber(data.chatAIOptions.maxRetries)) {
-      throw new ValidationException('chatAIOptions.maxRetries must be a number')
+      throw new ValidationException("")
     }
 
killedBy: RagDto validate() — chatAIOptions validation should throw ValidationException when maxRetries is present but not a number
statusReason: expected [Function] to throw error including 'chatAIOptions.maxRetries must be a nu…' but got ''

[Killed] BooleanLiteral
src/application/dtos/rag.dto.ts:266:9
       throw new ValidationException('chatAIOptions.maxRetries must be a number')
     }
 
-    if (!isDefined(data.chatAIOptions.chatTypeId)) {
+    if (isDefined(data.chatAIOptions.chatTypeId)) {
       throw new ValidationException('chatAIOptions.chatTypeId is required')
     }
killedBy: RagDto validate() — id validation should throw ValidationException when id is an empty string
statusReason: expected [Function] to not throw an error but 'ValidationException: chatAIOptions.ch…' was thrown

[Killed] ConditionalExpression
src/application/dtos/rag.dto.ts:266:9
       throw new ValidationException('chatAIOptions.maxRetries must be a number')
     }
 
-    if (!isDefined(data.chatAIOptions.chatTypeId)) {
+    if (true) {
       throw new ValidationException('chatAIOptions.chatTypeId is required')
     }
killedBy: RagDto validate() — id validation should throw ValidationException when id is an empty string
statusReason: expected [Function] to not throw an error but 'ValidationException: chatAIOptions.ch…' was thrown

[Killed] BooleanLiteral
src/application/dtos/rag.dto.ts:270:9
       throw new ValidationException('chatAIOptions.chatTypeId is required')
     }
 
-    if (!isString(data.chatAIOptions.chatTypeId)) {
+    if (isString(data.chatAIOptions.chatTypeId)) {
       throw new ValidationException('chatAIOptions.chatTypeId must be a string')
     }
killedBy: RagDto validate() — id validation should throw ValidationException when id is an empty string
statusReason: expected [Function] to not throw an error but 'ValidationException: chatAIOptions.ch…' was thrown

[Killed] ConditionalExpression
src/application/dtos/rag.dto.ts:270:9
       throw new ValidationException('chatAIOptions.chatTypeId is required')
     }
 
-    if (!isString(data.chatAIOptions.chatTypeId)) {
+    if (false) {
       throw new ValidationException('chatAIOptions.chatTypeId must be a string')
     }
killedBy: RagDto validate() — chatAIOptions validation should throw ValidationException when chatTypeId is not a string
statusReason: expected [Function] to throw error including 'chatAIOptions.chatTypeId must be a st…' but got 'chatAIOptions.prompt is required and …'

[Killed] BlockStatement
src/application/dtos/rag.dto.ts:274:88
       throw new ValidationException('chatAIOptions.chatTypeId must be a string')
     }
 
-    if (!isDefined(data.chatAIOptions.prompt) || !isString(data.chatAIOptions.prompt)) {
-      throw new ValidationException('chatAIOptions.prompt is required and must be a string')
-    }
+    if (!isDefined(data.chatAIOptions.prompt) || !isString(data.chatAIOptions.prompt)) {}
 
     if (!data.chatAIOptions.prompt.trim()) {
killedBy: RagDto validate() — chatAIOptions validation should throw ValidationException when prompt is missing
statusReason: expected error to be instance of ValidationException

[Killed] LogicalOperator
src/application/dtos/rag.dto.ts:274:9
       throw new ValidationException('chatAIOptions.chatTypeId must be a string')
     }
 
-    if (!isDefined(data.chatAIOptions.prompt) || !isString(data.chatAIOptions.prompt)) {
+    if (!isDefined(data.chatAIOptions.prompt) && !isString(data.chatAIOptions.prompt)) {
       throw new ValidationException('chatAIOptions.prompt is required and must be a string')
     }
killedBy: RagDto validate() — chatAIOptions validation should throw ValidationException when prompt is not a string
statusReason: expected error to be instance of ValidationException

[Killed] ConditionalExpression
src/application/dtos/rag.dto.ts:278:9
       throw new ValidationException('chatAIOptions.prompt is required and must be a string')
     }
 
-    if (!data.chatAIOptions.prompt.trim()) {
+    if (false) {
       throw new ValidationException('chatAIOptions.prompt must not be empty or whitespace-only')
     }
killedBy: RagDto validate() — chatAIOptions validation should throw ValidationException when prompt is whitespace-only
statusReason: expected function to throw an error, but it didn't

[Killed] MethodExpression
src/application/dtos/rag.dto.ts:278:10
       throw new ValidationException('chatAIOptions.prompt is required and must be a string')
     }
 
-    if (!data.chatAIOptions.prompt.trim()) {
+    if (!data.chatAIOptions.prompt) {
       throw new ValidationException('chatAIOptions.prompt must not be empty or whitespace-only')
     }
killedBy: RagDto validate() — chatAIOptions validation should throw ValidationException when prompt is whitespace-only
statusReason: expected function to throw an error, but it didn't

[Killed] StringLiteral
src/application/dtos/rag.dto.ts:279:37
     }
 
     if (!data.chatAIOptions.prompt.trim()) {
-      throw new ValidationException('chatAIOptions.prompt must not be empty or whitespace-only')
+      throw new ValidationException("")
     }
 
killedBy: RagDto validate() — chatAIOptions validation should throw ValidationException when prompt is whitespace-only
statusReason: expected [Function] to throw error including 'chatAIOptions.prompt must not be empt…' but got ''

[Killed] MethodExpression
src/application/dtos/rag.dto.ts:292:17
       },
       {
         chatTypeId: data.chatAIOptions.chatTypeId,
-        prompt: data.chatAIOptions.prompt.trim(),
+        prompt: data.chatAIOptions.prompt,
         maxTokens: data.chatAIOptions.maxTokens ?? undefined,
         temperature: data.chatAIOptions.temperature ?? undefined,
killedBy: RagDto validate() — chatAIOptions validation should trim whitespace from prompt
statusReason: expected '  You are helpful.  ' to be 'You are helpful.' // Object.is equality

[Killed] LogicalOperator
src/application/dtos/rag.dto.ts:293:20
       {
         chatTypeId: data.chatAIOptions.chatTypeId,
         prompt: data.chatAIOptions.prompt.trim(),
-        maxTokens: data.chatAIOptions.maxTokens ?? undefined,
+        maxTokens: data.chatAIOptions.maxTokens && undefined,
         temperature: data.chatAIOptions.temperature ?? undefined,
         topP: data.chatAIOptions.topP ?? undefined,
killedBy: RagDto validate() — successful construction should return a RagDto instance with all optional fields present
statusReason: expected undefined to be 4096 // Object.is equality

[Killed] LogicalOperator
src/application/dtos/rag.dto.ts:294:22
         chatTypeId: data.chatAIOptions.chatTypeId,
         prompt: data.chatAIOptions.prompt.trim(),
         maxTokens: data.chatAIOptions.maxTokens ?? undefined,
-        temperature: data.chatAIOptions.temperature ?? undefined,
+        temperature: data.chatAIOptions.temperature && undefined,
         topP: data.chatAIOptions.topP ?? undefined,
         frequencyPenalty: data.chatAIOptions.frequencyPenalty ?? undefined,
killedBy: RagDto validate() — successful construction should return a RagDto instance with all optional fields present
statusReason: expected undefined to be 0.7 // Object.is equality

[Killed] LogicalOperator
src/application/dtos/rag.dto.ts:295:15
         prompt: data.chatAIOptions.prompt.trim(),
         maxTokens: data.chatAIOptions.maxTokens ?? undefined,
         temperature: data.chatAIOptions.temperature ?? undefined,
-        topP: data.chatAIOptions.topP ?? undefined,
+        topP: data.chatAIOptions.topP && undefined,
         frequencyPenalty: data.chatAIOptions.frequencyPenalty ?? undefined,
         presencePenalty: data.chatAIOptions.presencePenalty ?? undefined,
killedBy: RagDto validate() — successful construction should return a RagDto instance with all optional fields present
statusReason: expected undefined to be 0.9 // Object.is equality

[Killed] LogicalOperator
src/application/dtos/rag.dto.ts:296:27
         maxTokens: data.chatAIOptions.maxTokens ?? undefined,
         temperature: data.chatAIOptions.temperature ?? undefined,
         topP: data.chatAIOptions.topP ?? undefined,
-        frequencyPenalty: data.chatAIOptions.frequencyPenalty ?? undefined,
+        frequencyPenalty: data.chatAIOptions.frequencyPenalty && undefined,
         presencePenalty: data.chatAIOptions.presencePenalty ?? undefined,
         stopSequences: data.chatAIOptions.stopSequences ?? undefined,
killedBy: RagDto validate() — successful construction should return a RagDto instance with all optional fields present
statusReason: expected undefined to be 0.1 // Object.is equality

[Killed] LogicalOperator
src/application/dtos/rag.dto.ts:297:26
         temperature: data.chatAIOptions.temperature ?? undefined,
         topP: data.chatAIOptions.topP ?? undefined,
         frequencyPenalty: data.chatAIOptions.frequencyPenalty ?? undefined,
-        presencePenalty: data.chatAIOptions.presencePenalty ?? undefined,
+        presencePenalty: data.chatAIOptions.presencePenalty && undefined,
         stopSequences: data.chatAIOptions.stopSequences ?? undefined,
         maxRetries: data.chatAIOptions.maxRetries ?? undefined,
killedBy: RagDto validate() — successful construction should return a RagDto instance with all optional fields present
statusReason: expected undefined to be 0.2 // Object.is equality

[Killed] LogicalOperator
src/application/dtos/rag.dto.ts:298:24
         topP: data.chatAIOptions.topP ?? undefined,
         frequencyPenalty: data.chatAIOptions.frequencyPenalty ?? undefined,
         presencePenalty: data.chatAIOptions.presencePenalty ?? undefined,
-        stopSequences: data.chatAIOptions.stopSequences ?? undefined,
+        stopSequences: data.chatAIOptions.stopSequences && undefined,
         maxRetries: data.chatAIOptions.maxRetries ?? undefined,
       }
killedBy: RagDto validate() — chatAIOptions validation should accept an empty stopSequences array
statusReason: expected undefined to deeply equal []
