[Killed] LogicalOperator
src/application/dtos/rag.dto.ts:299:21
         frequencyPenalty: data.chatAIOptions.frequencyPenalty ?? undefined,
         presencePenalty: data.chatAIOptions.presencePenalty ?? undefined,
         stopSequences: data.chatAIOptions.stopSequences ?? undefined,
-        maxRetries: data.chatAIOptions.maxRetries ?? undefined,
+        maxRetries: data.chatAIOptions.maxRetries && undefined,
       }
     )
killedBy: RagDto validate() — successful construction should return a RagDto instance with all optional fields present
statusReason: expected undefined to be 3 // Object.is equality
