[Killed] LogicalOperator
src/application/dtos/post-chat.dto.ts:216:9
    * ```
    */
   static validate(data: components['schemas']['AIRequest']): PostChatDto {
-    if (!isDefined(data) || !isObject(data)) {
+    if (!isDefined(data) && !isObject(data)) {
       throw new TypeException('Data must be a valid object')
     }
killedBy: PostChatDto validate() — data type guard should throw TypeException when data is a string
statusReason: expected error to be instance of TypeException

[Killed] BooleanLiteral
src/application/dtos/post-chat.dto.ts:216:29
    * ```
    */
   static validate(data: components['schemas']['AIRequest']): PostChatDto {
-    if (!isDefined(data) || !isObject(data)) {
+    if (!isDefined(data) || isObject(data)) {
       throw new TypeException('Data must be a valid object')
     }
killedBy: AIController chat() validation should return 400 if request body is missing required fields
statusReason: expected "vi.fn()" to be called with arguments: [ { success: false, …(2) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] StringLiteral
src/application/dtos/post-chat.dto.ts:217:31
    */
   static validate(data: components['schemas']['AIRequest']): PostChatDto {
     if (!isDefined(data) || !isObject(data)) {
-      throw new TypeException('Data must be a valid object')
+      throw new TypeException("")
     }
 
killedBy: PostChatDto validate() — data type guard should throw TypeException when data is null
statusReason: expected [Function] to throw error including 'Data must be a valid object' but got ''

[Killed] ConditionalExpression
src/application/dtos/post-chat.dto.ts:222:48
 
     const d = data as Record<string, unknown>
 
-    if (!isDefined(d.id) || !isString(d.id) || d.id === '') {
+    if (!isDefined(d.id) || !isString(d.id) || false) {
       throw new ValidationException('id is required and must be a non-empty string')
     }
killedBy: PostChatDto validate() — id field should throw ValidationException when id is an empty string
statusReason: expected [Function] to throw error including 'id is required and must be a non-empt…' but got 'Invalid id format'

[Killed] EqualityOperator
src/application/dtos/post-chat.dto.ts:222:48
 
     const d = data as Record<string, unknown>
 
-    if (!isDefined(d.id) || !isString(d.id) || d.id === '') {
+    if (!isDefined(d.id) || !isString(d.id) || d.id !== '') {
       throw new ValidationException('id is required and must be a non-empty string')
     }
killedBy: PostChatDto validate() — id field should throw ValidationException when id is an empty string
statusReason: expected [Function] to throw error including 'id is required and must be a non-empt…' but got 'Invalid id format'

[Killed] EqualityOperator
src/application/dtos/post-chat.dto.ts:233:58
       throw new ValidationException('Invalid id format')
     }
 
-    if (!isDefined(d.trigger) || !isString(d.trigger) || d.trigger === '') {
+    if (!isDefined(d.trigger) || !isString(d.trigger) || d.trigger !== '') {
       throw new ValidationException('trigger is required and must be a non-empty string')
     }
killedBy: AIController chat() validation should return 400 if messages array is missing
statusReason: expected "vi.fn()" to be called with arguments: [ { success: false, …(2) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] BooleanLiteral
src/application/dtos/post-chat.dto.ts:233:9
       throw new ValidationException('Invalid id format')
     }
 
-    if (!isDefined(d.trigger) || !isString(d.trigger) || d.trigger === '') {
+    if (isDefined(d.trigger) || !isString(d.trigger) || d.trigger === '') {
       throw new ValidationException('trigger is required and must be a non-empty string')
     }
killedBy: PostChatDto validate() — id field should accept a valid UUIDv7 id
statusReason: expected [Function] to not throw an error but 'ValidationException: trigger is requi…' was thrown

[Killed] LogicalOperator
src/application/dtos/post-chat.dto.ts:237:9
       throw new ValidationException('trigger is required and must be a non-empty string')
     }
 
-    if (!isDefined(d.messages) || !isArray(d.messages)) {
+    if (!isDefined(d.messages) && !isArray(d.messages)) {
       throw new ValidationException('messages is required and must be an array')
     }
killedBy: PostChatDto validate() — messages field should throw ValidationException when messages is not an array
statusReason: expected error to be instance of ValidationException

[Killed] ConditionalExpression
src/application/dtos/post-chat.dto.ts:237:9
       throw new ValidationException('trigger is required and must be a non-empty string')
     }
 
-    if (!isDefined(d.messages) || !isArray(d.messages)) {
+    if (false) {
       throw new ValidationException('messages is required and must be an array')
     }
killedBy: AIController chat() validation should return 400 if messages array is missing
statusReason: expected "vi.fn()" to be called with arguments: [ { success: false, …(2) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] EqualityOperator
src/application/dtos/post-chat.dto.ts:244:66
     const validatedMessages = PostChatDto.validateMessages(d.messages as unknown[])
 
     const chatTypeParam =
-      isDefined(d.chatTypeParam) && isString(d.chatTypeParam) && d.chatTypeParam.trim() !== ''
+      isDefined(d.chatTypeParam) && isString(d.chatTypeParam) && d.chatTypeParam.trim() === ''
         ? d.chatTypeParam.trim()
         : undefined
killedBy: PostChatDto validate() — id field should accept a valid UUIDv7 id
statusReason: expected [Function] to not throw an error but 'ValidationException: At least one of …' was thrown

[Survived] ConditionalExpression
src/application/dtos/post-chat.dto.ts:244:66
     const validatedMessages = PostChatDto.validateMessages(d.messages as unknown[])
 
     const chatTypeParam =
-      isDefined(d.chatTypeParam) && isString(d.chatTypeParam) && d.chatTypeParam.trim() !== ''
+      isDefined(d.chatTypeParam) && isString(d.chatTypeParam) && true
         ? d.chatTypeParam.trim()
         : undefined

[Survived] MethodExpression
src/application/dtos/post-chat.dto.ts:245:11
 
     const chatTypeParam =
       isDefined(d.chatTypeParam) && isString(d.chatTypeParam) && d.chatTypeParam.trim() !== ''
-        ? d.chatTypeParam.trim()
+        ? d.chatTypeParam
         : undefined
 

[Killed] EqualityOperator
src/application/dtos/post-chat.dto.ts:249:60
         : undefined
 
     const chatTypeId =
-      isDefined(d.chatTypeId) && isString(d.chatTypeId) && d.chatTypeId.trim() !== ''
+      isDefined(d.chatTypeId) && isString(d.chatTypeId) && d.chatTypeId.trim() === ''
         ? d.chatTypeId.trim()
         : undefined
killedBy: AIController chat() validation should return 400 with "Invalid request body" if validateUIMessages throws an error
statusReason: expected "vi.fn()" to be called with arguments: [ { success: false, …(2) } ]

Received:

  1st vi.fn() call:

  [
    {

[Survived] ConditionalExpression
src/application/dtos/post-chat.dto.ts:249:60
         : undefined
 
     const chatTypeId =
-      isDefined(d.chatTypeId) && isString(d.chatTypeId) && d.chatTypeId.trim() !== ''
+      isDefined(d.chatTypeId) && isString(d.chatTypeId) && true
         ? d.chatTypeId.trim()
         : undefined

[Survived] MethodExpression
src/application/dtos/post-chat.dto.ts:250:11
 
     const chatTypeId =
       isDefined(d.chatTypeId) && isString(d.chatTypeId) && d.chatTypeId.trim() !== ''
-        ? d.chatTypeId.trim()
+        ? d.chatTypeId
         : undefined
 

[Killed] ConditionalExpression
src/application/dtos/post-chat.dto.ts:253:9
         ? d.chatTypeId.trim()
         : undefined
 
-    if (!chatTypeParam && !chatTypeId) {
+    if (false) {
       throw new ValidationException('At least one of chatTypeParam or chatTypeId must be provided')
     }
killedBy: AIController chat() validation should return 400 if neither chatTypeId nor chatTypeParam is provided
statusReason: expected "vi.fn()" to be called with arguments: [ { success: false, …(2) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] LogicalOperator
src/application/dtos/post-chat.dto.ts:253:9
         ? d.chatTypeId.trim()
         : undefined
 
-    if (!chatTypeParam && !chatTypeId) {
+    if (!chatTypeParam || !chatTypeId) {
       throw new ValidationException('At least one of chatTypeParam or chatTypeId must be provided')
     }
killedBy: AIController chat() validation should return 400 with "Invalid request body" if validateUIMessages throws an error
statusReason: expected "vi.fn()" to be called with arguments: [ { success: false, …(2) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] LogicalOperator
src/application/dtos/post-chat.dto.ts:268:38
     const lastUserEntry = validatedMessages.reduceRight<{
       msg: PostChatMessage
       index: number
-    } | null>((found, msg, index) => found ?? (msg.role === 'user' ? { msg, index } : null), null)
+    } | null>((found, msg, index) => found && (msg.role === 'user' ? {
+  msg,
+  index
+} : null), null)
 
     if (lastUserEntry !== null) {
killedBy: PostChatDto validate() — text part length limit should throw ValidationException when the last user text part exceeds 8000 characters
statusReason: expected function to throw an error, but it didn't

[Killed] EqualityOperator
src/application/dtos/post-chat.dto.ts:268:48
     const lastUserEntry = validatedMessages.reduceRight<{
       msg: PostChatMessage
       index: number
-    } | null>((found, msg, index) => found ?? (msg.role === 'user' ? { msg, index } : null), null)
+    } | null>((found, msg, index) => found ?? (msg.role !== 'user' ? { msg, index } : null), null)
 
     if (lastUserEntry !== null) {
killedBy: PostChatDto validate() — text part length limit should throw ValidationException when the last user text part exceeds 8000 characters
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
src/application/dtos/post-chat.dto.ts:270:33
       index: number
     } | null>((found, msg, index) => found ?? (msg.role === 'user' ? { msg, index } : null), null)
 
-    if (lastUserEntry !== null) {
-      for (const part of lastUserEntry.msg.parts) {
-        if (part.type !== 'text' || !isString(part.text) || part.text === '') continue
-
-        if (part.text.length > MAX_USER_TEXT_PART_LENGTH) {
-          throw new ValidationException(
-            'Text part exceeds maximum length of ' + MAX_USER_TEXT_PART_LENGTH + ' characters'
-          )
-        }
-
-        const assessment = guard.assess(part.text)
-        if (assessment.decision !== 'allow') {
-          promptRiskAssessments.push({
-            ...assessment,
-            messageIndex: lastUserEntry.index,
-            messageId: lastUserEntry.msg.id,
-          })
-        }
-      }
-    }
+    if (lastUserEntry !== null) {}
 
     return new PostChatDto(
killedBy: PostChatDto validate() — text part length limit should throw ValidationException when the last user text part exceeds 8000 characters
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
src/application/dtos/post-chat.dto.ts:271:51
     } | null>((found, msg, index) => found ?? (msg.role === 'user' ? { msg, index } : null), null)
 
     if (lastUserEntry !== null) {
-      for (const part of lastUserEntry.msg.parts) {
-        if (part.type !== 'text' || !isString(part.text) || part.text === '') continue
-
-        if (part.text.length > MAX_USER_TEXT_PART_LENGTH) {
-          throw new ValidationException(
-            'Text part exceeds maximum length of ' + MAX_USER_TEXT_PART_LENGTH + ' characters'
-          )
-        }
-
-        const assessment = guard.assess(part.text)
-        if (assessment.decision !== 'allow') {
-          promptRiskAssessments.push({
-            ...assessment,
-            messageIndex: lastUserEntry.index,
-            messageId: lastUserEntry.msg.id,
-          })
-        }
-      }
+      for (const part of lastUserEntry.msg.parts) {}
     }
 
killedBy: PostChatDto validate() — text part length limit should throw ValidationException when the last user text part exceeds 8000 characters
statusReason: expected function to throw an error, but it didn't

[Killed] EqualityOperator
src/application/dtos/post-chat.dto.ts:272:13
 
     if (lastUserEntry !== null) {
       for (const part of lastUserEntry.msg.parts) {
-        if (part.type !== 'text' || !isString(part.text) || part.text === '') continue
+        if (part.type === 'text' || !isString(part.text) || part.text === '') continue
 
         if (part.text.length > MAX_USER_TEXT_PART_LENGTH) {
killedBy: PostChatDto validate() — text part length limit should throw ValidationException when the last user text part exceeds 8000 characters
statusReason: expected function to throw an error, but it didn't

[Killed] EqualityOperator
src/application/dtos/post-chat.dto.ts:272:61
 
     if (lastUserEntry !== null) {
       for (const part of lastUserEntry.msg.parts) {
-        if (part.type !== 'text' || !isString(part.text) || part.text === '') continue
+        if (part.type !== 'text' || !isString(part.text) || part.text !== '') continue
 
         if (part.text.length > MAX_USER_TEXT_PART_LENGTH) {
killedBy: PostChatDto validate() — text part length limit should throw ValidationException when the last user text part exceeds 8000 characters
statusReason: expected function to throw an error, but it didn't

[Killed] EqualityOperator
src/application/dtos/post-chat.dto.ts:274:13
       for (const part of lastUserEntry.msg.parts) {
         if (part.type !== 'text' || !isString(part.text) || part.text === '') continue
 
-        if (part.text.length > MAX_USER_TEXT_PART_LENGTH) {
+        if (part.text.length <= MAX_USER_TEXT_PART_LENGTH) {
           throw new ValidationException(
             'Text part exceeds maximum length of ' + MAX_USER_TEXT_PART_LENGTH + ' characters'
killedBy: AIController chat() validation should return 400 with "Invalid request body" if validateUIMessages throws an error
statusReason: expected "vi.fn()" to be called with arguments: [ { success: false, …(2) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] EqualityOperator
src/application/dtos/post-chat.dto.ts:274:13
       for (const part of lastUserEntry.msg.parts) {
         if (part.type !== 'text' || !isString(part.text) || part.text === '') continue
 
-        if (part.text.length > MAX_USER_TEXT_PART_LENGTH) {
+        if (part.text.length >= MAX_USER_TEXT_PART_LENGTH) {
           throw new ValidationException(
             'Text part exceeds maximum length of ' + MAX_USER_TEXT_PART_LENGTH + ' characters'
killedBy: PostChatDto validate() — text part length limit should accept exactly 8000 characters without throwing
statusReason: expected [Function] to not throw an error but 'ValidationException: Text part exceed…' was thrown

[Killed] StringLiteral
src/application/dtos/post-chat.dto.ts:276:13
 
         if (part.text.length > MAX_USER_TEXT_PART_LENGTH) {
           throw new ValidationException(
-            'Text part exceeds maximum length of ' + MAX_USER_TEXT_PART_LENGTH + ' characters'
+            "" + MAX_USER_TEXT_PART_LENGTH + ' characters'
           )
         }
killedBy: PostChatDto validate() — text part length limit should throw ValidationException when the last user text part exceeds 8000 characters
statusReason: expected [Function] to throw error including 'Text part exceeds maximum length of 8…' but got '8000 characters'

[Killed] StringLiteral
src/application/dtos/post-chat.dto.ts:276:82
 
         if (part.text.length > MAX_USER_TEXT_PART_LENGTH) {
           throw new ValidationException(
-            'Text part exceeds maximum length of ' + MAX_USER_TEXT_PART_LENGTH + ' characters'
+            'Text part exceeds maximum length of ' + MAX_USER_TEXT_PART_LENGTH + ""
           )
         }
killedBy: PostChatDto validate() — text part length limit should throw ValidationException when the last user text part exceeds 8000 characters
statusReason: expected [Function] to throw error including 'Text part exceeds maximum length of 8…' but got 'Text part exceeds maximum length of 8…'

[Killed] EqualityOperator
src/application/dtos/post-chat.dto.ts:281:13
         }
 
         const assessment = guard.assess(part.text)
-        if (assessment.decision !== 'allow') {
+        if (assessment.decision === 'allow') {
           promptRiskAssessments.push({
             ...assessment,
killedBy: PostChatDto validate() — returned DTO shape should return empty promptRiskAssessments when all messages are safe
statusReason: expected [ { score: +0, …(5) } ] to deeply equal []

[Killed] ConditionalExpression
src/application/dtos/post-chat.dto.ts:281:13
         }
 
         const assessment = guard.assess(part.text)
-        if (assessment.decision !== 'allow') {
+        if (true) {
           promptRiskAssessments.push({
             ...assessment,
killedBy: PostChatDto validate() — returned DTO shape should return empty promptRiskAssessments when all messages are safe
statusReason: expected [ { score: +0, …(5) } ] to deeply equal []

[Killed] BooleanLiteral
src/application/dtos/post-chat.dto.ts:312:11
    */
   private static validateMessages(messages: unknown[]): PostChatMessage[] {
     return messages.map((msg, i) => {
-      if (!isDefined(msg) || !isObject(msg)) {
+      if (isDefined(msg) || !isObject(msg)) {
         throw new ValidationException(`messages[${i}] must be an object`)
       }
killedBy: PostChatDto validate() — messages field should accept a valid array of messages
statusReason: messages[0] must be an object

[Killed] LogicalOperator
src/application/dtos/post-chat.dto.ts:312:11
    */
   private static validateMessages(messages: unknown[]): PostChatMessage[] {
     return messages.map((msg, i) => {
-      if (!isDefined(msg) || !isObject(msg)) {
+      if (!isDefined(msg) && !isObject(msg)) {
         throw new ValidationException(`messages[${i}] must be an object`)
       }
killedBy: PostChatDto validate() — message object validation should throw ValidationException when a message is not an object
statusReason: expected [Function] to throw error including 'messages[0] must be an object' but got 'messages[0].id must be a non-empty st…'

[Killed] ConditionalExpression
src/application/dtos/post-chat.dto.ts:318:50
 
       const m = msg as Record<string, unknown>
 
-      if (!isDefined(m.id) || !isString(m.id) || m.id === '') {
+      if (!isDefined(m.id) || !isString(m.id) || false) {
         throw new ValidationException(`messages[${i}].id must be a non-empty string`)
       }
killedBy: PostChatDto validate() — message object validation should throw ValidationException when message id is empty
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/application/dtos/post-chat.dto.ts:318:11
 
       const m = msg as Record<string, unknown>
 
-      if (!isDefined(m.id) || !isString(m.id) || m.id === '') {
+      if (isDefined(m.id) || !isString(m.id) || m.id === '') {
         throw new ValidationException(`messages[${i}].id must be a non-empty string`)
       }
killedBy: PostChatDto validate() — messages field should accept a valid array of messages
statusReason: messages[0].id must be a non-empty string

[Killed] BooleanLiteral
src/application/dtos/post-chat.dto.ts:323:9
       }
 
       if (
-        !isDefined(m.role) ||
+        isDefined(m.role) ||
         !isString(m.role) ||
         (m.role !== 'user' && m.role !== 'assistant')
killedBy: PostChatDto validate() — messages field should accept a valid array of messages
statusReason: messages[0].role must be "user" or "assistant"

[Killed] LogicalOperator
src/application/dtos/post-chat.dto.ts:323:9
       }
 
       if (
-        !isDefined(m.role) ||
-        !isString(m.role) ||
-        (m.role !== 'user' && m.role !== 'assistant')
+        (!isDefined(m.role) || !isString(m.role)) && m.role !== 'user' && m.role !== 'assistant'
       ) {
         throw new ValidationException(`messages[${i}].role must be "user" or "assistant"`)
killedBy: PostChatDto validate() — message object validation should throw ValidationException when message role is invalid
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/application/dtos/post-chat.dto.ts:324:9
 
       if (
         !isDefined(m.role) ||
-        !isString(m.role) ||
+        isString(m.role) ||
         (m.role !== 'user' && m.role !== 'assistant')
       ) {
killedBy: PostChatDto validate() — messages field should accept a valid array of messages
statusReason: messages[0].role must be "user" or "assistant"

[Killed] ConditionalExpression
src/application/dtos/post-chat.dto.ts:325:10
       if (
         !isDefined(m.role) ||
         !isString(m.role) ||
-        (m.role !== 'user' && m.role !== 'assistant')
+        (true && m.role !== 'assistant')
       ) {
         throw new ValidationException(`messages[${i}].role must be "user" or "assistant"`)
killedBy: AIController chat() validation should return 400 with "Invalid request body" if validateUIMessages throws an error
statusReason: expected "vi.fn()" to be called with arguments: [ { success: false, …(2) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] ConditionalExpression
src/application/dtos/post-chat.dto.ts:325:31
       if (
         !isDefined(m.role) ||
         !isString(m.role) ||
-        (m.role !== 'user' && m.role !== 'assistant')
+        (m.role !== 'user' && true)
       ) {
         throw new ValidationException(`messages[${i}].role must be "user" or "assistant"`)
killedBy: PostChatDto validate() — messages field should accept a valid array of messages
statusReason: messages[1].role must be "user" or "assistant"

[Killed] BlockStatement
src/application/dtos/post-chat.dto.ts:326:9
         !isDefined(m.role) ||
         !isString(m.role) ||
         (m.role !== 'user' && m.role !== 'assistant')
-      ) {
-        throw new ValidationException(`messages[${i}].role must be "user" or "assistant"`)
-      }
+      ) {}
 
       if (!isDefined(m.parts) || !isArray(m.parts)) {
killedBy: PostChatDto validate() — message object validation should throw ValidationException when message role is invalid
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/application/dtos/post-chat.dto.ts:327:39
         !isString(m.role) ||
         (m.role !== 'user' && m.role !== 'assistant')
       ) {
-        throw new ValidationException(`messages[${i}].role must be "user" or "assistant"`)
+        throw new ValidationException(``)
       }
 
killedBy: PostChatDto validate() — message object validation should throw ValidationException when message role is invalid
statusReason: expected [Function] to throw error including 'messages[0].role must be "user" or "a…' but got ''

[Killed] ConditionalExpression
src/application/dtos/post-chat.dto.ts:330:11
         throw new ValidationException(`messages[${i}].role must be "user" or "assistant"`)
       }
 
-      if (!isDefined(m.parts) || !isArray(m.parts)) {
+      if (false) {
         throw new ValidationException(`messages[${i}].parts must be an array`)
       }
killedBy: PostChatDto validate() — message object validation should throw ValidationException when message parts is missing
statusReason: expected [Function] to throw error including 'messages[0].parts must be an array' but got 'Cannot read properties of undefined (…'

[Killed] LogicalOperator
src/application/dtos/post-chat.dto.ts:330:11
         throw new ValidationException(`messages[${i}].role must be "user" or "assistant"`)
       }
 
-      if (!isDefined(m.parts) || !isArray(m.parts)) {
+      if (!isDefined(m.parts) && !isArray(m.parts)) {
         throw new ValidationException(`messages[${i}].parts must be an array`)
       }
killedBy: PostChatDto validate() — message object validation should throw ValidationException when message parts is not an array
statusReason: expected [Function] to throw error including 'messages[0].parts must be an array' but got 'parts.map is not a function'

[Killed] StringLiteral
src/application/dtos/post-chat.dto.ts:331:39
       }
 
       if (!isDefined(m.parts) || !isArray(m.parts)) {
-        throw new ValidationException(`messages[${i}].parts must be an array`)
+        throw new ValidationException(``)
       }
 
killedBy: PostChatDto validate() — message object validation should throw ValidationException when message parts is missing
statusReason: expected [Function] to throw error including 'messages[0].parts must be an array' but got ''

[Killed] BooleanLiteral
src/application/dtos/post-chat.dto.ts:353:11
    */
   private static validateParts(parts: unknown[], messageIndex: number): PostChatMessagePart[] {
     return parts.map((part, j) => {
-      if (!isDefined(part) || !isObject(part)) {
+      if (isDefined(part) || !isObject(part)) {
         throw new ValidationException(`messages[${messageIndex}].parts[${j}] must be an object`)
       }
killedBy: PostChatDto validate() — messages field should accept a valid array of messages
statusReason: messages[0].parts[0] must be an object

[Killed] BlockStatement
src/application/dtos/post-chat.dto.ts:353:48
    */
   private static validateParts(parts: unknown[], messageIndex: number): PostChatMessagePart[] {
     return parts.map((part, j) => {
-      if (!isDefined(part) || !isObject(part)) {
-        throw new ValidationException(`messages[${messageIndex}].parts[${j}] must be an object`)
-      }
+      if (!isDefined(part) || !isObject(part)) {}
 
       const p = part as Record<string, unknown>
killedBy: PostChatDto validate() — part object validation should throw ValidationException when a part is not an object
statusReason: expected [Function] to throw error including 'messages[0].parts[0] must be an object' but got 'messages[0].parts[0].type must be a n…'

[Killed] StringLiteral
src/application/dtos/post-chat.dto.ts:354:39
   private static validateParts(parts: unknown[], messageIndex: number): PostChatMessagePart[] {
     return parts.map((part, j) => {
       if (!isDefined(part) || !isObject(part)) {
-        throw new ValidationException(`messages[${messageIndex}].parts[${j}] must be an object`)
+        throw new ValidationException(``)
       }
 
killedBy: PostChatDto validate() — part object validation should throw ValidationException when a part is not an object
statusReason: expected [Function] to throw error including 'messages[0].parts[0] must be an object' but got ''

[Killed] EqualityOperator
src/application/dtos/post-chat.dto.ts:360:54
       const p = part as Record<string, unknown>
 
       // Accept any non-empty string: "text", "step-start", "tool-{toolName}", etc.
-      if (!isDefined(p.type) || !isString(p.type) || p.type === '') {
+      if (!isDefined(p.type) || !isString(p.type) || p.type !== '') {
         throw new ValidationException(
           `messages[${messageIndex}].parts[${j}].type must be a non-empty string`
killedBy: PostChatDto validate() — messages field should accept a valid array of messages
statusReason: messages[0].parts[0].type must be a non-empty string

[Killed] BooleanLiteral
src/application/dtos/post-chat.dto.ts:360:33
       const p = part as Record<string, unknown>
 
       // Accept any non-empty string: "text", "step-start", "tool-{toolName}", etc.
-      if (!isDefined(p.type) || !isString(p.type) || p.type === '') {
+      if (!isDefined(p.type) || isString(p.type) || p.type === '') {
         throw new ValidationException(
           `messages[${messageIndex}].parts[${j}].type must be a non-empty string`
killedBy: AIController chat() validation should return 400 with "Invalid request body" if validateUIMessages throws an error
statusReason: expected "vi.fn()" to be called with arguments: [ { success: false, …(2) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] LogicalOperator
src/application/dtos/post-chat.dto.ts:366:11
         )
       }
 
-      if (isDefined(p.text) && !isString(p.text)) {
+      if (isDefined(p.text) || !isString(p.text)) {
         throw new ValidationException(
           `messages[${messageIndex}].parts[${j}].text must be a string when provided`
killedBy: PostChatDto validate() — messages field should accept a valid array of messages
statusReason: messages[0].parts[0].text must be a string when provided

[Killed] ConditionalExpression
src/application/dtos/post-chat.dto.ts:366:11
         )
       }
 
-      if (isDefined(p.text) && !isString(p.text)) {
+      if (true) {
         throw new ValidationException(
           `messages[${messageIndex}].parts[${j}].text must be a string when provided`
killedBy: PostChatDto validate() — messages field should accept a valid array of messages
statusReason: messages[0].parts[0].text must be a string when provided

[Killed] LogicalOperator
src/application/dtos/post-chat.dto.ts:372:11
         )
       }
 
-      if (isDefined(p.state) && !isString(p.state)) {
+      if (isDefined(p.state) || !isString(p.state)) {
         throw new ValidationException(
           `messages[${messageIndex}].parts[${j}].state must be a string when provided`
killedBy: PostChatDto validate() — messages field should accept a valid array of messages
statusReason: messages[0].parts[0].state must be a string when provided

[Killed] ConditionalExpression
src/application/dtos/post-chat.dto.ts:372:11
         )
       }
 
-      if (isDefined(p.state) && !isString(p.state)) {
+      if (true) {
         throw new ValidationException(
           `messages[${messageIndex}].parts[${j}].state must be a string when provided`
killedBy: PostChatDto validate() — messages field should accept a valid array of messages
statusReason: messages[0].parts[0].state must be a string when provided
