[Killed] StringLiteral
src/application/dtos/post-chat.dto.ts:374:11
 
       if (isDefined(p.state) && !isString(p.state)) {
         throw new ValidationException(
-          `messages[${messageIndex}].parts[${j}].state must be a string when provided`
+          ``
         )
       }
killedBy: PostChatDto validate() — part object validation should throw ValidationException when part state is not a string
statusReason: expected [Function] to throw error including 'messages[0].parts[0].state must be a …' but got ''
