[Killed] ConditionalExpression
src/application/dtos/put-chat-type.dto.ts:84:9
    * }
    */
   static validate(data: components['schemas']['UpdateAIChatTypeRequest']): PutChatTypeDto {
-    if (!isDefined(data) || !isObject(data)) {
+    if (false) {
       throw new TypeException('Invalid data: expected an object')
     }
killedBy: PutChatTypeDto validate() - type validation should throw TypeException when data is undefined
statusReason: expected error to be instance of TypeException

[Killed] LogicalOperator
src/application/dtos/put-chat-type.dto.ts:84:9
    * }
    */
   static validate(data: components['schemas']['UpdateAIChatTypeRequest']): PutChatTypeDto {
-    if (!isDefined(data) || !isObject(data)) {
+    if (!isDefined(data) && !isObject(data)) {
       throw new TypeException('Invalid data: expected an object')
     }
killedBy: AIConfigController updateAIChatDetails() validation failures should return 500 when request body is not an object
statusReason: expected "vi.fn()" to be called with arguments: [ 500 ]

Received:

  1st vi.fn() call:

  [
-   500,

[Killed] ConditionalExpression
src/application/dtos/put-chat-type.dto.ts:91:9
     const { description, id, name, seoFriendlyId } = data
 
     // Validate id (required)
-    if (!isDefined(id)) {
+    if (false) {
       throw new ValidationException('Invalid request body: id is required')
     }
killedBy: AIConfigController updateAIChatDetails() validation failures should return 400 when id is missing
statusReason: expected "vi.fn()" to be called with arguments: [ { success: false, …(1) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] BooleanLiteral
src/application/dtos/put-chat-type.dto.ts:91:9
     const { description, id, name, seoFriendlyId } = data
 
     // Validate id (required)
-    if (!isDefined(id)) {
+    if (isDefined(id)) {
       throw new ValidationException('Invalid request body: id is required')
     }
killedBy: PutChatTypeDto validate() - id validation should accept valid UUID v7 for id
statusReason: Invalid request body: id is required

[Killed] StringLiteral
src/application/dtos/put-chat-type.dto.ts:92:37
 
     // Validate id (required)
     if (!isDefined(id)) {
-      throw new ValidationException('Invalid request body: id is required')
+      throw new ValidationException("")
     }
 
killedBy: PutChatTypeDto validate() - id validation should throw ValidationException when id is missing
statusReason: expected [Function] to throw error including 'Invalid request body: id is required' but got ''

[Killed] ConditionalExpression
src/application/dtos/put-chat-type.dto.ts:95:9
       throw new ValidationException('Invalid request body: id is required')
     }
 
-    if (!isString(id)) {
+    if (false) {
       throw new ValidationException('Invalid id: must be a string')
     }
killedBy: PutChatTypeDto validate() - id validation should throw ValidationException when id is not a string
statusReason: expected [Function] to throw error including 'Invalid id: must be a string' but got 'Invalid id format: incorrect ChatId f…'

[Killed] BooleanLiteral
src/application/dtos/put-chat-type.dto.ts:95:9
       throw new ValidationException('Invalid request body: id is required')
     }
 
-    if (!isString(id)) {
+    if (isString(id)) {
       throw new ValidationException('Invalid id: must be a string')
     }
killedBy: AIConfigController updateAIChatDetails() successful scenarios should update chat type details successfully with all fields
statusReason: expected "vi.fn()" to be called with arguments: [ 204 ]

Number of calls: 0

[Killed] StringLiteral
src/application/dtos/put-chat-type.dto.ts:96:37
     }
 
     if (!isString(id)) {
-      throw new ValidationException('Invalid id: must be a string')
+      throw new ValidationException("")
     }
 
killedBy: PutChatTypeDto validate() - id validation should throw ValidationException when id is not a string
statusReason: expected [Function] to throw error including 'Invalid id: must be a string' but got ''

[Killed] BlockStatement
src/application/dtos/put-chat-type.dto.ts:107:26
     }
 
     // Validate name (optional)
-    if (isDefined(name)) {
-      if (!isString(name)) {
-        throw new ValidationException('Invalid name: must be a string')
-      }
-      if (name.trim().length < 1 || name.trim().length > 200) {
-        throw new ValidationException('Invalid name: must be a string between 1 and 200 characters')
-      }
-    }
+    if (isDefined(name)) {}
 
     // Validate seoFriendlyId (optional)
killedBy: AIConfigController updateAIChatDetails() validation failures should return 400 when name exceeds maximum length
statusReason: expected "vi.fn()" to be called with arguments: [ 400 ]

Received:

  1st vi.fn() call:

  [
-   400,

[Killed] ConditionalExpression
src/application/dtos/put-chat-type.dto.ts:107:9
     }
 
     // Validate name (optional)
-    if (isDefined(name)) {
+    if (true) {
       if (!isString(name)) {
         throw new ValidationException('Invalid name: must be a string')
killedBy: PutChatTypeDto validate() - id validation should accept valid UUID v7 for id
statusReason: Invalid name: must be a string

[Killed] BlockStatement
src/application/dtos/put-chat-type.dto.ts:108:28
 
     // Validate name (optional)
     if (isDefined(name)) {
-      if (!isString(name)) {
-        throw new ValidationException('Invalid name: must be a string')
-      }
+      if (!isString(name)) {}
       if (name.trim().length < 1 || name.trim().length > 200) {
         throw new ValidationException('Invalid name: must be a string between 1 and 200 characters')
killedBy: AIConfigController updateAIChatDetails() validation failures should return 400 when name is not a string
statusReason: expected "vi.fn()" to be called with arguments: [ 400 ]

Received:

  1st vi.fn() call:

  [
-   400,

[Killed] ConditionalExpression
src/application/dtos/put-chat-type.dto.ts:108:11
 
     // Validate name (optional)
     if (isDefined(name)) {
-      if (!isString(name)) {
+      if (false) {
         throw new ValidationException('Invalid name: must be a string')
       }
killedBy: PutChatTypeDto validate() - name validation should throw ValidationException when name is not a string
statusReason: expected error to be instance of ValidationException

[Killed] ConditionalExpression
src/application/dtos/put-chat-type.dto.ts:111:37
       if (!isString(name)) {
         throw new ValidationException('Invalid name: must be a string')
       }
-      if (name.trim().length < 1 || name.trim().length > 200) {
+      if (name.trim().length < 1 || false) {
         throw new ValidationException('Invalid name: must be a string between 1 and 200 characters')
       }
killedBy: AIConfigController updateAIChatDetails() validation failures should return 400 when name exceeds maximum length
statusReason: expected "vi.fn()" to be called with arguments: [ 400 ]

Received:

  1st vi.fn() call:

  [
-   400,

[Killed] EqualityOperator
src/application/dtos/put-chat-type.dto.ts:111:37
       if (!isString(name)) {
         throw new ValidationException('Invalid name: must be a string')
       }
-      if (name.trim().length < 1 || name.trim().length > 200) {
+      if (name.trim().length < 1 || name.trim().length <= 200) {
         throw new ValidationException('Invalid name: must be a string between 1 and 200 characters')
       }
killedBy: PutChatTypeDto validate() - name validation should accept valid name
statusReason: Invalid name: must be a string between 1 and 200 characters

[Killed] StringLiteral
src/application/dtos/put-chat-type.dto.ts:112:39
         throw new ValidationException('Invalid name: must be a string')
       }
       if (name.trim().length < 1 || name.trim().length > 200) {
-        throw new ValidationException('Invalid name: must be a string between 1 and 200 characters')
+        throw new ValidationException("")
       }
     }
killedBy: PutChatTypeDto validate() - name validation should throw ValidationException when name is empty string
statusReason: expected [Function] to throw error including 'Invalid name: must be a string betwee…' but got ''

[Killed] BlockStatement
src/application/dtos/put-chat-type.dto.ts:117:35
     }
 
     // Validate seoFriendlyId (optional)
-    if (isDefined(seoFriendlyId)) {
-      if (!isString(seoFriendlyId)) {
-        throw new ValidationException('Invalid seoFriendlyId: must be a string')
-      }
-      if (seoFriendlyId.trim().length < 1 || seoFriendlyId.trim().length > 200) {
-        throw new ValidationException(
-          'Invalid seoFriendlyId: must be a string between 1 and 200 characters'
-        )
-      }
-      if (!/^[a-z0-9](?:[a-z0-9]|-[a-z0-9])*$/.test(seoFriendlyId)) {
-        throw new ValidationException(
-          'Invalid seoFriendlyId: must contain only lowercase letters, numbers, and hyphens in kebab-case format'
-        )
-      }
-    }
+    if (isDefined(seoFriendlyId)) {}
 
     // Validate description (optional)
killedBy: PutChatTypeDto validate() - seoFriendlyId validation should throw ValidationException when seoFriendlyId is not a string
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
src/application/dtos/put-chat-type.dto.ts:117:9
     }
 
     // Validate seoFriendlyId (optional)
-    if (isDefined(seoFriendlyId)) {
+    if (true) {
       if (!isString(seoFriendlyId)) {
         throw new ValidationException('Invalid seoFriendlyId: must be a string')
killedBy: PutChatTypeDto validate() - id validation should accept valid UUID v7 for id
statusReason: Invalid seoFriendlyId: must be a string

[Killed] ConditionalExpression
src/application/dtos/put-chat-type.dto.ts:118:11
 
     // Validate seoFriendlyId (optional)
     if (isDefined(seoFriendlyId)) {
-      if (!isString(seoFriendlyId)) {
+      if (false) {
         throw new ValidationException('Invalid seoFriendlyId: must be a string')
       }
killedBy: PutChatTypeDto validate() - seoFriendlyId validation should throw ValidationException when seoFriendlyId is not a string
statusReason: expected error to be instance of ValidationException

[Killed] BlockStatement
src/application/dtos/put-chat-type.dto.ts:118:37
 
     // Validate seoFriendlyId (optional)
     if (isDefined(seoFriendlyId)) {
-      if (!isString(seoFriendlyId)) {
-        throw new ValidationException('Invalid seoFriendlyId: must be a string')
-      }
+      if (!isString(seoFriendlyId)) {}
       if (seoFriendlyId.trim().length < 1 || seoFriendlyId.trim().length > 200) {
         throw new ValidationException(
killedBy: PutChatTypeDto validate() - seoFriendlyId validation should throw ValidationException when seoFriendlyId is not a string
statusReason: expected error to be instance of ValidationException

[Killed] ConditionalExpression
src/application/dtos/put-chat-type.dto.ts:121:11
       if (!isString(seoFriendlyId)) {
         throw new ValidationException('Invalid seoFriendlyId: must be a string')
       }
-      if (seoFriendlyId.trim().length < 1 || seoFriendlyId.trim().length > 200) {
+      if (false) {
         throw new ValidationException(
           'Invalid seoFriendlyId: must be a string between 1 and 200 characters'
killedBy: PutChatTypeDto validate() - seoFriendlyId validation should throw ValidationException when seoFriendlyId is empty string
statusReason: expected [Function] to throw error including 'Invalid seoFriendlyId: must be a stri…' but got 'Invalid seoFriendlyId: must contain o…'

[Killed] ConditionalExpression
src/application/dtos/put-chat-type.dto.ts:121:11
       if (!isString(seoFriendlyId)) {
         throw new ValidationException('Invalid seoFriendlyId: must be a string')
       }
-      if (seoFriendlyId.trim().length < 1 || seoFriendlyId.trim().length > 200) {
+      if (false || seoFriendlyId.trim().length > 200) {
         throw new ValidationException(
           'Invalid seoFriendlyId: must be a string between 1 and 200 characters'
killedBy: PutChatTypeDto validate() - seoFriendlyId validation should throw ValidationException when seoFriendlyId is empty string
statusReason: expected [Function] to throw error including 'Invalid seoFriendlyId: must be a stri…' but got 'Invalid seoFriendlyId: must contain o…'

[Killed] ConditionalExpression
src/application/dtos/put-chat-type.dto.ts:126:11
           'Invalid seoFriendlyId: must be a string between 1 and 200 characters'
         )
       }
-      if (!/^[a-z0-9](?:[a-z0-9]|-[a-z0-9])*$/.test(seoFriendlyId)) {
+      if (true) {
         throw new ValidationException(
           'Invalid seoFriendlyId: must contain only lowercase letters, numbers, and hyphens in kebab-case format'
killedBy: PutChatTypeDto validate() - seoFriendlyId validation should accept valid seoFriendlyId
statusReason: Invalid seoFriendlyId: must contain only lowercase letters, numbers, and hyphens in kebab-case format

[Killed] BooleanLiteral
src/application/dtos/put-chat-type.dto.ts:126:11
           'Invalid seoFriendlyId: must be a string between 1 and 200 characters'
         )
       }
-      if (!/^[a-z0-9](?:[a-z0-9]|-[a-z0-9])*$/.test(seoFriendlyId)) {
+      if (/^[a-z0-9](?:[a-z0-9]|-[a-z0-9])*$/.test(seoFriendlyId)) {
         throw new ValidationException(
           'Invalid seoFriendlyId: must contain only lowercase letters, numbers, and hyphens in kebab-case format'
killedBy: AIConfigController updateAIChatDetails() successful scenarios should update chat type details successfully with all fields
statusReason: expected "vi.fn()" to be called with arguments: [ 204 ]

Number of calls: 0

[Killed] StringLiteral
src/application/dtos/put-chat-type.dto.ts:128:11
       }
       if (!/^[a-z0-9](?:[a-z0-9]|-[a-z0-9])*$/.test(seoFriendlyId)) {
         throw new ValidationException(
-          'Invalid seoFriendlyId: must contain only lowercase letters, numbers, and hyphens in kebab-case format'
+          ""
         )
       }
killedBy: PutChatTypeDto validate() - seoFriendlyId validation should throw ValidationException when seoFriendlyId contains uppercase letters
statusReason: expected [Function] to throw error including 'Invalid seoFriendlyId: must contain o…' but got ''

[Killed] BlockStatement
src/application/dtos/put-chat-type.dto.ts:134:33
     }
 
     // Validate description (optional)
-    if (isDefined(description)) {
-      if (!isString(description)) {
-        throw new ValidationException('Invalid description: must be a string')
-      }
-      if (description.trim().length < 1 || description.trim().length > 500) {
-        throw new ValidationException(
-          'Invalid description: must be a string between 1 and 500 characters'
-        )
-      }
-    }
+    if (isDefined(description)) {}
 
     return new PutChatTypeDto(
killedBy: PutChatTypeDto validate() - description validation should throw ValidationException when description is not a string
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
src/application/dtos/put-chat-type.dto.ts:134:9
     }
 
     // Validate description (optional)
-    if (isDefined(description)) {
+    if (true) {
       if (!isString(description)) {
         throw new ValidationException('Invalid description: must be a string')
killedBy: PutChatTypeDto validate() - id validation should accept valid UUID v7 for id
statusReason: Invalid description: must be a string

[Killed] ConditionalExpression
src/application/dtos/put-chat-type.dto.ts:135:11
 
     // Validate description (optional)
     if (isDefined(description)) {
-      if (!isString(description)) {
+      if (false) {
         throw new ValidationException('Invalid description: must be a string')
       }
killedBy: PutChatTypeDto validate() - description validation should throw ValidationException when description is not a string
statusReason: expected error to be instance of ValidationException

[Killed] BlockStatement
src/application/dtos/put-chat-type.dto.ts:135:35
 
     // Validate description (optional)
     if (isDefined(description)) {
-      if (!isString(description)) {
-        throw new ValidationException('Invalid description: must be a string')
-      }
+      if (!isString(description)) {}
       if (description.trim().length < 1 || description.trim().length > 500) {
         throw new ValidationException(
killedBy: PutChatTypeDto validate() - description validation should throw ValidationException when description is not a string
statusReason: expected error to be instance of ValidationException

[Killed] EqualityOperator
src/application/dtos/put-chat-type.dto.ts:138:11
       if (!isString(description)) {
         throw new ValidationException('Invalid description: must be a string')
       }
-      if (description.trim().length < 1 || description.trim().length > 500) {
+      if (description.trim().length >= 1 || description.trim().length > 500) {
         throw new ValidationException(
           'Invalid description: must be a string between 1 and 500 characters'
killedBy: PutChatTypeDto validate() - description validation should accept valid description
statusReason: Invalid description: must be a string between 1 and 500 characters

[Killed] LogicalOperator
src/application/dtos/put-chat-type.dto.ts:138:11
       if (!isString(description)) {
         throw new ValidationException('Invalid description: must be a string')
       }
-      if (description.trim().length < 1 || description.trim().length > 500) {
+      if (description.trim().length < 1 && description.trim().length > 500) {
         throw new ValidationException(
           'Invalid description: must be a string between 1 and 500 characters'
killedBy: PutChatTypeDto validate() - description validation should throw ValidationException when description is empty string
statusReason: expected function to throw an error, but it didn't

[Killed] LogicalOperator
src/application/dtos/put-chat-type.dto.ts:147:7
 
     return new PutChatTypeDto(
       uuidTypeId,
-      name ?? undefined,
+      name && undefined,
       seoFriendlyId ?? undefined,
       description ?? undefined
killedBy: PutChatTypeDto validate() - name validation should accept valid name
statusReason: expected undefined to be 'Chat Type Name' // Object.is equality

[Killed] LogicalOperator
src/application/dtos/put-chat-type.dto.ts:148:7
     return new PutChatTypeDto(
       uuidTypeId,
       name ?? undefined,
-      seoFriendlyId ?? undefined,
+      seoFriendlyId && undefined,
       description ?? undefined
     )
killedBy: PutChatTypeDto validate() - seoFriendlyId validation should accept valid seoFriendlyId
statusReason: expected undefined to be 'chat-type-id' // Object.is equality

[Killed] LogicalOperator
src/application/dtos/put-chat-type.dto.ts:149:7
       uuidTypeId,
       name ?? undefined,
       seoFriendlyId ?? undefined,
-      description ?? undefined
+      description && undefined
     )
   }
killedBy: PutChatTypeDto validate() - description validation should accept valid description
statusReason: expected undefined to be 'This is a chat type description' // Object.is equality
