[Killed] ArrayDeclaration
src/application/services/domain-keyword-mapping.config.ts:43:17
   domain: 'heart-of-darkness',
   rules: [
     {
-      triggers: ['river'],
+      triggers: [],
       keywords: ['thames', 'congo', 'river', 'water'],
     },
killedBy: HEART_OF_DARKNESS_MAPPINGS river rule should have triggers containing river
statusReason: Cannot read properties of undefined (reading 'triggers')

[Killed] StringLiteral
src/application/services/domain-keyword-mapping.config.ts:44:18
   rules: [
     {
       triggers: ['river'],
-      keywords: ['thames', 'congo', 'river', 'water'],
+      keywords: ["", 'congo', 'river', 'water'],
     },
     {
killedBy: HEART_OF_DARKNESS_MAPPINGS river rule should have keywords containing thames
statusReason: expected [ '', 'congo', 'river', 'water' ] to include 'thames'

[Timeout] StringLiteral
src/application/services/domain-keyword-mapping.config.ts:44:46
   rules: [
     {
       triggers: ['river'],
-      keywords: ['thames', 'congo', 'river', 'water'],
+      keywords: ['thames', 'congo', 'river', ""],
     },
     {

[Killed] StringLiteral
src/application/services/domain-keyword-mapping.config.ts:47:30
       keywords: ['thames', 'congo', 'river', 'water'],
     },
     {
-      triggers: ['position', 'hired'],
+      triggers: ['position', ""],
       keywords: ['captain', 'steamboat', 'command', 'skipper', 'appointed'],
     },
killedBy: HEART_OF_DARKNESS_MAPPINGS position/hired rule should have triggers containing hired
statusReason: expected [ 'position', '' ] to include 'hired'

[Killed] StringLiteral
src/application/services/domain-keyword-mapping.config.ts:48:64
     },
     {
       triggers: ['position', 'hired'],
-      keywords: ['captain', 'steamboat', 'command', 'skipper', 'appointed'],
+      keywords: ['captain', 'steamboat', 'command', 'skipper', ""],
     },
     {
killedBy: HEART_OF_DARKNESS_MAPPINGS position/hired rule should have keywords containing appointed
statusReason: expected [ 'captain', 'steamboat', …(3) ] to include 'appointed'

[Killed] ArrayDeclaration
src/application/services/domain-keyword-mapping.config.ts:48:17
     },
     {
       triggers: ['position', 'hired'],
-      keywords: ['captain', 'steamboat', 'command', 'skipper', 'appointed'],
+      keywords: [],
     },
     {
killedBy: HEART_OF_DARKNESS_MAPPINGS position/hired rule should have keywords containing captain
statusReason: expected [] to include 'captain'

[Killed] StringLiteral
src/application/services/domain-keyword-mapping.config.ts:52:36
     },
     {
       triggers: ['kurtz'],
-      keywords: ['kurtz', 'ivory', 'station', 'agent'],
+      keywords: ['kurtz', 'ivory', "", 'agent'],
     },
     {
killedBy: HEART_OF_DARKNESS_MAPPINGS kurtz rule should have keywords containing station
statusReason: expected [ 'kurtz', 'ivory', '', 'agent' ] to include 'station'

[Killed] ArrayDeclaration
src/application/services/domain-keyword-mapping.config.ts:56:17
     },
     {
       triggers: ['death', 'words'],
-      keywords: ['horror', 'died', 'death', 'last', 'whispered'],
+      keywords: [],
     },
     {
killedBy: HEART_OF_DARKNESS_MAPPINGS death/words rule should have keywords containing horror
statusReason: expected [] to include 'horror'

[Killed] StringLiteral
src/application/services/domain-keyword-mapping.config.ts:60:49
     },
     {
       triggers: ['attack'],
-      keywords: ['arrows', 'natives', 'spears', 'attack', 'savages'],
+      keywords: ['arrows', 'natives', 'spears', "", 'savages'],
     },
     {
killedBy: HEART_OF_DARKNESS_MAPPINGS attack rule should have keywords containing attack
statusReason: expected [ 'arrows', 'natives', 'spears', …(2) ] to include 'attack'

[Killed] ArrayDeclaration
src/application/services/domain-keyword-mapping.config.ts:60:17
     },
     {
       triggers: ['attack'],
-      keywords: ['arrows', 'natives', 'spears', 'attack', 'savages'],
+      keywords: [],
     },
     {
killedBy: HEART_OF_DARKNESS_MAPPINGS attack rule should have keywords containing arrows
statusReason: expected [] to include 'arrows'

[Killed] StringLiteral
src/application/services/domain-keyword-mapping.config.ts:63:28
       keywords: ['arrows', 'natives', 'spears', 'attack', 'savages'],
     },
     {
-      triggers: ['repair', 'steamboat'],
+      triggers: ['repair', ""],
       keywords: ['rivets', 'repair', 'boiler', 'steam', 'wreck'],
     },
killedBy: HEART_OF_DARKNESS_MAPPINGS repair/steamboat rule should have triggers containing steamboat
statusReason: expected [ 'repair', '' ] to include 'steamboat'

[Killed] StringLiteral
src/application/services/domain-keyword-mapping.config.ts:63:18
       keywords: ['arrows', 'natives', 'spears', 'attack', 'savages'],
     },
     {
-      triggers: ['repair', 'steamboat'],
+      triggers: ["", 'steamboat'],
       keywords: ['rivets', 'repair', 'boiler', 'steam', 'wreck'],
     },
killedBy: HEART_OF_DARKNESS_MAPPINGS repair/steamboat rule should have triggers containing repair
statusReason: Cannot read properties of undefined (reading 'triggers')

[Killed] StringLiteral
src/application/services/domain-keyword-mapping.config.ts:64:48
     },
     {
       triggers: ['repair', 'steamboat'],
-      keywords: ['rivets', 'repair', 'boiler', 'steam', 'wreck'],
+      keywords: ['rivets', 'repair', 'boiler', "", 'wreck'],
     },
     {
killedBy: HEART_OF_DARKNESS_MAPPINGS repair/steamboat rule should have keywords containing steam
statusReason: expected [ 'rivets', 'repair', 'boiler', …(2) ] to include 'steam'

[Killed] StringLiteral
src/application/services/domain-keyword-mapping.config.ts:64:57
     },
     {
       triggers: ['repair', 'steamboat'],
-      keywords: ['rivets', 'repair', 'boiler', 'steam', 'wreck'],
+      keywords: ['rivets', 'repair', 'boiler', 'steam', ""],
     },
     {
killedBy: HEART_OF_DARKNESS_MAPPINGS repair/steamboat rule should have keywords containing wreck
statusReason: expected [ 'rivets', 'repair', 'boiler', …(2) ] to include 'wreck'

[Killed] ArrayDeclaration
src/application/services/domain-keyword-mapping.config.ts:68:17
     },
     {
       triggers: ['poles', 'station'],
-      keywords: ['heads', 'skulls', 'poles', 'ornamental'],
+      keywords: [],
     },
   ],
killedBy: HEART_OF_DARKNESS_MAPPINGS poles/station rule should have keywords containing heads
statusReason: expected [] to include 'heads'
