[Survived] BlockStatement
src/application/use-cases/get-chat-ai-options.use-case.ts:92:11
     try {
       const result = await this.aiChatOptions.getChatOptionsByChatTypeId(chatTypeId)
 
-      try {
-        await this.auditLog.log({
-          userId: auditContext.userId,
-          entityType: EntityType.AI_OPTIONS,
-          entityId: chatTypeId,
-          action: AuditAction.FETCH,
-          changes: { reason: 'chat_options_retrieved_successfully_for_internal' },
-          ipAddress: auditContext.ipAddress,
-          userAgent: auditContext.userAgent ?? undefined,
-        })
-      } catch (error) {
+      try {} catch (error) {
         this.logger.error('Error logging audit for chat retrieval', error as Error, {
           event: 'chat_options.audit.failed',

[Survived] ObjectLiteral
src/application/use-cases/get-chat-ai-options.use-case.ts:98:20
           entityType: EntityType.AI_OPTIONS,
           entityId: chatTypeId,
           action: AuditAction.FETCH,
-          changes: { reason: 'chat_options_retrieved_successfully_for_internal' },
+          changes: {},
           ipAddress: auditContext.ipAddress,
           userAgent: auditContext.userAgent ?? undefined,

[NoCoverage] BlockStatement
src/application/use-cases/get-chat-ai-options.use-case.ts:102:23
           ipAddress: auditContext.ipAddress,
           userAgent: auditContext.userAgent ?? undefined,
         })
-      } catch (error) {
-        this.logger.error('Error logging audit for chat retrieval', error as Error, {
-          event: 'chat_options.audit.failed',
-          userId: auditContext.userId,
-        })
-      }
+      } catch (error) {}
       return result ?? null
     } catch (error) {

[Killed] LogicalOperator
src/application/use-cases/get-chat-ai-options.use-case.ts:108:14
           userId: auditContext.userId,
         })
       }
-      return result ?? null
+      return result && null
     } catch (error) {
       this.logger.error('Error in GetChatAiOptionsUseCase.execute', error as Error, {
killedBy: GetChatAiOptionsUseCase execute() - successful scenarios should fetch and return chat AI options when found
statusReason: expected null to deeply equal { Object (prompt) }

[Killed] ObjectLiteral
src/application/use-cases/get-chat-ai-options.use-case.ts:110:85
       }
       return result ?? null
     } catch (error) {
-      this.logger.error('Error in GetChatAiOptionsUseCase.execute', error as Error, {
-        event: 'chat_options.fetch.failed',
-        chatTypeId,
-      })
+      this.logger.error('Error in GetChatAiOptionsUseCase.execute', error as Error, {})
       await this.auditLog.log({
         userId: auditContext.userId,
killedBy: GetChatAiOptionsUseCase execute() - error handling should log error and return null when repository throws error
statusReason: expected "vi.fn()" to be called with arguments: [ …(3) ]

Received:

  1st vi.fn() call:

  [
    "Error in GetChatAiOptionsUseCase.execute",
