[NoCoverage] BlockStatement
infrastructure/ai/middleware/cache.middleware.ts:32:35
  */
 function isRedisConfigured(): boolean {
   // Return cached result if already computed
-  if (isConfiguredCache !== null) {
-    return isConfiguredCache
-  }
+  if (isConfiguredCache !== null) {}
 
   cachedRedisUrl = obscured.value(EnvConfig.UPSTASH_REDIS_REST_URL)

[NoCoverage] LogicalOperator
infrastructure/ai/middleware/cache.middleware.ts:41:5
 
   // Check if credentials exist and are not obscured placeholder values
   isConfiguredCache =
-    !!cachedRedisUrl &&
-    !!cachedRedisToken &&
-    cachedRedisUrl !== '[OBSCURED]' &&
+    !!cachedRedisUrl && !!cachedRedisToken || cachedRedisUrl !== '[OBSCURED]' &&
     cachedRedisToken !== '[OBSCURED]' &&
     cachedRedisUrl !== 'undefined' &&

[NoCoverage] BooleanLiteral
infrastructure/ai/middleware/cache.middleware.ts:41:6
 
   // Check if credentials exist and are not obscured placeholder values
   isConfiguredCache =
-    !!cachedRedisUrl &&
+    !cachedRedisUrl &&
     !!cachedRedisToken &&
     cachedRedisUrl !== '[OBSCURED]' &&

[NoCoverage] BooleanLiteral
infrastructure/ai/middleware/cache.middleware.ts:42:5
   // Check if credentials exist and are not obscured placeholder values
   isConfiguredCache =
     !!cachedRedisUrl &&
-    !!cachedRedisToken &&
+    !cachedRedisToken &&
     cachedRedisUrl !== '[OBSCURED]' &&
     cachedRedisToken !== '[OBSCURED]' &&

[NoCoverage] ConditionalExpression
infrastructure/ai/middleware/cache.middleware.ts:43:5
   isConfiguredCache =
     !!cachedRedisUrl &&
     !!cachedRedisToken &&
-    cachedRedisUrl !== '[OBSCURED]' &&
+    true &&
     cachedRedisToken !== '[OBSCURED]' &&
     cachedRedisUrl !== 'undefined' &&

[NoCoverage] ConditionalExpression
infrastructure/ai/middleware/cache.middleware.ts:44:5
     !!cachedRedisUrl &&
     !!cachedRedisToken &&
     cachedRedisUrl !== '[OBSCURED]' &&
-    cachedRedisToken !== '[OBSCURED]' &&
+    true &&
     cachedRedisUrl !== 'undefined' &&
     cachedRedisToken !== 'undefined'

[NoCoverage] ConditionalExpression
infrastructure/ai/middleware/cache.middleware.ts:45:5
     !!cachedRedisToken &&
     cachedRedisUrl !== '[OBSCURED]' &&
     cachedRedisToken !== '[OBSCURED]' &&
-    cachedRedisUrl !== 'undefined' &&
+    true &&
     cachedRedisToken !== 'undefined'
 

[NoCoverage] EqualityOperator
infrastructure/ai/middleware/cache.middleware.ts:45:5
     !!cachedRedisToken &&
     cachedRedisUrl !== '[OBSCURED]' &&
     cachedRedisToken !== '[OBSCURED]' &&
-    cachedRedisUrl !== 'undefined' &&
+    cachedRedisUrl === 'undefined' &&
     cachedRedisToken !== 'undefined'
 

[NoCoverage] EqualityOperator
infrastructure/ai/middleware/cache.middleware.ts:46:5
     cachedRedisUrl !== '[OBSCURED]' &&
     cachedRedisToken !== '[OBSCURED]' &&
     cachedRedisUrl !== 'undefined' &&
-    cachedRedisToken !== 'undefined'
+    cachedRedisToken === 'undefined'
 
   return isConfiguredCache

[NoCoverage] ConditionalExpression
infrastructure/ai/middleware/cache.middleware.ts:46:5
     cachedRedisUrl !== '[OBSCURED]' &&
     cachedRedisToken !== '[OBSCURED]' &&
     cachedRedisUrl !== 'undefined' &&
-    cachedRedisToken !== 'undefined'
+    true
 
   return isConfiguredCache

[Survived] BooleanLiteral
infrastructure/ai/middleware/cache.middleware.ts:55:31
  * Lazily initialize Redis client only when credentials are configured
  */
 let redisClient: Redis | null = null
-let initializationAttempted = false
+let initializationAttempted = true
 
 function getRedisClient(logger: LoggerPort): Redis | null {

[NoCoverage] ConditionalExpression
infrastructure/ai/middleware/cache.middleware.ts:59:7
 
 function getRedisClient(logger: LoggerPort): Redis | null {
   // Return existing client if already initialized
-  if (redisClient !== null) {
+  if (false) {
     return redisClient
   }

[NoCoverage] BlockStatement
infrastructure/ai/middleware/cache.middleware.ts:59:29
 
 function getRedisClient(logger: LoggerPort): Redis | null {
   // Return existing client if already initialized
-  if (redisClient !== null) {
-    return redisClient
-  }
+  if (redisClient !== null) {}
 
   // Check if Redis is configured

[NoCoverage] BlockStatement
infrastructure/ai/middleware/cache.middleware.ts:64:29
   }
 
   // Check if Redis is configured
-  if (!isRedisConfigured()) {
-    return null
-  }
+  if (!isRedisConfigured()) {}
 
   // Only attempt initialization once to avoid repeated errors

[NoCoverage] ConditionalExpression
infrastructure/ai/middleware/cache.middleware.ts:64:7
   }
 
   // Check if Redis is configured
-  if (!isRedisConfigured()) {
+  if (false) {
     return null
   }

[NoCoverage] ConditionalExpression
infrastructure/ai/middleware/cache.middleware.ts:69:7
   }
 
   // Only attempt initialization once to avoid repeated errors
-  if (initializationAttempted) {
+  if (false) {
     return null
   }

[NoCoverage] BlockStatement
infrastructure/ai/middleware/cache.middleware.ts:69:32
   }
 
   // Only attempt initialization once to avoid repeated errors
-  if (initializationAttempted) {
-    return null
-  }
+  if (initializationAttempted) {}
 
   initializationAttempted = true

[NoCoverage] BooleanLiteral
infrastructure/ai/middleware/cache.middleware.ts:73:29
     return null
   }
 
-  initializationAttempted = true
+  initializationAttempted = false
 
   try {

[NoCoverage] BlockStatement
infrastructure/ai/middleware/cache.middleware.ts:111:29
         try {
           const raw = (await redis.get(cacheKey)) as string | null
 
-          if (raw !== null) {
-            const cached = JSON.parse(
-              (await gunzip(Buffer.from(raw, 'base64'))).toString()
-            ) as Awaited<ReturnType<LanguageModelV3['doGenerate']>>
-
-            logger.debug('wrapGenerate: cache hit — returning cached response', {
-              middleware: 'cache-middleware',
-            })
-            return {
-              ...cached,
-              response: {
-                ...cached.response,
-                timestamp: cached?.response?.timestamp
-                  ? UtcDate.create(cached?.response?.timestamp).toDate()
-                  : undefined,
-              },
-            }
-          }
+          if (raw !== null) {}
 
           logger.debug('wrapGenerate: cache miss — calling model', {

[NoCoverage] OptionalChaining
infrastructure/ai/middleware/cache.middleware.ts:123:28
               ...cached,
               response: {
                 ...cached.response,
-                timestamp: cached?.response?.timestamp
+                timestamp: cached.response?.timestamp
                   ? UtcDate.create(cached?.response?.timestamp).toDate()
                   : undefined,

[NoCoverage] OptionalChaining
infrastructure/ai/middleware/cache.middleware.ts:124:36
               response: {
                 ...cached.response,
                 timestamp: cached?.response?.timestamp
-                  ? UtcDate.create(cached?.response?.timestamp).toDate()
+                  ? UtcDate.create(cached.response?.timestamp).toDate()
                   : undefined,
               },

[NoCoverage] OptionalChaining
infrastructure/ai/middleware/cache.middleware.ts:124:36
               response: {
                 ...cached.response,
                 timestamp: cached?.response?.timestamp
-                  ? UtcDate.create(cached?.response?.timestamp).toDate()
+                  ? UtcDate.create(cached?.response.timestamp).toDate()
                   : undefined,
               },

[NoCoverage] StringLiteral
infrastructure/ai/middleware/cache.middleware.ts:131:25
           }
 
           logger.debug('wrapGenerate: cache miss — calling model', {
-            middleware: 'cache-middleware',
+            middleware: "",
           })
         } catch (error) {

[NoCoverage] BlockStatement
infrastructure/ai/middleware/cache.middleware.ts:133:25
           logger.debug('wrapGenerate: cache miss — calling model', {
             middleware: 'cache-middleware',
           })
-        } catch (error) {
-          logger.error(
-            'Cache read error in wrapGenerate',
-            error instanceof Error ? error : new Error(String(error)),
-            { middleware: 'cache-middleware' }
-          )
-          // Continue without cache - graceful degradation
-        }
+        } catch (error) {}
       }
 

[NoCoverage] BlockStatement
infrastructure/ai/middleware/cache.middleware.ts:146:18
       const result = await doGenerate()
 
       // Try to cache the result if Redis is configured
-      if (redis) {
-        try {
-          const compressed = (await gzip(Buffer.from(JSON.stringify(result)))).toString('base64')
-          await redis.set(cacheKey, compressed, { ex: 3600 })
-          logger.debug('wrapGenerate: response written to cache', {
-            middleware: 'cache-middleware',
-          })
-        } catch (error) {
-          logger.error(
-            'Cache write error in wrapGenerate',
-            error instanceof Error ? error : new Error(String(error)),
-            { middleware: 'cache-middleware' }
-          )
-          // Continue without caching - graceful degradation
-        }
-      }
+      if (redis) {}
 
       return result

[NoCoverage] BlockStatement
infrastructure/ai/middleware/cache.middleware.ts:147:13
 
       // Try to cache the result if Redis is configured
       if (redis) {
-        try {
-          const compressed = (await gzip(Buffer.from(JSON.stringify(result)))).toString('base64')
-          await redis.set(cacheKey, compressed, { ex: 3600 })
-          logger.debug('wrapGenerate: response written to cache', {
-            middleware: 'cache-middleware',
-          })
-        } catch (error) {
+        try {} catch (error) {
           logger.error(
             'Cache write error in wrapGenerate',

[NoCoverage] StringLiteral
infrastructure/ai/middleware/cache.middleware.ts:150:24
         try {
           const compressed = (await gzip(Buffer.from(JSON.stringify(result)))).toString('base64')
           await redis.set(cacheKey, compressed, { ex: 3600 })
-          logger.debug('wrapGenerate: response written to cache', {
+          logger.debug("", {
             middleware: 'cache-middleware',
           })

[NoCoverage] StringLiteral
infrastructure/ai/middleware/cache.middleware.ts:151:25
           const compressed = (await gzip(Buffer.from(JSON.stringify(result)))).toString('base64')
           await redis.set(cacheKey, compressed, { ex: 3600 })
           logger.debug('wrapGenerate: response written to cache', {
-            middleware: 'cache-middleware',
+            middleware: "",
           })
         } catch (error) {

[NoCoverage] BlockStatement
infrastructure/ai/middleware/cache.middleware.ts:153:25
           logger.debug('wrapGenerate: response written to cache', {
             middleware: 'cache-middleware',
           })
-        } catch (error) {
-          logger.error(
-            'Cache write error in wrapGenerate',
-            error instanceof Error ? error : new Error(String(error)),
-            { middleware: 'cache-middleware' }
-          )
-          // Continue without caching - graceful degradation
-        }
+        } catch (error) {}
       }
 

[NoCoverage] StringLiteral
infrastructure/ai/middleware/cache.middleware.ts:157:27
           logger.error(
             'Cache write error in wrapGenerate',
             error instanceof Error ? error : new Error(String(error)),
-            { middleware: 'cache-middleware' }
+            { middleware: "" }
           )
           // Continue without caching - graceful degradation

[NoCoverage] BlockStatement
infrastructure/ai/middleware/cache.middleware.ts:175:29
           const raw = (await redis.get(cacheKey)) as string | null
 
           // If cached, return a simulated ReadableStream that yields the cached result
-          if (raw !== null) {
-            const cached = JSON.parse(
-              (await gunzip(Buffer.from(raw, 'base64'))).toString()
-            ) as LanguageModelV3StreamPart[]
-
-            logger.debug('wrapStream: cache hit — returning simulated stream', {
-              middleware: 'cache-middleware',
-            })
-            // Format the timestamps in the cached response
-            const formattedChunks = cached.map((p) => {
-              if (p.type === 'response-metadata' && p.timestamp) {
-                return { ...p, timestamp: UtcDate.create(p.timestamp).toDate() }
-              } else return p
-            })
-            return {
-              stream: simulateReadableStream({
-                initialDelayInMs: 0,
-                chunkDelayInMs: 10,
-                chunks: formattedChunks,
-              }),
-            }
-          }
+          if (raw !== null) {}
           logger.debug('wrapStream: cache miss — calling model', { middleware: 'cache-middleware' })
         } catch (error) {

[NoCoverage] StringLiteral
infrastructure/ai/middleware/cache.middleware.ts:197:24
               }),
             }
           }
-          logger.debug('wrapStream: cache miss — calling model', { middleware: 'cache-middleware' })
+          logger.debug("", { middleware: 'cache-middleware' })
         } catch (error) {
           logger.error(

[NoCoverage] StringLiteral
infrastructure/ai/middleware/cache.middleware.ts:197:80
               }),
             }
           }
-          logger.debug('wrapStream: cache miss — calling model', { middleware: 'cache-middleware' })
+          logger.debug('wrapStream: cache miss — calling model', { middleware: "" })
         } catch (error) {
           logger.error(

[NoCoverage] BlockStatement
infrastructure/ai/middleware/cache.middleware.ts:198:25
             }
           }
           logger.debug('wrapStream: cache miss — calling model', { middleware: 'cache-middleware' })
-        } catch (error) {
-          logger.error(
-            'Cache read error in wrapStream',
-            error instanceof Error ? error : new Error(String(error)),
-            { middleware: 'cache-middleware' }
-          )
-          // Continue without cache - graceful degradation
-        }
+        } catch (error) {}
       }
 

[NoCoverage] StringLiteral
infrastructure/ai/middleware/cache.middleware.ts:200:13
           logger.debug('wrapStream: cache miss — calling model', { middleware: 'cache-middleware' })
         } catch (error) {
           logger.error(
-            'Cache read error in wrapStream',
+            "",
             error instanceof Error ? error : new Error(String(error)),
             { middleware: 'cache-middleware' }

[NoCoverage] ObjectLiteral
infrastructure/ai/middleware/cache.middleware.ts:202:13
           logger.error(
             'Cache read error in wrapStream',
             error instanceof Error ? error : new Error(String(error)),
-            { middleware: 'cache-middleware' }
+            {}
           )
           // Continue without cache - graceful degradation

[NoCoverage] BlockStatement
infrastructure/ai/middleware/cache.middleware.ts:217:38
         LanguageModelV3StreamPart,
         LanguageModelV3StreamPart
       >({
-        transform(chunk, controller) {
-          fullResponse.push(chunk)
-          controller.enqueue(chunk)
-        },
+        transform(chunk, controller) {},
         async flush() {
           // Try to store the full response in the cache after streaming is complete if Redis is configured

[NoCoverage] BlockStatement
infrastructure/ai/middleware/cache.middleware.ts:221:23
           fullResponse.push(chunk)
           controller.enqueue(chunk)
         },
-        async flush() {
-          // Try to store the full response in the cache after streaming is complete if Redis is configured
-          if (redis) {
-            try {
-              const compressed = (await gzip(Buffer.from(JSON.stringify(fullResponse)))).toString(
-                'base64'
-              )
-              await redis.set(cacheKey, compressed, { ex: 3600 })
-              logger.debug('wrapStream: response written to cache', {
-                middleware: 'cache-middleware',
-              })
-            } catch (error) {
-              logger.error(
-                'Cache write error in wrapStream flush',
-                error instanceof Error ? error : new Error(String(error)),
-                { middleware: 'cache-middleware' }
-              )
-              // Continue without caching - graceful degradation
-            }
-          }
-        },
+        async flush() {},
       })
 

[NoCoverage] BlockStatement
infrastructure/ai/middleware/cache.middleware.ts:223:22
         },
         async flush() {
           // Try to store the full response in the cache after streaming is complete if Redis is configured
-          if (redis) {
-            try {
-              const compressed = (await gzip(Buffer.from(JSON.stringify(fullResponse)))).toString(
-                'base64'
-              )
-              await redis.set(cacheKey, compressed, { ex: 3600 })
-              logger.debug('wrapStream: response written to cache', {
-                middleware: 'cache-middleware',
-              })
-            } catch (error) {
-              logger.error(
-                'Cache write error in wrapStream flush',
-                error instanceof Error ? error : new Error(String(error)),
-                { middleware: 'cache-middleware' }
-              )
-              // Continue without caching - graceful degradation
-            }
-          }
+          if (redis) {}
         },
       })

[NoCoverage] BlockStatement
infrastructure/ai/middleware/cache.middleware.ts:224:17
         async flush() {
           // Try to store the full response in the cache after streaming is complete if Redis is configured
           if (redis) {
-            try {
-              const compressed = (await gzip(Buffer.from(JSON.stringify(fullResponse)))).toString(
-                'base64'
-              )
-              await redis.set(cacheKey, compressed, { ex: 3600 })
-              logger.debug('wrapStream: response written to cache', {
-                middleware: 'cache-middleware',
-              })
-            } catch (error) {
+            try {} catch (error) {
               logger.error(
                 'Cache write error in wrapStream flush',

[NoCoverage] ObjectLiteral
infrastructure/ai/middleware/cache.middleware.ts:228:53
               const compressed = (await gzip(Buffer.from(JSON.stringify(fullResponse)))).toString(
                 'base64'
               )
-              await redis.set(cacheKey, compressed, { ex: 3600 })
+              await redis.set(cacheKey, compressed, {})
               logger.debug('wrapStream: response written to cache', {
                 middleware: 'cache-middleware',

[NoCoverage] ObjectLiteral
infrastructure/ai/middleware/cache.middleware.ts:229:69
                 'base64'
               )
               await redis.set(cacheKey, compressed, { ex: 3600 })
-              logger.debug('wrapStream: response written to cache', {
-                middleware: 'cache-middleware',
-              })
+              logger.debug('wrapStream: response written to cache', {})
             } catch (error) {
               logger.error(

[NoCoverage] StringLiteral
infrastructure/ai/middleware/cache.middleware.ts:230:29
               )
               await redis.set(cacheKey, compressed, { ex: 3600 })
               logger.debug('wrapStream: response written to cache', {
-                middleware: 'cache-middleware',
+                middleware: "",
               })
             } catch (error) {

[NoCoverage] BlockStatement
infrastructure/ai/middleware/cache.middleware.ts:232:29
               logger.debug('wrapStream: response written to cache', {
                 middleware: 'cache-middleware',
               })
-            } catch (error) {
-              logger.error(
-                'Cache write error in wrapStream flush',
-                error instanceof Error ? error : new Error(String(error)),
-                { middleware: 'cache-middleware' }
-              )
-              // Continue without caching - graceful degradation
-            }
+            } catch (error) {}
           }
         },
