[Killed] BlockStatement
src/shared/utils/mask-ip.ts:24:22
 export function maskIpAddress(ip: string): string {
   const version = isIP(ip)
 
-  if (version === 4) {
-    return maskIPv4(ip)
-  }
+  if (version === 4) {}
 
   if (version === 6) {
killedBy: AIController chat() successful chat processing should process valid chat request with existing chat
statusReason: expected "vi.fn()" to be called with arguments: [ Any<String>, …(2) ]

Received:

  1st vi.fn() call:

  [
-   Any<String>,

[Killed] ConditionalExpression
src/shared/utils/mask-ip.ts:24:7
 export function maskIpAddress(ip: string): string {
   const version = isIP(ip)
 
-  if (version === 4) {
+  if (false) {
     return maskIPv4(ip)
   }
killedBy: AIController chat() successful chat processing should process valid chat request with existing chat
statusReason: expected "vi.fn()" to be called with arguments: [ Any<String>, …(2) ]

Received:

  1st vi.fn() call:

  [
-   Any<String>,

[Killed] EqualityOperator
src/shared/utils/mask-ip.ts:28:7
     return maskIPv4(ip)
   }
 
-  if (version === 6) {
+  if (version !== 6) {
     return maskIPv6(ip)
   }
killedBy: UserController deleteUsers() edge cases should handle IPv6 addresses
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Array>, ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   Any<Array>,

[Killed] ConditionalExpression
src/shared/utils/mask-ip.ts:28:7
     return maskIPv4(ip)
   }
 
-  if (version === 6) {
+  if (false) {
     return maskIPv6(ip)
   }
killedBy: UserController deleteUsers() edge cases should handle IPv6 addresses
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Array>, ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   Any<Array>,

[Killed] StringLiteral
src/shared/utils/mask-ip.ts:63:26
  * maskIPv4('192.168.1.100') // Returns '192.168.1.xxx'
  */
 function maskIPv4(ip: string): string {
-  const parts = ip.split('.')
+  const parts = ip.split("")
   return `${parts[0]}.${parts[1]}.${parts[2]}.xxx`
 }
killedBy: AIController chat() successful chat processing should process valid chat request with existing chat
statusReason: expected "vi.fn()" to be called with arguments: [ Any<String>, …(2) ]

Received:

  1st vi.fn() call:

  [
-   Any<String>,

[Killed] StringLiteral
src/shared/utils/mask-ip.ts:82:32
  */
 function maskIPv6(ip: string): string {
   const expanded = expandIPv6(ip)
-  const parts = expanded.split(':')
+  const parts = expanded.split("")
 
   if (parts.length !== 8) {
killedBy: maskIpAddress valid IPv6 addresses should mask IPv6 full address
statusReason: Invalid IP address

[Killed] ConditionalExpression
src/shared/utils/mask-ip.ts:84:7
   const expanded = expandIPv6(ip)
   const parts = expanded.split(':')
 
-  if (parts.length !== 8) {
+  if (true) {
     throw new Error('Invalid IP address')
   }
killedBy: maskIpAddress valid IPv6 addresses should mask IPv6 full address
statusReason: Invalid IP address

[Killed] EqualityOperator
src/shared/utils/mask-ip.ts:84:7
   const expanded = expandIPv6(ip)
   const parts = expanded.split(':')
 
-  if (parts.length !== 8) {
+  if (parts.length === 8) {
     throw new Error('Invalid IP address')
   }
killedBy: maskIpAddress valid IPv6 addresses should mask IPv6 full address
statusReason: Invalid IP address

[Killed] StringLiteral
src/shared/utils/mask-ip.ts:89:41
   }
 
   // Keep first 3 hextets (48 bits), zero the rest
-  return [parts[0], parts[1], parts[2], 'xxxx', 'xxxx', 'xxxx', 'xxxx', 'xxxx'].join(':')
+  return [parts[0], parts[1], parts[2], "", 'xxxx', 'xxxx', 'xxxx', 'xxxx'].join(':')
 }
 
killedBy: maskIpAddress valid IPv6 addresses should mask IPv6 full address
statusReason: expected '2001:0db8:85a3::xxxx:xxxx:xxxx:xxxx' to be '2001:0db8:85a3:xxxx:xxxx:xxxx:xxxx:xx…' // Object.is equality

[Killed] StringLiteral
src/shared/utils/mask-ip.ts:89:57
   }
 
   // Keep first 3 hextets (48 bits), zero the rest
-  return [parts[0], parts[1], parts[2], 'xxxx', 'xxxx', 'xxxx', 'xxxx', 'xxxx'].join(':')
+  return [parts[0], parts[1], parts[2], 'xxxx', 'xxxx', "", 'xxxx', 'xxxx'].join(':')
 }
 
killedBy: UserController deleteUsers() edge cases should handle IPv6 addresses
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Array>, ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   Any<Array>,

[Killed] BlockStatement
src/shared/utils/mask-ip.ts:105:31
  * expandIPv6('2001:db8:85a3:0:0:8a2e:370:7334') // Returns '2001:0db8:85a3:0000:0000:8a2e:0370:7334'
  */
 function expandIPv6(address: string): string {
-  if (address.includes('::')) {
-    const [left, right] = address.split('::')
-    const leftParts = left ? left.split(':') : []
-    const rightParts = right ? right.split(':') : []
-
-    const missing = 8 - (leftParts.length + rightParts.length)
-    const middle = Array(missing).fill('0000')
-
-    return [...leftParts, ...middle, ...rightParts].map((p) => p.padStart(4, '0')).join(':')
-  }
+  if (address.includes('::')) {}
 
   return address
killedBy: maskIpAddress valid IPv6 addresses should mask IPv6 compressed address
statusReason: Invalid IP address

[Survived] ConditionalExpression
src/shared/utils/mask-ip.ts:105:7
  * expandIPv6('2001:db8:85a3:0:0:8a2e:370:7334') // Returns '2001:0db8:85a3:0000:0000:8a2e:0370:7334'
  */
 function expandIPv6(address: string): string {
-  if (address.includes('::')) {
+  if (true) {
     const [left, right] = address.split('::')
     const leftParts = left ? left.split(':') : []

[Killed] ArithmeticOperator
src/shared/utils/mask-ip.ts:110:21
     const leftParts = left ? left.split(':') : []
     const rightParts = right ? right.split(':') : []
 
-    const missing = 8 - (leftParts.length + rightParts.length)
+    const missing = 8 + (leftParts.length + rightParts.length)
     const middle = Array(missing).fill('0000')
 
killedBy: maskIpAddress valid IPv6 addresses should mask IPv6 compressed address
statusReason: Invalid IP address

[Killed] ArithmeticOperator
src/shared/utils/mask-ip.ts:110:26
     const leftParts = left ? left.split(':') : []
     const rightParts = right ? right.split(':') : []
 
-    const missing = 8 - (leftParts.length + rightParts.length)
+    const missing = 8 - (leftParts.length - rightParts.length)
     const middle = Array(missing).fill('0000')
 
killedBy: maskIpAddress valid IPv6 addresses should mask IPv6 compressed address
statusReason: Invalid IP address

[Killed] ArrowFunction
src/shared/utils/mask-ip.ts:113:57
     const missing = 8 - (leftParts.length + rightParts.length)
     const middle = Array(missing).fill('0000')
 
-    return [...leftParts, ...middle, ...rightParts].map((p) => p.padStart(4, '0')).join(':')
+    return [...leftParts, ...middle, ...rightParts].map(() => undefined).join(':')
   }
 
killedBy: maskIpAddress valid IPv6 addresses should mask IPv6 compressed address
statusReason: expected ':::xxxx:xxxx:xxxx:xxxx:xxxx' to be '2001:0db8:85a3:xxxx:xxxx:xxxx:xxxx:xx…' // Object.is equality

[Killed] StringLiteral
src/shared/utils/mask-ip.ts:113:89
     const missing = 8 - (leftParts.length + rightParts.length)
     const middle = Array(missing).fill('0000')
 
-    return [...leftParts, ...middle, ...rightParts].map((p) => p.padStart(4, '0')).join(':')
+    return [...leftParts, ...middle, ...rightParts].map((p) => p.padStart(4, '0')).join("")
   }
 
killedBy: maskIpAddress valid IPv6 addresses should mask IPv6 compressed address
statusReason: Invalid IP address

[Killed] ArrowFunction
src/shared/utils/mask-ip.ts:118:10
 
   return address
     .split(':')
-    .map((p) => p.padStart(4, '0'))
+    .map(() => undefined)
     .join(':')
 }
killedBy: maskIpAddress valid IPv6 addresses should mask IPv6 full address
statusReason: expected ':::xxxx:xxxx:xxxx:xxxx:xxxx' to be '2001:0db8:85a3:xxxx:xxxx:xxxx:xxxx:xx…' // Object.is equality

[Survived] StringLiteral
src/shared/utils/mask-ip.ts:118:31
 
   return address
     .split(':')
-    .map((p) => p.padStart(4, '0'))
+    .map((p) => p.padStart(4, ""))
     .join(':')
 }

[Killed] StringLiteral
src/shared/utils/mask-ip.ts:119:11
   return address
     .split(':')
     .map((p) => p.padStart(4, '0'))
-    .join(':')
+    .join("")
 }
 
killedBy: maskIpAddress valid IPv6 addresses should mask IPv6 full address
statusReason: Invalid IP address
