[Killed] BlockStatement
src/application/use-cases/get-text.use-case.ts:66:9
    * ```
    */
   constructor(dataFolder: string, fileName: FilePathSchema) {
-    try {
-      FileExtensionSchema.parse(fileName)
-    } catch (error) {
+    try {} catch (error) {
       if (error instanceof z.ZodError) {
         throw new TypeException(
killedBy: GetTextUseCase constructor invalid file extensions should throw TypeException for .pdf file extension
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
src/application/use-cases/get-text.use-case.ts:68:21
   constructor(dataFolder: string, fileName: FilePathSchema) {
     try {
       FileExtensionSchema.parse(fileName)
-    } catch (error) {
-      if (error instanceof z.ZodError) {
-        throw new TypeException(
-          `Invalid file extension for "${fileName}". Supported extensions are: .txt, .csv, .json, .toon, .onnx, .safetensors, .pt, .py, .gguf`,
-          undefined,
-          { cause: error }
-        )
-      }
-    }
+    } catch (error) {}
     this.file = fileName
     this.filePath = path.join(process.cwd(), dataFolder, fileName)
killedBy: GetTextUseCase constructor invalid file extensions should throw TypeException for .pdf file extension
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
src/application/use-cases/get-text.use-case.ts:69:40
     try {
       FileExtensionSchema.parse(fileName)
     } catch (error) {
-      if (error instanceof z.ZodError) {
-        throw new TypeException(
-          `Invalid file extension for "${fileName}". Supported extensions are: .txt, .csv, .json, .toon, .onnx, .safetensors, .pt, .py, .gguf`,
-          undefined,
-          { cause: error }
-        )
-      }
+      if (error instanceof z.ZodError) {}
     }
     this.file = fileName
killedBy: GetTextUseCase constructor invalid file extensions should throw TypeException for .pdf file extension
statusReason: expected function to throw an error, but it didn't

[Survived] ObjectLiteral
src/application/use-cases/get-text.use-case.ts:73:11
         throw new TypeException(
           `Invalid file extension for "${fileName}". Supported extensions are: .txt, .csv, .json, .toon, .onnx, .safetensors, .pt, .py, .gguf`,
           undefined,
-          { cause: error }
+          {}
         )
       }

[Killed] ConditionalExpression
src/application/use-cases/get-text.use-case.ts:105:11
       const content = await fs.readFile(this.filePath, 'utf8')
 
       // Return undefined if content is empty
-      if (!content) {
+      if (true) {
         return undefined
       }
killedBy: GetTextUseCase execute() successful file reading should read file content successfully
statusReason: expected undefined to be 'This is test content' // Object.is equality

[Survived] ObjectLiteral
src/application/use-cases/get-text.use-case.ts:116:96
       // Handle file not found error
       const nodeError = error as NodeJS.ErrnoException
       if (nodeError.code === 'ENOENT') {
-        throw new Error(`Error reading file "${this.filePath}": File not found: ${this.file}`, {
-          cause: error,
-        })
+        throw new Error(`Error reading file "${this.filePath}": File not found: ${this.file}`, {})
       }
       // Handle other errors
