[Killed] BlockStatement
src/application/use-cases/put-company-details.use-case.ts:219:23
     // Business logic to update company details goes here
     let resultPutCompanyDetails
     let resultPutKeyPersonDetails
-    if (data.company) {
-      resultPutCompanyDetails = await this.companyDetailsRepo.putCompanyDetails(data.company)
-    }
+    if (data.company) {}
     if (data.keyPerson) {
       resultPutKeyPersonDetails = await this.companyDetailsRepo.putKeyPersonDetails(data.keyPerson)
killedBy: PutCompanyDetailsUseCase execute() - company updates should update company details successfully
statusReason: expected { company: undefined, …(1) } to deeply equal { company: { …(12) }, …(1) }

[Killed] BlockStatement
src/application/use-cases/put-company-details.use-case.ts:222:25
     if (data.company) {
       resultPutCompanyDetails = await this.companyDetailsRepo.putCompanyDetails(data.company)
     }
-    if (data.keyPerson) {
-      resultPutKeyPersonDetails = await this.companyDetailsRepo.putKeyPersonDetails(data.keyPerson)
-    }
+    if (data.keyPerson) {}
 
     if (resultPutCompanyDetails) {
killedBy: PutCompanyDetailsUseCase execute() - key person updates should update key person details successfully
statusReason: expected { company: undefined, …(1) } to deeply equal { company: undefined, …(1) }

[Killed] ConditionalExpression
src/application/use-cases/put-company-details.use-case.ts:226:9
       resultPutKeyPersonDetails = await this.companyDetailsRepo.putKeyPersonDetails(data.keyPerson)
     }
 
-    if (resultPutCompanyDetails) {
+    if (true) {
       const auditEntry: CreateAuditLogDTO = {
         userId: auditContext.userId,
killedBy: PutCompanyDetailsUseCase execute() - company updates should return null company when update returns null
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      Object {

[Killed] BlockStatement
src/application/use-cases/put-company-details.use-case.ts:226:34
       resultPutKeyPersonDetails = await this.companyDetailsRepo.putKeyPersonDetails(data.keyPerson)
     }
 
-    if (resultPutCompanyDetails) {
-      const auditEntry: CreateAuditLogDTO = {
-        userId: auditContext.userId,
-        entityType: EntityType.COMPANY,
-        entityId: new Uuid(data?.company?.companyId as string).getValue(),
-        action: AuditAction.UPDATE,
-        changes: {
-          reason: 'company_details_updated_successfully',
-        },
-        ipAddress: auditContext.ipAddress,
-        userAgent: auditContext.userAgent ?? undefined,
-      }
-      // AuditLogPort.log() never throws per contract
-      await this.auditLog.log(auditEntry)
-    }
+    if (resultPutCompanyDetails) {}
 
     if (resultPutKeyPersonDetails && data.keyPerson?.keyPersonId) {
killedBy: PutCompanyDetailsUseCase execute() - company updates should log audit entry when company update succeeds
statusReason: expected "vi.fn()" to be called with arguments: [ { …(7) } ]

Number of calls: 0

[Killed] BlockStatement
src/application/use-cases/put-company-details.use-case.ts:242:67
       await this.auditLog.log(auditEntry)
     }
 
-    if (resultPutKeyPersonDetails && data.keyPerson?.keyPersonId) {
-      const auditEntry: CreateAuditLogDTO = {
-        userId: auditContext.userId,
-        entityType: EntityType.KEY_PERSON,
-        entityId: new Uuid(data.keyPerson.keyPersonId).getValue(),
-        action: AuditAction.UPDATE,
-        changes: {
-          reason: 'key_person_details_updated_successfully',
-        },
-        ipAddress: auditContext.ipAddress,
-        userAgent: auditContext.userAgent ?? undefined,
-      }
-      // AuditLogPort.log() never throws per contract
-      await this.auditLog.log(auditEntry)
-    }
+    if (resultPutKeyPersonDetails && data.keyPerson?.keyPersonId) {}
 
     return {
killedBy: PutCompanyDetailsUseCase execute() - key person updates should log audit entry when key person update succeeds
statusReason: expected "vi.fn()" to be called with arguments: [ { …(7) } ]

Number of calls: 0

[Killed] ObjectLiteral
src/application/use-cases/put-company-details.use-case.ts:248:18
         entityType: EntityType.KEY_PERSON,
         entityId: new Uuid(data.keyPerson.keyPersonId).getValue(),
         action: AuditAction.UPDATE,
-        changes: {
-          reason: 'key_person_details_updated_successfully',
-        },
+        changes: {},
         ipAddress: auditContext.ipAddress,
         userAgent: auditContext.userAgent ?? undefined,
killedBy: PutCompanyDetailsUseCase execute() - key person updates should log audit entry when key person update succeeds
statusReason: expected "vi.fn()" to be called with arguments: [ { …(7) } ]

Received:

  1st vi.fn() call:

@@ -1,11 +1,9 @@
  [
