[Killed] ConditionalExpression
src/application/use-cases/append-chat.use-case.ts:66:9
     auditContext: AuditContext
   ): Promise<AppendedChatResult | null> {
     const chatIdString = chatId
-    if (!chatIdString) {
+    if (true) {
       this.logger.info('Invalid chatId value received in AppendedChatUseCase', {
         event: 'chat.append.invalid_id',
killedBy: AppendedChatUseCase execute() - successful scenarios should return an AppendedChatResult with the correct chatId and messages
statusReason: expected null not to be null

[Killed] BlockStatement
src/application/use-cases/append-chat.use-case.ts:66:24
     auditContext: AuditContext
   ): Promise<AppendedChatResult | null> {
     const chatIdString = chatId
-    if (!chatIdString) {
-      this.logger.info('Invalid chatId value received in AppendedChatUseCase', {
-        event: 'chat.append.invalid_id',
-        chatId,
-      })
-      return null
-    }
+    if (!chatIdString) {}
     this.logger.info('Appending chat messages', {
       event: 'chat.append.attempt',
killedBy: AppendedChatUseCase execute() - invalid chatId guard should return null when chatId is an empty string
statusReason: expected { chatId: '', …(1) } to be null

[Killed] ObjectLiteral
src/application/use-cases/append-chat.use-case.ts:73:49
       })
       return null
     }
-    this.logger.info('Appending chat messages', {
-      event: 'chat.append.attempt',
-      chatId: chatIdString,
-      messageCount: messages.length,
-    })
+    this.logger.info('Appending chat messages', {})
     this.logger.debug('Appended chat', {
       event: 'chat.appended',
killedBy: AppendedChatUseCase execute() - logging "Appending chat messages" should log info with event "chat.append.attempt"
statusReason: expected "vi.fn()" to be called with arguments: [ Anything, ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   Anything,

[Killed] StringLiteral
src/application/use-cases/append-chat.use-case.ts:90:26
       entityType: EntityType.CHAT,
       entityId: chatId,
       action: AuditAction.UPDATE,
-      changes: { reason: 'chat_successfully_appended' },
+      changes: { reason: "" },
       ipAddress: auditContext.ipAddress,
       userAgent: auditContext.userAgent ?? undefined,
killedBy: AppendedChatUseCase execute() - audit logging should call auditLog.log with changes reason "chat_successfully_appended"
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {
