[Survived] StringLiteral
src/application/use-cases/get-chat-content-by-chat-id.use-case.ts:21:14
     auditContext: AuditContext
   ): Promise<ChatResponseResult | null> {
     this.logger.info('Fetching chat content by chat ID', {
-      event: 'chat_content.fetch.attempt',
+      event: "",
       chatId,
     })
