[Killed] EqualityOperator
src/application/use-cases/get-chat.use-case.ts:72:21
     // Retrieve chat data from DB
     const chatData = await this.aiService.getChatResponse(chatID)
 
-    if (chatData && chatData.length > 0) {
+    if (chatData && chatData.length <= 0) {
       this.logger.info('Chat data retrieved successfully', {
         event: 'chat.fetch.success',
killedBy: GetChatUseCase execute() - successful scenarios should retrieve chat data successfully
statusReason: expected null to deeply equal [ { chat: { …(5) }, …(2) }, …(2) ]

[Killed] EqualityOperator
src/application/use-cases/get-chat.use-case.ts:72:21
     // Retrieve chat data from DB
     const chatData = await this.aiService.getChatResponse(chatID)
 
-    if (chatData && chatData.length > 0) {
+    if (chatData && chatData.length >= 0) {
       this.logger.info('Chat data retrieved successfully', {
         event: 'chat.fetch.success',
killedBy: GetChatUseCase execute() - successful scenarios should return null when chat data is empty array
statusReason: expected [] to be null

[Killed] ObjectLiteral
src/application/use-cases/get-chat.use-case.ts:73:60
     const chatData = await this.aiService.getChatResponse(chatID)
 
     if (chatData && chatData.length > 0) {
-      this.logger.info('Chat data retrieved successfully', {
-        event: 'chat.fetch.success',
-        chatId: chatID,
-        messageCount: chatData.length,
-      })
+      this.logger.info('Chat data retrieved successfully', {})
 
       const auditEntry: CreateAuditLogDTO = {
killedBy: GetChatUseCase execute() - successful scenarios should retrieve chat data successfully
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
-   "Chat data retrieved successfully",

[Killed] StringLiteral
src/application/use-cases/get-chat.use-case.ts:86:19
         action: AuditAction.FETCH,
         changes: {
           chatIds: chatData.map((chat) => chat.chat.id),
-          reason: 'chat_successfully_retrieved',
+          reason: "",
         } satisfies FetchChatChanges,
         ipAddress: auditContext.ipAddress,
killedBy: GetChatUseCase execute() - audit logging should log audit when chat data is retrieved successfully
statusReason: expected "vi.fn()" to be called with arguments: [ { …(7) } ]

Received:

  1st vi.fn() call:

@@ -4,11 +4,11 @@
      "changes": {

[Killed] BlockStatement
src/application/use-cases/get-chat.use-case.ts:93:12
       }
       // AuditLogPort.log() never throws per contract
       await this.auditLog.log(auditEntry)
-    } else {
-      this.logger.info('No chat data found for user', {
-        event: 'chat.fetch.not_found',
-        chatId: chatID,
-      })
-      return null
-    }
+    } else {}
 
     return chatData
killedBy: GetChatUseCase execute() - successful scenarios should return null when no chat data found
statusReason: expected "vi.fn()" to be called with arguments: [ 'No chat data found for user', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "No chat data found for user",

[Killed] StringLiteral
src/application/use-cases/get-chat.use-case.ts:95:16
       await this.auditLog.log(auditEntry)
     } else {
       this.logger.info('No chat data found for user', {
-        event: 'chat.fetch.not_found',
+        event: "",
         chatId: chatID,
       })
killedBy: GetChatUseCase execute() - successful scenarios should return null when no chat data found
statusReason: expected "vi.fn()" to be called with arguments: [ 'No chat data found for user', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "No chat data found for user",
