[Killed] ObjectLiteral
src/application/use-cases/get-chats-by-userid.use-case.ts:57:48
    * // chats[0].chatType — associated chat-type details
    */
   async execute(userId: UserIdType, auditContext: AuditContext): Promise<ChatWithType[]> {
-    this.logger.info('Getting chats for user', { event: 'chat.fetch_by_user.attempt', userId })
+    this.logger.info('Getting chats for user', {})
 
     let chats: ChatWithType[]
killedBy: GetChatsByUserIdUseCase execute() - successful scenarios should retrieve chats for a user successfully
statusReason: expected "vi.fn()" to be called with arguments: [ 'Getting chats for user', { …(2) } ]

Received:

  1st vi.fn() call:

  [
    "Getting chats for user",

[Killed] StringLiteral
src/application/use-cases/get-chats-by-userid.use-case.ts:64:16
       chats = await this.aiRepository.getChatsByUserId(userId)
     } catch (error) {
       this.logger.error('Error retrieving chats for user', error as Error, {
-        event: 'chat.fetch_by_user.failed',
+        event: "",
         userId,
       })
killedBy: GetChatsByUserIdUseCase execute() - logging behavior should call error logger on repository failure
statusReason: expected "vi.fn()" to be called with arguments: [ …(3) ]

Received:

  1st vi.fn() call:

@@ -2,9 +2,9 @@
    "Error retrieving chats for user",

[Killed] StringLiteral
src/application/use-cases/get-chats-by-userid.use-case.ts:74:19
         entityId: userId,
         action: AuditAction.FETCH_FAILED,
         changes: {
-          reason: 'chat_retrieval_failed',
+          reason: "",
           errorMessage: error instanceof Error ? error.message : 'Unknown error',
         } satisfies FetchChatFailedChanges,
killedBy: GetChatsByUserIdUseCase execute() - audit logging should call audit log with failure details if repository fails
statusReason: expected "vi.fn()" to be called with arguments: [ { …(7) } ]

Received:

  1st vi.fn() call:

@@ -1,11 +1,11 @@
  [

[Killed] StringLiteral
src/application/use-cases/get-chats-by-userid.use-case.ts:98:17
       entityId: userId,
       action: AuditAction.FETCH,
       changes: {
-        reason: 'chat_successfully_retrieved_by_userid',
+        reason: "",
         chatIds: chats.map((c) => c.id),
       } satisfies FetchChatChanges,
killedBy: GetChatsByUserIdUseCase execute() - audit logging should log audit event with correct parameters when chats are retrieved successfully
statusReason: expected "vi.fn()" to be called with arguments: [ { …(7) } ]

Received:

  1st vi.fn() call:

@@ -4,11 +4,11 @@
      "changes": {
