[Killed] StringLiteral
src/application/use-cases/save-chat.use-case.ts:83:26
       entityType: EntityType.CHAT,
       entityId: chatId,
       action: AuditAction.CREATE,
-      changes: { reason: 'chat_successfully_saved' } satisfies UpdateChanges,
+      changes: { reason: "" } satisfies UpdateChanges,
       ipAddress: auditContext.ipAddress,
       userAgent: auditContext.userAgent ?? undefined,
killedBy: SaveChatUseCase execute() - audit logging should log audit event with correct parameters when chat is saved successfully
statusReason: expected "vi.fn()" to be called with arguments: [ { …(7) } ]

Received:

  1st vi.fn() call:

@@ -1,10 +1,10 @@
  [
