[Survived] BlockStatement
src/application/services/text-analysis.service.ts:64:53
    *                        trigger words found in questions, improving context retrieval for
    *                        domain-specific content (e.g., literary texts, technical documentation).
    */
-  constructor(domainMapping?: DomainKeywordMapping) {
-    this.domainMapping = domainMapping
-  }
+  constructor(domainMapping?: DomainKeywordMapping) {}
   /**
    * Extract relevant passages from the text based on question keywords

[Killed] ConditionalExpression
src/application/services/text-analysis.service.ts:88:9
    */
   public extractRelevantPassages(fullText: string, question: string): string {
     // Handle empty text gracefully
-    if (fullText.length === 0) return ''
+    if (false) return ''
 
     // Extract meaningful keywords from the question (exclude common words)
killedBy: TextAnalysisService extractRelevantPassages should handle empty text gracefully
statusReason: expected '[...]' to be '' // Object.is equality

[Killed] EqualityOperator
src/application/services/text-analysis.service.ts:88:9
    */
   public extractRelevantPassages(fullText: string, question: string): string {
     // Handle empty text gracefully
-    if (fullText.length === 0) return ''
+    if (fullText.length !== 0) return ''
 
     // Extract meaningful keywords from the question (exclude common words)
killedBy: HeartOfDarknessTool execute() - cached content should use cached content when available
statusReason: expected '' to contain 'The Nellie, a cruising yawl, swung to…'

[Survived] StringLiteral
src/application/services/text-analysis.service.ts:95:7
       'the',
       'a',
       'an',
-      'is',
+      "",
       'are',
       'was',

[Survived] StringLiteral
src/application/services/text-analysis.service.ts:100:7
       'was',
       'were',
       'what',
-      'which',
+      "",
       'who',
       'whom',

[Survived] StringLiteral
src/application/services/text-analysis.service.ts:102:7
       'what',
       'which',
       'who',
-      'whom',
+      "",
       'when',
       'where',

[Survived] StringLiteral
src/application/services/text-analysis.service.ts:109:7
       'how',
       'does',
       'do',
-      'did',
+      "",
       'has',
       'have',

[Survived] StringLiteral
src/application/services/text-analysis.service.ts:115:7
       'had',
       'in',
       'on',
-      'at',
+      "",
       'to',
       'for',

[Survived] StringLiteral
src/application/services/text-analysis.service.ts:120:7
       'for',
       'of',
       'with',
-      'by',
+      "",
       'from',
       'about',

[Survived] StringLiteral
src/application/services/text-analysis.service.ts:133:7
       'this',
       'these',
       'those',
-      'and',
+      "",
       'or',
       'but',

[Survived] StringLiteral
src/application/services/text-analysis.service.ts:143:7
       'before',
       'after',
       'upriver',
-      'start',
+      "",
       'begins',
       'narrating',

[Survived] StringLiteral
src/application/services/text-analysis.service.ts:144:7
       'after',
       'upriver',
       'start',
-      'begins',
+      "",
       'narrating',
       'story',

[Survived] StringLiteral
src/application/services/text-analysis.service.ts:145:7
       'upriver',
       'start',
       'begins',
-      'narrating',
+      "",
       'story',
       'novella',

[Survived] StringLiteral
src/application/services/text-analysis.service.ts:147:7
       'begins',
       'narrating',
       'story',
-      'novella',
+      "",
     ])
 

[Killed] MethodExpression
src/application/services/text-analysis.service.ts:150:22
       'novella',
     ])
 
-    const keywords = question
-      .toLowerCase()
-      .replace(/[?.,!]/g, '')
-      .split(/\s+/)
-      .filter((word) => word.length > this.KEYWORD_LENGTH_THRESHOLD && !stopWords.has(word))
+    const keywords = question.toLowerCase().replace(/[?.,!]/g, '').split(/\s+/)
 
     // Add domain-specific keywords based on configuration
killedBy: TextAnalysisService extractRelevantPassages should filter each stopword from question keywords
statusReason: expected '---\n\nxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx…' not to contain '---'

[Killed] MethodExpression
src/application/services/text-analysis.service.ts:150:22
       'novella',
     ])
 
-    const keywords = question
-      .toLowerCase()
+    const keywords = question.toUpperCase()
       .replace(/[?.,!]/g, '')
       .split(/\s+/)
killedBy: TextAnalysisService extractRelevantPassages should separate non-overlapping passages with separators
statusReason: expected 'First section with keyword alpha. Fir…' to contain '---'

[Survived] StringLiteral
src/application/services/text-analysis.service.ts:152:27
 
     const keywords = question
       .toLowerCase()
-      .replace(/[?.,!]/g, '')
+      .replace(/[?.,!]/g, "Stryker was here!")
       .split(/\s+/)
       .filter((word) => word.length > this.KEYWORD_LENGTH_THRESHOLD && !stopWords.has(word))

[Killed] Regex
src/application/services/text-analysis.service.ts:153:14
     const keywords = question
       .toLowerCase()
       .replace(/[?.,!]/g, '')
-      .split(/\s+/)
+      .split(/\S+/)
       .filter((word) => word.length > this.KEYWORD_LENGTH_THRESHOLD && !stopWords.has(word))
 
killedBy: TextAnalysisService extractRelevantPassages should separate non-overlapping passages with separators
statusReason: expected 'First section with keyword alpha. Fir…' to contain '---'

[Killed] EqualityOperator
src/application/services/text-analysis.service.ts:154:25
       .toLowerCase()
       .replace(/[?.,!]/g, '')
       .split(/\s+/)
-      .filter((word) => word.length > this.KEYWORD_LENGTH_THRESHOLD && !stopWords.has(word))
+      .filter((word) => word.length >= this.KEYWORD_LENGTH_THRESHOLD && !stopWords.has(word))
 
     // Add domain-specific keywords based on configuration
killedBy: TextAnalysisService extractRelevantPassages should filter words of exactly length 2 from question keywords
statusReason: expected '---\n\nThe word go appears here, and …' not to contain '---'

[Killed] BooleanLiteral
src/application/services/text-analysis.service.ts:154:72
       .toLowerCase()
       .replace(/[?.,!]/g, '')
       .split(/\s+/)
-      .filter((word) => word.length > this.KEYWORD_LENGTH_THRESHOLD && !stopWords.has(word))
+      .filter((word) => word.length > this.KEYWORD_LENGTH_THRESHOLD && stopWords.has(word))
 
     // Add domain-specific keywords based on configuration
killedBy: TextAnalysisService extractRelevantPassages should separate non-overlapping passages with separators
statusReason: expected 'First section with keyword alpha. Fir…' to contain '---'

[Survived] ArrayDeclaration
src/application/services/text-analysis.service.ts:157:42
       .filter((word) => word.length > this.KEYWORD_LENGTH_THRESHOLD && !stopWords.has(word))
 
     // Add domain-specific keywords based on configuration
-    const additionalKeywords: string[] = []
+    const additionalKeywords: string[] = ["Stryker was here"]
     if (this.domainMapping) {
       const questionLower = question.toLowerCase()

[Survived] BlockStatement
src/application/services/text-analysis.service.ts:158:29
 
     // Add domain-specific keywords based on configuration
     const additionalKeywords: string[] = []
-    if (this.domainMapping) {
-      const questionLower = question.toLowerCase()
-      for (const rule of this.domainMapping.rules) {
-        // Check if any trigger is present in the question
-        const hasMatch = rule.triggers.some((trigger) => questionLower.includes(trigger))
-        if (hasMatch) {
-          additionalKeywords.push(...rule.keywords)
-        }
-      }
-    }
+    if (this.domainMapping) {}
 
     const allKeywords = [...new Set([...keywords, ...additionalKeywords])]

[Survived] MethodExpression
src/application/services/text-analysis.service.ts:159:29
     // Add domain-specific keywords based on configuration
     const additionalKeywords: string[] = []
     if (this.domainMapping) {
-      const questionLower = question.toLowerCase()
+      const questionLower = question.toUpperCase()
       for (const rule of this.domainMapping.rules) {
         // Check if any trigger is present in the question

[Survived] BlockStatement
src/application/services/text-analysis.service.ts:160:52
     const additionalKeywords: string[] = []
     if (this.domainMapping) {
       const questionLower = question.toLowerCase()
-      for (const rule of this.domainMapping.rules) {
-        // Check if any trigger is present in the question
-        const hasMatch = rule.triggers.some((trigger) => questionLower.includes(trigger))
-        if (hasMatch) {
-          additionalKeywords.push(...rule.keywords)
-        }
-      }
+      for (const rule of this.domainMapping.rules) {}
     }
 

[Survived] ArrowFunction
src/application/services/text-analysis.service.ts:162:45
       const questionLower = question.toLowerCase()
       for (const rule of this.domainMapping.rules) {
         // Check if any trigger is present in the question
-        const hasMatch = rule.triggers.some((trigger) => questionLower.includes(trigger))
+        const hasMatch = rule.triggers.some(() => undefined)
         if (hasMatch) {
           additionalKeywords.push(...rule.keywords)

[Survived] MethodExpression
src/application/services/text-analysis.service.ts:162:26
       const questionLower = question.toLowerCase()
       for (const rule of this.domainMapping.rules) {
         // Check if any trigger is present in the question
-        const hasMatch = rule.triggers.some((trigger) => questionLower.includes(trigger))
+        const hasMatch = rule.triggers.every(trigger => questionLower.includes(trigger))
         if (hasMatch) {
           additionalKeywords.push(...rule.keywords)

[Survived] BlockStatement
src/application/services/text-analysis.service.ts:163:23
       for (const rule of this.domainMapping.rules) {
         // Check if any trigger is present in the question
         const hasMatch = rule.triggers.some((trigger) => questionLower.includes(trigger))
-        if (hasMatch) {
-          additionalKeywords.push(...rule.keywords)
-        }
+        if (hasMatch) {}
       }
     }

[Survived] ConditionalExpression
src/application/services/text-analysis.service.ts:163:13
       for (const rule of this.domainMapping.rules) {
         // Check if any trigger is present in the question
         const hasMatch = rule.triggers.some((trigger) => questionLower.includes(trigger))
-        if (hasMatch) {
+        if (true) {
           additionalKeywords.push(...rule.keywords)
         }

[Killed] MethodExpression
src/application/services/text-analysis.service.ts:173:23
 
     // Step 1: Collect all keyword matches as intervals (O(n) per keyword)
     const intervals: { start: number; end: number }[] = []
-    const textLower = fullText.toLowerCase()
+    const textLower = fullText.toUpperCase()
 
     for (const keyword of allKeywords) {
killedBy: TextAnalysisService extractRelevantPassages should separate non-overlapping passages with separators
statusReason: expected 'First section with keyword alpha. Fir…' to contain '---'

[Killed] BlockStatement
src/application/services/text-analysis.service.ts:175:40
     const intervals: { start: number; end: number }[] = []
     const textLower = fullText.toLowerCase()
 
-    for (const keyword of allKeywords) {
-      let searchStart = 0
-      while (searchStart < textLower.length) {
-        const idx = textLower.indexOf(keyword, searchStart)
-        if (idx === -1) break
-
-        const start = Math.max(0, idx - this.PASSAGE_WINDOW / 2)
-        const end = Math.min(fullText.length, idx + keyword.length + this.PASSAGE_WINDOW / 2)
-
-        intervals.push({ start, end })
-        searchStart = idx + keyword.length
-      }
-    }
+    for (const keyword of allKeywords) {}
 
     // Step 2: Sort intervals by start position for efficient merging
killedBy: TextAnalysisService extractRelevantPassages should separate non-overlapping passages with separators
statusReason: expected 'First section with keyword alpha. Fir…' to contain '---'

[Killed] ConditionalExpression
src/application/services/text-analysis.service.ts:177:14
 
     for (const keyword of allKeywords) {
       let searchStart = 0
-      while (searchStart < textLower.length) {
+      while (false) {
         const idx = textLower.indexOf(keyword, searchStart)
         if (idx === -1) break
killedBy: TextAnalysisService extractRelevantPassages should separate non-overlapping passages with separators
statusReason: expected 'First section with keyword alpha. Fir…' to contain '---'

[Killed] EqualityOperator
src/application/services/text-analysis.service.ts:177:14
 
     for (const keyword of allKeywords) {
       let searchStart = 0
-      while (searchStart < textLower.length) {
+      while (searchStart >= textLower.length) {
         const idx = textLower.indexOf(keyword, searchStart)
         if (idx === -1) break
killedBy: TextAnalysisService extractRelevantPassages should separate non-overlapping passages with separators
statusReason: expected 'First section with keyword alpha. Fir…' to contain '---'

[Killed] ConditionalExpression
src/application/services/text-analysis.service.ts:179:13
       let searchStart = 0
       while (searchStart < textLower.length) {
         const idx = textLower.indexOf(keyword, searchStart)
-        if (idx === -1) break
+        if (true) break
 
         const start = Math.max(0, idx - this.PASSAGE_WINDOW / 2)
killedBy: TextAnalysisService extractRelevantPassages should separate non-overlapping passages with separators
statusReason: expected 'First section with keyword alpha. Fir…' to contain '---'

[Timeout] ConditionalExpression
src/application/services/text-analysis.service.ts:179:13
       let searchStart = 0
       while (searchStart < textLower.length) {
         const idx = textLower.indexOf(keyword, searchStart)
-        if (idx === -1) break
+        if (false) break
 
         const start = Math.max(0, idx - this.PASSAGE_WINDOW / 2)

[Killed] MethodExpression
src/application/services/text-analysis.service.ts:181:23
         const idx = textLower.indexOf(keyword, searchStart)
         if (idx === -1) break
 
-        const start = Math.max(0, idx - this.PASSAGE_WINDOW / 2)
+        const start = Math.min(0, idx - this.PASSAGE_WINDOW / 2)
         const end = Math.min(fullText.length, idx + keyword.length + this.PASSAGE_WINDOW / 2)
 
killedBy: TextAnalysisService extractRelevantPassages should increment score on overlap, not decrement
statusReason: expected 3045 to be less than 5

[Killed] ArithmeticOperator
src/application/services/text-analysis.service.ts:181:41
         const idx = textLower.indexOf(keyword, searchStart)
         if (idx === -1) break
 
-        const start = Math.max(0, idx - this.PASSAGE_WINDOW / 2)
+        const start = Math.max(0, idx - this.PASSAGE_WINDOW * 2)
         const end = Math.min(fullText.length, idx + keyword.length + this.PASSAGE_WINDOW / 2)
 
killedBy: TextAnalysisService extractRelevantPassages should increment score on overlap, not decrement
statusReason: expected 3045 to be less than 5

[Killed] ArithmeticOperator
src/application/services/text-analysis.service.ts:182:70
         if (idx === -1) break
 
         const start = Math.max(0, idx - this.PASSAGE_WINDOW / 2)
-        const end = Math.min(fullText.length, idx + keyword.length + this.PASSAGE_WINDOW / 2)
+        const end = Math.min(fullText.length, idx + keyword.length + this.PASSAGE_WINDOW * 2)
 
         intervals.push({ start, end })
killedBy: TextAnalysisService extractRelevantPassages should increment score on overlap, not decrement
statusReason: expected 3045 to be less than 5

[Killed] ArithmeticOperator
src/application/services/text-analysis.service.ts:182:47
         if (idx === -1) break
 
         const start = Math.max(0, idx - this.PASSAGE_WINDOW / 2)
-        const end = Math.min(fullText.length, idx + keyword.length + this.PASSAGE_WINDOW / 2)
+        const end = Math.min(fullText.length, idx + keyword.length - this.PASSAGE_WINDOW / 2)
 
         intervals.push({ start, end })
killedBy: TextAnalysisService extractRelevantPassages should extract passages containing question keywords
statusReason: expected '---' to contain 'Kurtz'

[Timeout] ArithmeticOperator
src/application/services/text-analysis.service.ts:185:23
         const end = Math.min(fullText.length, idx + keyword.length + this.PASSAGE_WINDOW / 2)
 
         intervals.push({ start, end })
-        searchStart = idx + keyword.length
+        searchStart = idx - keyword.length
       }
     }

[Killed] ArithmeticOperator
src/application/services/text-analysis.service.ts:190:30
     }
 
     // Step 2: Sort intervals by start position for efficient merging
-    intervals.sort((a, b) => a.start - b.start)
+    intervals.sort((a, b) => a.start + b.start)
 
     // Step 3: Merge overlapping intervals and count overlaps (O(n))
killedBy: TextAnalysisService extractRelevantPassages should sort intervals by start position before merging
statusReason: expected '---\n\nxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx…' to contain 'gamma'

[Killed] MethodExpression
src/application/services/text-analysis.service.ts:190:5
     }
 
     // Step 2: Sort intervals by start position for efficient merging
-    intervals.sort((a, b) => a.start - b.start)
+    intervals
 
     // Step 3: Merge overlapping intervals and count overlaps (O(n))
killedBy: TextAnalysisService extractRelevantPassages should sort intervals by start position before merging
statusReason: expected '---\n\nxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx…' to contain 'gamma'

[Killed] BlockStatement
src/application/services/text-analysis.service.ts:195:39
     // Step 3: Merge overlapping intervals and count overlaps (O(n))
     const passages: { start: number; end: number; score: number }[] = []
 
-    for (const interval of intervals) {
-      if (passages.length === 0) {
-        passages.push({ ...interval, score: 1 })
-      } else {
-        const last = passages[passages.length - 1]!
-        // TypeScript: last is guaranteed to exist since passages.length > 0
-        if (interval.start <= last.end) {
-          // Overlapping intervals: merge and increment score
-          last.end = Math.max(last.end, interval.end)
-          last.score += 1
-        } else {
-          // Non-overlapping: add as new passage
-          passages.push({ ...interval, score: 1 })
-        }
-      }
-    }
+    for (const interval of intervals) {}
 
     // Sort by score (most keyword matches first) then by position
killedBy: TextAnalysisService extractRelevantPassages should separate non-overlapping passages with separators
statusReason: expected 'First section with keyword alpha. Fir…' to contain '---'

[Killed] EqualityOperator
src/application/services/text-analysis.service.ts:196:11
     const passages: { start: number; end: number; score: number }[] = []
 
     for (const interval of intervals) {
-      if (passages.length === 0) {
+      if (passages.length !== 0) {
         passages.push({ ...interval, score: 1 })
       } else {
killedBy: TextAnalysisService extractRelevantPassages should extract passages containing question keywords
statusReason: Cannot read properties of undefined (reading 'end')

[Killed] ConditionalExpression
src/application/services/text-analysis.service.ts:196:11
     const passages: { start: number; end: number; score: number }[] = []
 
     for (const interval of intervals) {
-      if (passages.length === 0) {
+      if (true) {
         passages.push({ ...interval, score: 1 })
       } else {
killedBy: TextAnalysisService extractRelevantPassages should increment score on overlap, not decrement
statusReason: expected 1517 to be less than 5

[Killed] BlockStatement
src/application/services/text-analysis.service.ts:198:14
     for (const interval of intervals) {
       if (passages.length === 0) {
         passages.push({ ...interval, score: 1 })
-      } else {
-        const last = passages[passages.length - 1]!
-        // TypeScript: last is guaranteed to exist since passages.length > 0
-        if (interval.start <= last.end) {
-          // Overlapping intervals: merge and increment score
-          last.end = Math.max(last.end, interval.end)
-          last.score += 1
-        } else {
-          // Non-overlapping: add as new passage
-          passages.push({ ...interval, score: 1 })
-        }
-      }
+      } else {}
     }
 
killedBy: TextAnalysisService extractRelevantPassages should prioritize passages with more keyword matches
statusReason: expected '---\n\nSection one mentions alpha onc…' to contain 'Section three'

[Killed] ArithmeticOperator
src/application/services/text-analysis.service.ts:199:31
       if (passages.length === 0) {
         passages.push({ ...interval, score: 1 })
       } else {
-        const last = passages[passages.length - 1]!
+        const last = passages[passages.length + 1]!
         // TypeScript: last is guaranteed to exist since passages.length > 0
         if (interval.start <= last.end) {
killedBy: TextAnalysisService extractRelevantPassages should filter out stopwords from question
statusReason: Cannot read properties of undefined (reading 'end')

[Killed] BlockStatement
src/application/services/text-analysis.service.ts:201:41
       } else {
         const last = passages[passages.length - 1]!
         // TypeScript: last is guaranteed to exist since passages.length > 0
-        if (interval.start <= last.end) {
-          // Overlapping intervals: merge and increment score
-          last.end = Math.max(last.end, interval.end)
-          last.score += 1
-        } else {
+        if (interval.start <= last.end) {} else {
           // Non-overlapping: add as new passage
           passages.push({ ...interval, score: 1 })
killedBy: TextAnalysisService extractRelevantPassages should increment score on overlap, not decrement
statusReason: expected 1517 to be less than 5

[Killed] ConditionalExpression
src/application/services/text-analysis.service.ts:201:13
       } else {
         const last = passages[passages.length - 1]!
         // TypeScript: last is guaranteed to exist since passages.length > 0
-        if (interval.start <= last.end) {
+        if (false) {
           // Overlapping intervals: merge and increment score
           last.end = Math.max(last.end, interval.end)
killedBy: TextAnalysisService extractRelevantPassages should increment score on overlap, not decrement
statusReason: expected 1517 to be less than 5

[Survived] MethodExpression
src/application/services/text-analysis.service.ts:203:22
         // TypeScript: last is guaranteed to exist since passages.length > 0
         if (interval.start <= last.end) {
           // Overlapping intervals: merge and increment score
-          last.end = Math.max(last.end, interval.end)
+          last.end = Math.min(last.end, interval.end)
           last.score += 1
         } else {

[Killed] AssignmentOperator
src/application/services/text-analysis.service.ts:204:11
         if (interval.start <= last.end) {
           // Overlapping intervals: merge and increment score
           last.end = Math.max(last.end, interval.end)
-          last.score += 1
+          last.score -= 1
         } else {
           // Non-overlapping: add as new passage
killedBy: TextAnalysisService extractRelevantPassages should increment score on overlap, not decrement
statusReason: expected 1517 to be less than 5

[Killed] BlockStatement
src/application/services/text-analysis.service.ts:205:16
           // Overlapping intervals: merge and increment score
           last.end = Math.max(last.end, interval.end)
           last.score += 1
-        } else {
-          // Non-overlapping: add as new passage
-          passages.push({ ...interval, score: 1 })
-        }
+        } else {}
       }
     }
killedBy: TextAnalysisService extractRelevantPassages should prioritize passages with more keyword matches
statusReason: expected '---\n\nSection one mentions alpha onc…' to contain 'Section three'

[Killed] ArithmeticOperator
src/application/services/text-analysis.service.ts:213:29
     }
 
     // Sort by score (most keyword matches first) then by position
-    passages.sort((a, b) => b.score - a.score || a.start - b.start)
+    passages.sort((a, b) => b.score + a.score || a.start - b.start)
 
     // Collect passages up to max length
killedBy: TextAnalysisService extractRelevantPassages should increment score on overlap, not decrement
statusReason: expected 1517 to be less than 5

[Killed] MethodExpression
src/application/services/text-analysis.service.ts:213:5
     }
 
     // Sort by score (most keyword matches first) then by position
-    passages.sort((a, b) => b.score - a.score || a.start - b.start)
+    passages
 
     // Collect passages up to max length
killedBy: TextAnalysisService extractRelevantPassages should increment score on overlap, not decrement
statusReason: expected 1517 to be less than 5

[Killed] BlockStatement
src/application/services/text-analysis.service.ts:219:37
     let result = ''
     const usedRanges: { start: number; end: number }[] = []
 
-    for (const passage of passages) {
-      // Skip if overlaps with already used range
-      const overlaps = usedRanges.some(
-        (used) => passage.start < used.end && passage.end > used.start
-      )
-      if (overlaps) continue
-
-      const passageText = fullText.substring(passage.start, passage.end).trim()
-
-      if (result.length + passageText.length + 10 > this.MAX_CONTEXT_LENGTH) {
-        break
-      }
-
-      result += '\n\n---\n\n' + passageText
-      usedRanges.push({ start: passage.start, end: passage.end })
-    }
+    for (const passage of passages) {}
 
     // If no passages found, return the beginning and end of the text
killedBy: TextAnalysisService extractRelevantPassages should separate non-overlapping passages with separators
statusReason: expected 'First section with keyword alpha. Fir…' to contain '---'

[Killed] MethodExpression
src/application/services/text-analysis.service.ts:221:24
 
     for (const passage of passages) {
       // Skip if overlaps with already used range
-      const overlaps = usedRanges.some(
-        (used) => passage.start < used.end && passage.end > used.start
-      )
+      const overlaps = usedRanges.every(used => passage.start < used.end && passage.end > used.start)
       if (overlaps) continue
 
killedBy: TextAnalysisService extractRelevantPassages should separate non-overlapping passages with separators
statusReason: expected 'First section with keyword alpha. Fir…' to contain '---'

[Killed] EqualityOperator
src/application/services/text-analysis.service.ts:222:47
     for (const passage of passages) {
       // Skip if overlaps with already used range
       const overlaps = usedRanges.some(
-        (used) => passage.start < used.end && passage.end > used.start
+        (used) => passage.start < used.end && passage.end <= used.start
       )
       if (overlaps) continue
killedBy: TextAnalysisService extractRelevantPassages should increment score on overlap, not decrement
statusReason: expected -1 to be greater than -1

[Killed] LogicalOperator
src/application/services/text-analysis.service.ts:222:19
     for (const passage of passages) {
       // Skip if overlaps with already used range
       const overlaps = usedRanges.some(
-        (used) => passage.start < used.end && passage.end > used.start
+        (used) => passage.start < used.end || passage.end > used.start
       )
       if (overlaps) continue
killedBy: TextAnalysisService extractRelevantPassages should keep passage window as PASSAGE_WINDOW/2, not PASSAGE_WINDOW*2
statusReason: expected '---\n\nalphaxxxxxxxxxxxxxxxxxxxxxxxxx…' to contain 'beta'

[Killed] ConditionalExpression
src/application/services/text-analysis.service.ts:224:11
       const overlaps = usedRanges.some(
         (used) => passage.start < used.end && passage.end > used.start
       )
-      if (overlaps) continue
+      if (true) continue
 
       const passageText = fullText.substring(passage.start, passage.end).trim()
killedBy: TextAnalysisService extractRelevantPassages should separate non-overlapping passages with separators
statusReason: expected 'First section with keyword alpha. Fir…' to contain '---'

[Survived] ConditionalExpression
src/application/services/text-analysis.service.ts:224:11
       const overlaps = usedRanges.some(
         (used) => passage.start < used.end && passage.end > used.start
       )
-      if (overlaps) continue
+      if (false) continue
 
       const passageText = fullText.substring(passage.start, passage.end).trim()

[Killed] MethodExpression
src/application/services/text-analysis.service.ts:226:27
       )
       if (overlaps) continue
 
-      const passageText = fullText.substring(passage.start, passage.end).trim()
+      const passageText = fullText.trim()
 
       if (result.length + passageText.length + 10 > this.MAX_CONTEXT_LENGTH) {
killedBy: TextAnalysisService extractRelevantPassages should increment score on overlap, not decrement
statusReason: expected 3045 to be less than 5

[Survived] MethodExpression
src/application/services/text-analysis.service.ts:226:27
       )
       if (overlaps) continue
 
-      const passageText = fullText.substring(passage.start, passage.end).trim()
+      const passageText = fullText.substring(passage.start, passage.end)
 
       if (result.length + passageText.length + 10 > this.MAX_CONTEXT_LENGTH) {
