[Killed] EqualityOperator
src/application/services/text-analysis.service.ts:228:11
 
       const passageText = fullText.substring(passage.start, passage.end).trim()
 
-      if (result.length + passageText.length + 10 > this.MAX_CONTEXT_LENGTH) {
+      if (result.length + passageText.length + 10 <= this.MAX_CONTEXT_LENGTH) {
         break
       }
killedBy: TextAnalysisService extractRelevantPassages should separate non-overlapping passages with separators
statusReason: expected 'First section with keyword alpha. Fir…' to contain '---'

[Killed] ConditionalExpression
src/application/services/text-analysis.service.ts:228:11
 
       const passageText = fullText.substring(passage.start, passage.end).trim()
 
-      if (result.length + passageText.length + 10 > this.MAX_CONTEXT_LENGTH) {
+      if (true) {
         break
       }
killedBy: TextAnalysisService extractRelevantPassages should separate non-overlapping passages with separators
statusReason: expected 'First section with keyword alpha. Fir…' to contain '---'

[Killed] StringLiteral
src/application/services/text-analysis.service.ts:232:17
         break
       }
 
-      result += '\n\n---\n\n' + passageText
+      result += "" + passageText
       usedRanges.push({ start: passage.start, end: passage.end })
     }
killedBy: TextAnalysisService extractRelevantPassages should separate non-overlapping passages with separators
statusReason: expected 'First section with keyword alpha. Fir…' to contain '---'

[Killed] ConditionalExpression
src/application/services/text-analysis.service.ts:237:9
     }
 
     // If no passages found, return the beginning and end of the text
-    if (result.length === 0) {
+    if (true) {
       const beginning = fullText.substring(0, this.MAX_CONTEXT_LENGTH / 2)
       const ending = fullText.substring(fullText.length - this.MAX_CONTEXT_LENGTH / 2)
killedBy: TextAnalysisService extractRelevantPassages should separate non-overlapping passages with separators
statusReason: expected 'First section with keyword alpha. Fir…' to contain '---'

[Killed] BlockStatement
src/application/services/text-analysis.service.ts:237:30
     }
 
     // If no passages found, return the beginning and end of the text
-    if (result.length === 0) {
-      const beginning = fullText.substring(0, this.MAX_CONTEXT_LENGTH / 2)
-      const ending = fullText.substring(fullText.length - this.MAX_CONTEXT_LENGTH / 2)
-      result = beginning + '\n\n[...]\n\n' + ending
-    }
+    if (result.length === 0) {}
 
     return result.trim()
killedBy: TextAnalysisService extractRelevantPassages should return beginning and end when no keywords match
statusReason: expected '' to contain '[...]'

[Killed] ArithmeticOperator
src/application/services/text-analysis.service.ts:238:47
 
     // If no passages found, return the beginning and end of the text
     if (result.length === 0) {
-      const beginning = fullText.substring(0, this.MAX_CONTEXT_LENGTH / 2)
+      const beginning = fullText.substring(0, this.MAX_CONTEXT_LENGTH * 2)
       const ending = fullText.substring(fullText.length - this.MAX_CONTEXT_LENGTH / 2)
       result = beginning + '\n\n[...]\n\n' + ending
killedBy: TextAnalysisService extractRelevantPassages should return beginning and end when no keywords match
statusReason: expected 42509 to be less than or equal to 25009

[Killed] MethodExpression
src/application/services/text-analysis.service.ts:238:25
 
     // If no passages found, return the beginning and end of the text
     if (result.length === 0) {
-      const beginning = fullText.substring(0, this.MAX_CONTEXT_LENGTH / 2)
+      const beginning = fullText
       const ending = fullText.substring(fullText.length - this.MAX_CONTEXT_LENGTH / 2)
       result = beginning + '\n\n[...]\n\n' + ending
killedBy: TextAnalysisService extractRelevantPassages should return beginning and end when no keywords match
statusReason: expected 42509 to be less than or equal to 25009

[Killed] ArithmeticOperator
src/application/services/text-analysis.service.ts:239:59
     // If no passages found, return the beginning and end of the text
     if (result.length === 0) {
       const beginning = fullText.substring(0, this.MAX_CONTEXT_LENGTH / 2)
-      const ending = fullText.substring(fullText.length - this.MAX_CONTEXT_LENGTH / 2)
+      const ending = fullText.substring(fullText.length - this.MAX_CONTEXT_LENGTH * 2)
       result = beginning + '\n\n[...]\n\n' + ending
     }
killedBy: TextAnalysisService extractRelevantPassages should return beginning and end when no keywords match
statusReason: expected 42509 to be less than or equal to 25009

[Killed] ArithmeticOperator
src/application/services/text-analysis.service.ts:239:41
     // If no passages found, return the beginning and end of the text
     if (result.length === 0) {
       const beginning = fullText.substring(0, this.MAX_CONTEXT_LENGTH / 2)
-      const ending = fullText.substring(fullText.length - this.MAX_CONTEXT_LENGTH / 2)
+      const ending = fullText.substring(fullText.length + this.MAX_CONTEXT_LENGTH / 2)
       result = beginning + '\n\n[...]\n\n' + ending
     }
killedBy: TextAnalysisService extractRelevantPassages should use fallback with correct arithmetic: fullText.length - MAX_CONTEXT_LENGTH/2
statusReason: expected 'AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA…' to contain 'UNIQUEENDSECTION'

[Killed] StringLiteral
src/application/services/text-analysis.service.ts:240:28
     if (result.length === 0) {
       const beginning = fullText.substring(0, this.MAX_CONTEXT_LENGTH / 2)
       const ending = fullText.substring(fullText.length - this.MAX_CONTEXT_LENGTH / 2)
-      result = beginning + '\n\n[...]\n\n' + ending
+      result = beginning + "" + ending
     }
 
killedBy: TextAnalysisService extractRelevantPassages should return beginning and end when no keywords match
statusReason: expected 'AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA…' to contain '[...]'

[Killed] MethodExpression
src/application/services/text-analysis.service.ts:243:12
       result = beginning + '\n\n[...]\n\n' + ending
     }
 
-    return result.trim()
+    return result
   }
 }
killedBy: TextAnalysisService extractRelevantPassages should trim whitespace from extracted passage text
statusReason: expected '\n\n---\n\nalpha   in text here' not to match /^\s/
