[Survived] LogicalOperator
src/infrastructure/database/schema.ts:35:22
 // Define VECTOR custom type for pgvector embeddings
 const vector = customType<{ data: number[]; config: { dimension: number } }>({
   dataType(config) {
-    return `vector(${(config as { dimension: number })?.dimension ?? 1536})`
+    return `vector(${(config as {
+  dimension: number;
+})?.dimension && 1536})`
   },
 })

[Survived] OptionalChaining
src/infrastructure/database/schema.ts:35:22
 // Define VECTOR custom type for pgvector embeddings
 const vector = customType<{ data: number[]; config: { dimension: number } }>({
   dataType(config) {
-    return `vector(${(config as { dimension: number })?.dimension ?? 1536})`
+    return `vector(${(config as {
+  dimension: number;
+}).dimension ?? 1536})`
   },
 })

[Survived] StringLiteral
src/infrastructure/database/schema.ts:39:41
   },
 })
 
-export const companyStatusEnum = pgEnum('customer_status', [
+export const companyStatusEnum = pgEnum("", [
   'prospect',
   'active',

[Killed] StringLiteral
src/infrastructure/database/schema.ts:49:3
 export const contactRoleEnum = pgEnum('contact_role', [
   'primary_contact',
   'decision_maker',
-  'billing_contact',
+  "",
   'technical_contact',
   'stakeholder',
killedBy: Database Schema Enum definitions contactRoleEnum values should include billing_contact role value
statusReason: expected [ 'primary_contact', …(4) ] to include 'billing_contact'

[Killed] StringLiteral
src/infrastructure/database/schema.ts:51:3
   'decision_maker',
   'billing_contact',
   'technical_contact',
-  'stakeholder',
+  "",
 ])
 
killedBy: Database Schema Enum definitions contactRoleEnum values should include stakeholder role value
statusReason: expected [ 'primary_contact', …(4) ] to include 'stakeholder'

[Killed] StringLiteral
src/infrastructure/database/schema.ts:61:21
 export const company = pgTable(
   'company',
   {
-    companyId: uuid('company_id')
+    companyId: uuid("")
       .primaryKey()
       .default(sql`uuidv7()`),
killedBy: Database Schema Table columns company table columns should have companyId column
statusReason: expected 'companyId' to be 'company_id' // Object.is equality

[Survived] StringLiteral
src/infrastructure/database/schema.ts:63:19
   {
     companyId: uuid('company_id')
       .primaryKey()
-      .default(sql`uuidv7()`),
+      .default(sql``),
     legalName: text('legal_name').notNull(),
     displayName: text('display_name').notNull(),

[Survived] StringLiteral
src/infrastructure/database/schema.ts:66:31
       .default(sql`uuidv7()`),
     legalName: text('legal_name').notNull(),
     displayName: text('display_name').notNull(),
-    status: companyStatusEnum('status').notNull().default('active'),
+    status: companyStatusEnum("").notNull().default('active'),
     industry: text('industry'),
     companySize: integer('company_size'),

[Survived] StringLiteral
src/infrastructure/database/schema.ts:67:20
     legalName: text('legal_name').notNull(),
     displayName: text('display_name').notNull(),
     status: companyStatusEnum('status').notNull().default('active'),
-    industry: text('industry'),
+    industry: text(""),
     companySize: integer('company_size'),
     websiteUrl: text('website_url'),

[Killed] StringLiteral
src/infrastructure/database/schema.ts:68:26
     displayName: text('display_name').notNull(),
     status: companyStatusEnum('status').notNull().default('active'),
     industry: text('industry'),
-    companySize: integer('company_size'),
+    companySize: integer(""),
     websiteUrl: text('website_url'),
     billingCountry: char('billing_country', { length: 2 }),
killedBy: Database Schema Table columns company table columns should have companySize column
statusReason: expected 'companySize' to be 'company_size' // Object.is equality

[Killed] StringLiteral
src/infrastructure/database/schema.ts:69:22
     status: companyStatusEnum('status').notNull().default('active'),
     industry: text('industry'),
     companySize: integer('company_size'),
-    websiteUrl: text('website_url'),
+    websiteUrl: text(""),
     billingCountry: char('billing_country', { length: 2 }),
     timezone: text('timezone').notNull().default('UTC'),
killedBy: Database Schema chatTypes table properties (additional) company table columns should have websiteUrl column
statusReason: expected 'websiteUrl' to be 'website_url' // Object.is equality

[Survived] BooleanLiteral
src/infrastructure/database/schema.ts:72:56
     websiteUrl: text('website_url'),
     billingCountry: char('billing_country', { length: 2 }),
     timezone: text('timezone').notNull().default('UTC'),
-    createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
+    createdAt: timestamp('created_at', { withTimezone: false }).notNull().defaultNow(),
     updatedAt: timestamp('updated_at', { withTimezone: true }).notNull().defaultNow(),
     singletonCheck: boolean('singleton_check').notNull().default(true),

[Survived] ObjectLiteral
src/infrastructure/database/schema.ts:72:40
     websiteUrl: text('website_url'),
     billingCountry: char('billing_country', { length: 2 }),
     timezone: text('timezone').notNull().default('UTC'),
-    createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
+    createdAt: timestamp('created_at', {}).notNull().defaultNow(),
     updatedAt: timestamp('updated_at', { withTimezone: true }).notNull().defaultNow(),
     singletonCheck: boolean('singleton_check').notNull().default(true),

[Survived] BooleanLiteral
src/infrastructure/database/schema.ts:73:56
     billingCountry: char('billing_country', { length: 2 }),
     timezone: text('timezone').notNull().default('UTC'),
     createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
-    updatedAt: timestamp('updated_at', { withTimezone: true }).notNull().defaultNow(),
+    updatedAt: timestamp('updated_at', { withTimezone: false }).notNull().defaultNow(),
     singletonCheck: boolean('singleton_check').notNull().default(true),
   },

[Killed] StringLiteral
src/infrastructure/database/schema.ts:73:26
     billingCountry: char('billing_country', { length: 2 }),
     timezone: text('timezone').notNull().default('UTC'),
     createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
-    updatedAt: timestamp('updated_at', { withTimezone: true }).notNull().defaultNow(),
+    updatedAt: timestamp("", { withTimezone: true }).notNull().defaultNow(),
     singletonCheck: boolean('singleton_check').notNull().default(true),
   },
killedBy: Database Schema chatTypes table properties (additional) company table columns should have updatedAt column
statusReason: expected 'updatedAt' to be 'updated_at' // Object.is equality

[Killed] BooleanLiteral
src/infrastructure/database/schema.ts:74:66
     timezone: text('timezone').notNull().default('UTC'),
     createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
     updatedAt: timestamp('updated_at', { withTimezone: true }).notNull().defaultNow(),
-    singletonCheck: boolean('singleton_check').notNull().default(true),
+    singletonCheck: boolean('singleton_check').notNull().default(false),
   },
   (table) => ({
killedBy: Database Schema Column defaults and constraints company table defaults should have singletonCheck column with true default
statusReason: expected false to be true // Object.is equality

[NoCoverage] StringLiteral
src/infrastructure/database/schema.ts:78:7
   },
   (table) => ({
     legalNameLengthCheck: check(
-      'company_legal_name_length_check',
+      "",
       sql`length(trim(${table.legalName})) BETWEEN 2 AND 200`
     ),

[NoCoverage] StringLiteral
src/infrastructure/database/schema.ts:82:7
       sql`length(trim(${table.legalName})) BETWEEN 2 AND 200`
     ),
     displayNameLengthCheck: check(
-      'company_display_name_length_check',
+      "",
       sql`length(trim(${table.displayName})) BETWEEN 2 AND 200`
     ),

[NoCoverage] StringLiteral
src/infrastructure/database/schema.ts:87:10
     ),
     industryLengthCheck: check(
       'company_industry_length_check',
-      sql`${table.industry} IS NULL OR length(${table.industry}) <= 100`
+      sql``
     ),
     companySizeCheck: check(

[NoCoverage] StringLiteral
src/infrastructure/database/schema.ts:99:10
     ),
     billingCountryFormatCheck: check(
       'company_billing_country_format_check',
-      sql`${table.billingCountry} IS NULL OR ${table.billingCountry} ~ '^[A-Z]{2}$'`
+      sql``
     ),
     singletonCheckConstraint: check('company_singleton_check', sql`${table.singletonCheck} = true`),

[NoCoverage] StringLiteral
src/infrastructure/database/schema.ts:101:67
       'company_billing_country_format_check',
       sql`${table.billingCountry} IS NULL OR ${table.billingCountry} ~ '^[A-Z]{2}$'`
     ),
-    singletonCheckConstraint: check('company_singleton_check', sql`${table.singletonCheck} = true`),
+    singletonCheckConstraint: check('company_singleton_check', sql``),
     onlyOneCompany: unique('only_one_company').on(table.singletonCheck),
   })

[NoCoverage] StringLiteral
src/infrastructure/database/schema.ts:101:37
       'company_billing_country_format_check',
       sql`${table.billingCountry} IS NULL OR ${table.billingCountry} ~ '^[A-Z]{2}$'`
     ),
-    singletonCheckConstraint: check('company_singleton_check', sql`${table.singletonCheck} = true`),
+    singletonCheckConstraint: check("", sql`${table.singletonCheck} = true`),
     onlyOneCompany: unique('only_one_company').on(table.singletonCheck),
   })

[NoCoverage] StringLiteral
src/infrastructure/database/schema.ts:102:28
       sql`${table.billingCountry} IS NULL OR ${table.billingCountry} ~ '^[A-Z]{2}$'`
     ),
     singletonCheckConstraint: check('company_singleton_check', sql`${table.singletonCheck} = true`),
-    onlyOneCompany: unique('only_one_company').on(table.singletonCheck),
+    onlyOneCompany: unique("").on(table.singletonCheck),
   })
 )

[Killed] StringLiteral
src/infrastructure/database/schema.ts:111:3
  */
 
 export const keyPerson = pgTable(
-  'key_person',
+  "",
   {
     keyPersonId: uuid('person_id')
killedBy: Database Schema Table names should have correct table name for key_person
statusReason: expected '' to be 'key_person' // Object.is equality

[Killed] StringLiteral
src/infrastructure/database/schema.ts:116:21
     keyPersonId: uuid('person_id')
       .primaryKey()
       .default(sql`uuidv7()`),
-    firstName: text('first_name').notNull(),
+    firstName: text("").notNull(),
     lastName: text('last_name').notNull(),
     email: citext('email'),
killedBy: Database Schema chatTypes table properties (additional) keyPerson table columns should have firstName column
statusReason: expected 'firstName' to be 'first_name' // Object.is equality

[Killed] StringLiteral
src/infrastructure/database/schema.ts:120:20
     lastName: text('last_name').notNull(),
     email: citext('email'),
     phone: text('phone'),
-    jobTitle: text('job_title'),
+    jobTitle: text(""),
     isActive: boolean('is_active').default(true),
     createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
killedBy: Database Schema chatTypes table properties (additional) keyPerson table columns should have jobTitle column
statusReason: expected 'jobTitle' to be 'job_title' // Object.is equality

[Survived] BooleanLiteral
src/infrastructure/database/schema.ts:121:44
     email: citext('email'),
     phone: text('phone'),
     jobTitle: text('job_title'),
-    isActive: boolean('is_active').default(true),
+    isActive: boolean('is_active').default(false),
     createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
     // Note: updatedAt is automatically maintained by a database trigger (see norberts_schema.sql).

[Survived] BooleanLiteral
src/infrastructure/database/schema.ts:122:56
     phone: text('phone'),
     jobTitle: text('job_title'),
     isActive: boolean('is_active').default(true),
-    createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
+    createdAt: timestamp('created_at', { withTimezone: false }).notNull().defaultNow(),
     // Note: updatedAt is automatically maintained by a database trigger (see norberts_schema.sql).
     // The defaultNow() here only sets the initial value on INSERT.

[Survived] ObjectLiteral
src/infrastructure/database/schema.ts:122:40
     phone: text('phone'),
     jobTitle: text('job_title'),
     isActive: boolean('is_active').default(true),
-    createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
+    createdAt: timestamp('created_at', {}).notNull().defaultNow(),
     // Note: updatedAt is automatically maintained by a database trigger (see norberts_schema.sql).
     // The defaultNow() here only sets the initial value on INSERT.

[Survived] BooleanLiteral
src/infrastructure/database/schema.ts:126:56
     // Note: updatedAt is automatically maintained by a database trigger (see norberts_schema.sql).
     // The defaultNow() here only sets the initial value on INSERT.
     // On UPDATE operations, the touch_updated_at() trigger function automatically updates this column.
-    updatedAt: timestamp('updated_at', { withTimezone: true }).notNull().defaultNow(),
+    updatedAt: timestamp('updated_at', { withTimezone: false }).notNull().defaultNow(),
   },
   (table) => ({

[Survived] ObjectLiteral
src/infrastructure/database/schema.ts:126:40
     // Note: updatedAt is automatically maintained by a database trigger (see norberts_schema.sql).
     // The defaultNow() here only sets the initial value on INSERT.
     // On UPDATE operations, the touch_updated_at() trigger function automatically updates this column.
-    updatedAt: timestamp('updated_at', { withTimezone: true }).notNull().defaultNow(),
+    updatedAt: timestamp('updated_at', {}).notNull().defaultNow(),
   },
   (table) => ({

[NoCoverage] StringLiteral
src/infrastructure/database/schema.ts:132:10
     uniqueEmail: unique('people_unique_email').on(table.email),
     firstNameLengthCheck: check(
       'key_person_first_name_length_check',
-      sql`length(trim(${table.firstName})) BETWEEN 1 AND 100`
+      sql``
     ),
     lastNameLengthCheck: check(

[Killed] StringLiteral
src/infrastructure/database/schema.ts:160:27
 export const companyPeople = pgTable(
   'company_people',
   {
-    companyPersonId: uuid('company_person_id')
+    companyPersonId: uuid("")
       .primaryKey()
       .default(sql`uuidv7()`),
killedBy: Database Schema chatTypes table properties (additional) companyPeople table columns should have companyPersonId column
statusReason: expected 'companyPersonId' to be 'company_person_id' // Object.is equality

[Survived] BooleanLiteral
src/infrastructure/database/schema.ts:174:46
         onDelete: 'cascade',
       }),
     role: contactRoleEnum('role'),
-    isPrimary: boolean('is_primary').default(false),
+    isPrimary: boolean('is_primary').default(true),
     startDate: date('start_date').default(sql`CURRENT_DATE`),
     endDate: date('end_date'),

[Survived] BooleanLiteral
src/infrastructure/database/schema.ts:177:56
     isPrimary: boolean('is_primary').default(false),
     startDate: date('start_date').default(sql`CURRENT_DATE`),
     endDate: date('end_date'),
-    createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
+    createdAt: timestamp('created_at', { withTimezone: false }).notNull().defaultNow(),
   },
   (table) => ({

[NoCoverage] StringLiteral
src/infrastructure/database/schema.ts:189:7
       .on(table.companyId)
       .where(sql`is_primary = true`),
     endDateAfterStartDate: check(
-      'company_people_end_date_check',
+      "",
       sql`${table.endDate} IS NULL OR ${table.endDate} >= ${table.startDate}`
     ),

[Killed] StringLiteral
src/infrastructure/database/schema.ts:198:46
 /**
  * Data retrieval messages: logical messages returned by AI extraction
  */
-export const dataRetrievalMessages = pgTable('data_retrieval_messages', {
+export const dataRetrievalMessages = pgTable("", {
   id: uuid('id')
     .primaryKey()
killedBy: Database Schema Table names should have correct table name for data_retrieval_messages
statusReason: expected '' to be 'data_retrieval_messages' // Object.is equality

[Survived] BooleanLiteral
src/infrastructure/database/schema.ts:202:54
   id: uuid('id')
     .primaryKey()
     .default(sql`uuidv7()`),
-  createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
+  createdAt: timestamp('created_at', { withTimezone: false }).notNull().defaultNow(),
 })
 

[Killed] StringLiteral
src/infrastructure/database/schema.ts:202:24
   id: uuid('id')
     .primaryKey()
     .default(sql`uuidv7()`),
-  createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
+  createdAt: timestamp("", { withTimezone: true }).notNull().defaultNow(),
 })
 
killedBy: Database Schema chatTypes table properties (additional) dataRetrievalMessages table columns should have createdAt column
statusReason: expected 'createdAt' to be 'created_at' // Object.is equality

[Killed] StringLiteral
src/infrastructure/database/schema.ts:212:3
  * DATA RETRIEVAL MESSAGE PARTS
  */
 export const dataRetrievalMessageParts = pgTable(
-  'data_retrieval_message_parts',
+  "",
   {
     id: uuid('id')
killedBy: Database Schema Table names should have correct table name for data_retrieval_message_parts
statusReason: expected '' to be 'data_retrieval_message_parts' // Object.is equality

[Survived] StringLiteral
src/infrastructure/database/schema.ts:214:14
 export const dataRetrievalMessageParts = pgTable(
   'data_retrieval_message_parts',
   {
-    id: uuid('id')
+    id: uuid("")
       .primaryKey()
       .default(sql`uuidv7()`),

[Survived] ObjectLiteral
src/infrastructure/database/schema.ts:222:27
       .references(() => dataRetrievalMessages.id, {
         onDelete: 'cascade',
       }),
-    type: varchar('type', { length: 20 }).notNull(),
+    type: varchar('type', {}).notNull(),
     textJson: jsonb('text_json'),
     createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),

[Killed] StringLiteral
src/infrastructure/database/schema.ts:223:21
         onDelete: 'cascade',
       }),
     type: varchar('type', { length: 20 }).notNull(),
-    textJson: jsonb('text_json'),
+    textJson: jsonb(""),
     createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
   },
killedBy: Database Schema chatTypes table properties (additional) dataRetrievalMessageParts table columns should have textJson column
statusReason: expected 'textJson' to be 'text_json' // Object.is equality

[Survived] BooleanLiteral
src/infrastructure/database/schema.ts:224:56
       }),
     type: varchar('type', { length: 20 }).notNull(),
     textJson: jsonb('text_json'),
-    createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
+    createdAt: timestamp('created_at', { withTimezone: false }).notNull().defaultNow(),
   },
   (table) => ({

[Survived] ObjectLiteral
src/infrastructure/database/schema.ts:224:40
       }),
     type: varchar('type', { length: 20 }).notNull(),
     textJson: jsonb('text_json'),
-    createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
+    createdAt: timestamp('created_at', {}).notNull().defaultNow(),
   },
   (table) => ({

[NoCoverage] ObjectLiteral
src/infrastructure/database/schema.ts:254:95
 
 export type DBDataRetrievalMessagePartSelect = typeof dataRetrievalMessageParts.$inferSelect
 
-export const dataRetrievalMessagesRelations = relations(dataRetrievalMessages, ({ many }) => ({
-  parts: many(dataRetrievalMessageParts),
-}))
+export const dataRetrievalMessagesRelations = relations(dataRetrievalMessages, ({ many }) => ({}))
 
 export const dataRetrievalMessagePartsRelations = relations(

[NoCoverage] ObjectLiteral
src/infrastructure/database/schema.ts:280:78
   companies: many(companyPeople),
 }))
 
-export const companyPeopleRelations = relations(companyPeople, ({ one }) => ({
-  company: one(company, {
-    fields: [companyPeople.companyId],
-    references: [company.companyId],
-  }),
-  person: one(keyPerson, {
-    fields: [companyPeople.personId],
-    references: [keyPerson.keyPersonId],
-  }),
-}))
+export const companyPeopleRelations = relations(companyPeople, ({ one }) => ({}))
 
 export type DBCompany = typeof company.$inferInsert

[Killed] StringLiteral
src/infrastructure/database/schema.ts:304:3
  * Documents table: Tracks document metadata with status tracking
  */
 export const documents = pgTable(
-  'documents',
+  "",
   {
     id: uuid('id')
killedBy: Database Schema Table names should have correct table name for documents
statusReason: expected '' to be 'documents' // Object.is equality

[Survived] StringLiteral
src/infrastructure/database/schema.ts:312:18
     title: text('title').notNull(),
     source: text('source').notNull(),
     checksum: text('checksum'),
-    status: text('status')
+    status: text("")
       .notNull()
       .default('processing')

[Survived] BooleanLiteral
src/infrastructure/database/schema.ts:316:56
       .notNull()
       .default('processing')
       .$type<'processing' | 'indexed' | 'failed' | 'archived'>(),
-    createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
+    createdAt: timestamp('created_at', { withTimezone: false }).notNull().defaultNow(),
     updatedAt: timestamp('updated_at', { withTimezone: true }).notNull().defaultNow(),
   },

[Survived] ObjectLiteral
src/infrastructure/database/schema.ts:316:40
       .notNull()
       .default('processing')
       .$type<'processing' | 'indexed' | 'failed' | 'archived'>(),
-    createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
+    createdAt: timestamp('created_at', {}).notNull().defaultNow(),
     updatedAt: timestamp('updated_at', { withTimezone: true }).notNull().defaultNow(),
   },

[NoCoverage] StringLiteral
src/infrastructure/database/schema.ts:325:7
       sql`${table.status} IN ('processing', 'indexed', 'failed', 'archived')`
     ),
     titleNotEmptyCheck: check(
-      'documents_title_not_empty_check',
+      "",
       sql`length(trim(${table.title})) > 0`
     ),

[NoCoverage] StringLiteral
src/infrastructure/database/schema.ts:330:17
     ),
     checksumIdx: index('documents_checksum_idx')
       .on(table.checksum)
-      .where(sql`${table.checksum} IS NOT NULL`),
+      .where(sql``),
   })
 )

[Killed] StringLiteral
src/infrastructure/database/schema.ts:349:26
     name: text('name').notNull(),
     provider: text('provider').notNull(),
     status: text('status').notNull(),
-    releaseYear: integer('release_year').notNull(),
+    releaseYear: integer("").notNull(),
     recommendedUsage: text('recommended_usage').notNull(),
     taskType: text('task_type'),
killedBy: Database Schema chatTypes table properties (additional) embeddingModels table columns should have releaseYear column
statusReason: expected 'releaseYear' to be 'release_year' // Object.is equality

[Survived] StringLiteral
src/infrastructure/database/schema.ts:352:24
     releaseYear: integer('release_year').notNull(),
     recommendedUsage: text('recommended_usage').notNull(),
     taskType: text('task_type'),
-    dimension: integer('dimension').notNull(),
+    dimension: integer("").notNull(),
     createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
     updatedAt: timestamp('updated_at', { withTimezone: true }).notNull().defaultNow(),

[Survived] BooleanLiteral
src/infrastructure/database/schema.ts:353:56
     recommendedUsage: text('recommended_usage').notNull(),
     taskType: text('task_type'),
     dimension: integer('dimension').notNull(),
-    createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
+    createdAt: timestamp('created_at', { withTimezone: false }).notNull().defaultNow(),
     updatedAt: timestamp('updated_at', { withTimezone: true }).notNull().defaultNow(),
   },

[Survived] ObjectLiteral
src/infrastructure/database/schema.ts:353:40
     recommendedUsage: text('recommended_usage').notNull(),
     taskType: text('task_type'),
     dimension: integer('dimension').notNull(),
-    createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
+    createdAt: timestamp('created_at', {}).notNull().defaultNow(),
     updatedAt: timestamp('updated_at', { withTimezone: true }).notNull().defaultNow(),
   },

[Killed] StringLiteral
src/infrastructure/database/schema.ts:358:7
   },
   (table) => ({
     uniqueNameProviderDimensionTaskType: unique(
-      'embedding_models_name_provider_dimension_task_type_unique'
+      ""
     )
       .on(table.name, table.provider, table.dimension, table.taskType)
killedBy: Database Schema embeddingModels constraints should have NULLS NOT DISTINCT unique constraint on (name, provider, dimension, taskType)
statusReason: expected undefined to be defined

[Survived] StringLiteral
src/infrastructure/database/schema.ts:365:10
     uniqueIdDimension: unique('embedding_models_id_dimension_unique').on(table.id, table.dimension),
     nameNotEmptyCheck: check(
       'embedding_models_name_not_empty_check',
-      sql`length(trim(${table.name})) > 0`
+      sql``
     ),
     providerValuesCheck: check(

[Survived] StringLiteral
src/infrastructure/database/schema.ts:369:10
     ),
     providerValuesCheck: check(
       'embedding_models_provider_values_check',
-      sql`${table.provider} IN ('openai', 'google', 'cohere', 'amazon', 'voyage', 'mistral')`
+      sql``
     ),
     statusCheck: check(

[Killed] StringLiteral
src/infrastructure/database/schema.ts:376:7
       sql`${table.status} IN ('current', 'legacy', 'deprecated', 'experimental')`
     ),
     releaseYearCheck: check(
-      'embedding_models_release_year_check',
+      "",
       sql`${table.releaseYear} >= 2000 AND ${table.releaseYear} <= EXTRACT(YEAR FROM now())::INTEGER + 1`
     ),
killedBy: Database Schema embeddingModels constraints should enforce releaseYear range via CHECK constraint
statusReason: expected undefined to be defined

[Killed] StringLiteral
src/infrastructure/database/schema.ts:380:7
       sql`${table.releaseYear} >= 2000 AND ${table.releaseYear} <= EXTRACT(YEAR FROM now())::INTEGER + 1`
     ),
     recommendedUsageNotEmptyCheck: check(
-      'embedding_models_recommended_usage_not_empty_check',
+      "",
       sql`length(trim(${table.recommendedUsage})) > 0`
     ),
killedBy: Database Schema embeddingModels constraints should enforce non-empty recommendedUsage via CHECK constraint
statusReason: expected undefined to be defined

[Killed] StringLiteral
src/infrastructure/database/schema.ts:388:7
       sql`${table.dimension} IN (384, 768, 1024, 1536, 3072)`
     ),
     taskTypeValuesCheck: check(
-      'embedding_models_task_type_values_check',
+      "",
     ),
killedBy: Database Schema embeddingModels constraints should enforce taskType allowed values via CHECK constraint
statusReason: expected undefined to be defined

[Survived] StringLiteral
src/infrastructure/database/schema.ts:413:16
     name: text('name').notNull(),
     password: text('password'),
     email: citext('email').notNull().unique(),
-    role: text('role').notNull().default('user'),
+    role: text("").notNull().default('user'),
     provider: text('provider'),
     providerId: text('provider_id'),

[Killed] BooleanLiteral
src/infrastructure/database/schema.ts:416:71
     role: text('role').notNull().default('user'),
     provider: text('provider'),
     providerId: text('provider_id'),
-    twoFactorEnabled: boolean('two_factor_enabled').notNull().default(false),
+    twoFactorEnabled: boolean('two_factor_enabled').notNull().default(true),
     twoFactorSecret: text('two_factor_secret'),
     createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
killedBy: Database Schema Column defaults and constraints user table defaults should have twoFactorEnabled column with false default
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
src/infrastructure/database/schema.ts:416:31
     role: text('role').notNull().default('user'),
     provider: text('provider'),
     providerId: text('provider_id'),
-    twoFactorEnabled: boolean('two_factor_enabled').notNull().default(false),
+    twoFactorEnabled: boolean("").notNull().default(false),
     twoFactorSecret: text('two_factor_secret'),
     createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
killedBy: Database Schema Table columns user table columns should have twoFactorEnabled column
statusReason: expected 'twoFactorEnabled' to be 'two_factor_enabled' // Object.is equality

[Killed] StringLiteral
src/infrastructure/database/schema.ts:417:27
     provider: text('provider'),
     providerId: text('provider_id'),
     twoFactorEnabled: boolean('two_factor_enabled').notNull().default(false),
-    twoFactorSecret: text('two_factor_secret'),
+    twoFactorSecret: text(""),
     createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
     updatedAt: timestamp('updated_at', { withTimezone: true }).notNull().defaultNow(),
killedBy: Database Schema Table columns user table columns should have twoFactorSecret column
statusReason: expected 'twoFactorSecret' to be 'two_factor_secret' // Object.is equality
