[Survived] BooleanLiteral
src/infrastructure/database/schema.ts:418:56
     providerId: text('provider_id'),
     twoFactorEnabled: boolean('two_factor_enabled').notNull().default(false),
     twoFactorSecret: text('two_factor_secret'),
-    createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
+    createdAt: timestamp('created_at', { withTimezone: false }).notNull().defaultNow(),
     updatedAt: timestamp('updated_at', { withTimezone: true }).notNull().defaultNow(),
   },

[NoCoverage] ObjectLiteral
src/infrastructure/database/schema.ts:421:15
     createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
     updatedAt: timestamp('updated_at', { withTimezone: true }).notNull().defaultNow(),
   },
-  (table) => ({
-    providerCheck: check('provider_check', sql`${table.provider} IN ('google')`),
-    passwordLengthCheck: check(
-      'password_length_check',
-      sql`${table.password} IS NULL OR length(${table.password}) = 60`
-    ),
-    roleCheck: check('role_check', sql`${table.role} IN ('user', 'admin', 'moderator')`),
-    nameLengthCheck: check(
-      'name_length_check',
-      sql`length(${table.name}) >= 2 AND length(${table.name}) <= 100`
-    ),
-  })
+  (table) => ({})
 )
 

[NoCoverage] StringLiteral
src/infrastructure/database/schema.ts:422:47
     updatedAt: timestamp('updated_at', { withTimezone: true }).notNull().defaultNow(),
   },
   (table) => ({
-    providerCheck: check('provider_check', sql`${table.provider} IN ('google')`),
+    providerCheck: check('provider_check', sql``),
     passwordLengthCheck: check(
       'password_length_check',

[Killed] StringLiteral
src/infrastructure/database/schema.ts:457:3
  * - Auditing: IP address and user agent are captured at creation time
  */
 export const refreshTokens = pgTable(
-  'refresh_tokens',
+  "",
   {
     id: uuid('id')
killedBy: Database Schema Table names should have correct table name for refresh_tokens
statusReason: expected '' to be 'refresh_tokens' // Object.is equality

[Survived] ObjectLiteral
src/infrastructure/database/schema.ts:464:38
       .default(sql`uuidv7()`),
     userId: uuid('user_id')
       .notNull()
-      .references(() => user.userId, { onDelete: 'cascade' }),
+      .references(() => user.userId, {}),
     /**
      * SHA-256 hash of the refresh token.

[Survived] BooleanLiteral
src/infrastructure/database/schema.ts:476:56
      * If a revoked token is reused (replay attack), all tokens in the family are revoked.
      */
     tokenFamily: uuid('token_family').notNull(),
-    expiresAt: timestamp('expires_at', { withTimezone: true }).notNull(),
+    expiresAt: timestamp('expires_at', { withTimezone: false }).notNull(),
     revokedAt: timestamp('revoked_at', { withTimezone: true }),
     createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),

[Killed] StringLiteral
src/infrastructure/database/schema.ts:476:26
      * If a revoked token is reused (replay attack), all tokens in the family are revoked.
      */
     tokenFamily: uuid('token_family').notNull(),
-    expiresAt: timestamp('expires_at', { withTimezone: true }).notNull(),
+    expiresAt: timestamp("", { withTimezone: true }).notNull(),
     revokedAt: timestamp('revoked_at', { withTimezone: true }),
     createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
killedBy: Database Schema Table columns refreshTokens table columns should have expiresAt column
statusReason: expected 'expiresAt' to be 'expires_at' // Object.is equality

[Survived] BooleanLiteral
src/infrastructure/database/schema.ts:477:56
      */
     tokenFamily: uuid('token_family').notNull(),
     expiresAt: timestamp('expires_at', { withTimezone: true }).notNull(),
-    revokedAt: timestamp('revoked_at', { withTimezone: true }),
+    revokedAt: timestamp('revoked_at', { withTimezone: false }),
     createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
     /**

[Survived] ObjectLiteral
src/infrastructure/database/schema.ts:477:40
      */
     tokenFamily: uuid('token_family').notNull(),
     expiresAt: timestamp('expires_at', { withTimezone: true }).notNull(),
-    revokedAt: timestamp('revoked_at', { withTimezone: true }),
+    revokedAt: timestamp('revoked_at', {}),
     createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
     /**

[Survived] BooleanLiteral
src/infrastructure/database/schema.ts:478:56
     tokenFamily: uuid('token_family').notNull(),
     expiresAt: timestamp('expires_at', { withTimezone: true }).notNull(),
     revokedAt: timestamp('revoked_at', { withTimezone: true }),
-    createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
+    createdAt: timestamp('created_at', { withTimezone: false }).notNull().defaultNow(),
     /**
      * Updated each time the token is used to refresh an access token.

[Survived] BooleanLiteral
src/infrastructure/database/schema.ts:483:59
      * Updated each time the token is used to refresh an access token.
      * Useful for detecting suspicious patterns (e.g., token used from multiple locations).
      */
-    lastUsedAt: timestamp('last_used_at', { withTimezone: true }),
+    lastUsedAt: timestamp('last_used_at', { withTimezone: false }),
     /**
      * IP address at token creation time (optional, for security auditing).

[Killed] StringLiteral
src/infrastructure/database/schema.ts:483:27
      * Updated each time the token is used to refresh an access token.
      * Useful for detecting suspicious patterns (e.g., token used from multiple locations).
      */
-    lastUsedAt: timestamp('last_used_at', { withTimezone: true }),
+    lastUsedAt: timestamp("", { withTimezone: true }),
     /**
      * IP address at token creation time (optional, for security auditing).
killedBy: Database Schema Table columns refreshTokens table columns should have lastUsedAt column
statusReason: expected 'lastUsedAt' to be 'last_used_at' // Object.is equality

[Killed] StringLiteral
src/infrastructure/database/schema.ts:493:21
     /**
      * User agent at token creation time (optional, for security auditing).
      */
-    userAgent: text('user_agent'),
+    userAgent: text(""),
   },
   (table) => ({
killedBy: Database Schema Table columns refreshTokens table columns should have userAgent column
statusReason: expected 'userAgent' to be 'user_agent' // Object.is equality

[NoCoverage] ObjectLiteral
src/infrastructure/database/schema.ts:495:15
      */
     userAgent: text('user_agent'),
   },
-  (table) => ({
-    userIdIdx: index('refresh_tokens_user_id_idx').on(table.userId),
-    tokenFamilyIdx: index('refresh_tokens_token_family_idx').on(table.tokenFamily),
-    /**
-     * Partial index for efficient cleanup of expired, non-revoked tokens.
-     * Only indexes rows where revoked_at IS NULL to reduce index size.
-     */
-    expiresAtIdx: index('refresh_tokens_expires_at_idx')
-      .on(table.expiresAt)
-      .where(sql`${table.revokedAt} IS NULL`),
-  })
+  (table) => ({})
 )
 

[NoCoverage] StringLiteral
src/infrastructure/database/schema.ts:497:27
   },
   (table) => ({
     userIdIdx: index('refresh_tokens_user_id_idx').on(table.userId),
-    tokenFamilyIdx: index('refresh_tokens_token_family_idx').on(table.tokenFamily),
+    tokenFamilyIdx: index("").on(table.tokenFamily),
     /**
      * Partial index for efficient cleanup of expired, non-revoked tokens.

[NoCoverage] StringLiteral
src/infrastructure/database/schema.ts:502:25
      * Partial index for efficient cleanup of expired, non-revoked tokens.
      * Only indexes rows where revoked_at IS NULL to reduce index size.
      */
-    expiresAtIdx: index('refresh_tokens_expires_at_idx')
+    expiresAtIdx: index("")
       .on(table.expiresAt)
       .where(sql`${table.revokedAt} IS NULL`),

[Killed] StringLiteral
src/infrastructure/database/schema.ts:533:28
      * Identifier of the embedding model used to generate this embedding.
      * Foreign key to embedding_models table.
      */
-    embeddingModelId: uuid('embedding_model_id').notNull(),
+    embeddingModelId: uuid("").notNull(),
     embeddingDimension: integer('embedding_dimension').notNull().default(1536),
     /**
killedBy: Database Schema vectorEmbeddings tables vectorEmbeddings1536 columns should have embeddingModelId column
statusReason: expected 'embeddingModelId' to be 'embedding_model_id' // Object.is equality

[Killed] StringLiteral
src/infrastructure/database/schema.ts:534:33
      * Foreign key to embedding_models table.
      */
     embeddingModelId: uuid('embedding_model_id').notNull(),
-    embeddingDimension: integer('embedding_dimension').notNull().default(1536),
+    embeddingDimension: integer("").notNull().default(1536),
     /**
      * Position of this chunk within its document, used to reconstruct ordering.
killedBy: Database Schema vectorEmbeddings tables vectorEmbeddings1536 columns should have embeddingDimension column
statusReason: expected 'embeddingDimension' to be 'embedding_dimension' // Object.is equality

[Killed] StringLiteral
src/infrastructure/database/schema.ts:538:25
     /**
      * Position of this chunk within its document, used to reconstruct ordering.
      */
-    chunkIndex: integer('chunk_index').notNull().default(0),
+    chunkIndex: integer("").notNull().default(0),
     content: text('content').notNull(),
     /**
killedBy: Database Schema vectorEmbeddings tables vectorEmbeddings1536 columns should have chunkIndex column
statusReason: expected 'chunkIndex' to be 'chunk_index' // Object.is equality

[Survived] StringLiteral
src/infrastructure/database/schema.ts:539:19
      * Position of this chunk within its document, used to reconstruct ordering.
      */
     chunkIndex: integer('chunk_index').notNull().default(0),
-    content: text('content').notNull(),
+    content: text("").notNull(),
     /**
      * Flexible metadata about the chunk/document (page, section, author, etc.).

[Killed] StringLiteral
src/infrastructure/database/schema.ts:567:27
     /**
      * Number of overlapping tokens (or characters) between consecutive chunks.
      */
-    chunkOverlap: integer('chunk_overlap').notNull().default(120),
+    chunkOverlap: integer("").notNull().default(120),
     createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
     updatedAt: timestamp('updated_at', { withTimezone: true }).notNull().defaultNow(),
killedBy: Database Schema vectorEmbeddings tables vectorEmbeddings1536 columns should have chunkOverlap column
statusReason: expected 'chunkOverlap' to be 'chunk_overlap' // Object.is equality

[Survived] BooleanLiteral
src/infrastructure/database/schema.ts:568:56
      * Number of overlapping tokens (or characters) between consecutive chunks.
      */
     chunkOverlap: integer('chunk_overlap').notNull().default(120),
-    createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
+    createdAt: timestamp('created_at', { withTimezone: false }).notNull().defaultNow(),
     updatedAt: timestamp('updated_at', { withTimezone: true }).notNull().defaultNow(),
   },

[Survived] ObjectLiteral
src/infrastructure/database/schema.ts:568:40
      * Number of overlapping tokens (or characters) between consecutive chunks.
      */
     chunkOverlap: integer('chunk_overlap').notNull().default(120),
-    createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
+    createdAt: timestamp('created_at', {}).notNull().defaultNow(),
     updatedAt: timestamp('updated_at', { withTimezone: true }).notNull().defaultNow(),
   },

[Survived] StringLiteral
src/infrastructure/database/schema.ts:580:32
       table.documentId,
       table.chunkIndex
     ),
-    embeddingModelIdIdx: index('vector_embeddings_1536_embedding_model_id_idx').on(
+    embeddingModelIdIdx: index("").on(
       table.embeddingModelId
     ),

[Survived] StringLiteral
src/infrastructure/database/schema.ts:593:7
       sql`length(${table.content}) >= 1 AND length(${table.content}) <= 50000`
     ),
     chunkParamsCheck: check(
-      'vector_embeddings_1536_chunk_params_check',
+      "",
       sql`${table.chunkSize} > 0 AND ${table.chunkSize} <= 50000 AND ${table.chunkOverlap} >= 0 AND ${table.chunkOverlap} < ${table.chunkSize}`
     ),

[Survived] StringLiteral
src/infrastructure/database/schema.ts:598:10
     ),
     embeddingDimensionCheck: check(
       'vector_embeddings_1536_embedding_dimension_check',
-      sql`${table.embeddingDimension} = 1536`
+      sql``
     ),
     embeddingModelCompositeFk: foreignKey({

[Killed] StringLiteral
src/infrastructure/database/schema.ts:621:22
      * Identifier of the source document this chunk/embedding belongs to.
      * Foreign key to documents table.
      */
-    documentId: uuid('document_id')
+    documentId: uuid("")
       .notNull()
       .references(() => documents.id, {
killedBy: Database Schema vectorEmbeddings tables vectorEmbeddings768 columns should have documentId column
statusReason: expected 'documentId' to be 'document_id' // Object.is equality

[Survived] StringLiteral
src/infrastructure/database/schema.ts:641:21
      * Flexible metadata about the chunk/document (page, section, author, etc.).
      * Stored as JSONB with an empty-object default for backwards compatibility.
      */
-    metadata: jsonb('metadata')
+    metadata: jsonb("")
       .notNull()
       .default(sql`'{}'::jsonb`),

[Survived] StringLiteral
src/infrastructure/database/schema.ts:654:23
      * Cons:
      * Slightly more storage + compute
      */
-    embedding: vector('embedding', { dimension: 768 }).notNull(),
+    embedding: vector("", { dimension: 768 }).notNull(),
     /**
      * Number of tokens (or characters) in each chunk.

[Survived] StringLiteral
src/infrastructure/database/schema.ts:667:31
     updatedAt: timestamp('updated_at', { withTimezone: true }).notNull().defaultNow(),
   },
   (table) => ({
-    embeddingCosineIdx: index('vector_embeddings_768_embedding_cosine_idx').using(
+    embeddingCosineIdx: index("").using(
       'ivfflat',
       table.embedding.asc().op('vector_cosine_ops')

[Survived] StringLiteral
src/infrastructure/database/schema.ts:671:29
       'ivfflat',
       table.embedding.asc().op('vector_cosine_ops')
     ),
-    documentChunkIdx: index('vector_embeddings_768_document_chunk_idx').on(
+    documentChunkIdx: index("").on(
       table.documentId,
       table.chunkIndex

[Survived] StringLiteral
src/infrastructure/database/schema.ts:675:32
       table.documentId,
       table.chunkIndex
     ),
-    embeddingModelIdIdx: index('vector_embeddings_768_embedding_model_id_idx').on(
+    embeddingModelIdIdx: index("").on(
       table.embeddingModelId
     ),

[Survived] StringLiteral
src/infrastructure/database/schema.ts:678:38
     embeddingModelIdIdx: index('vector_embeddings_768_embedding_model_id_idx').on(
       table.embeddingModelId
     ),
-    uniqueDocumentModelChunk: unique('vector_embeddings_768_document_model_chunk_unique').on(
+    uniqueDocumentModelChunk: unique("").on(
       table.documentId,
       table.embeddingModelId,

[Survived] StringLiteral
src/infrastructure/database/schema.ts:688:7
       sql`length(${table.content}) >= 1 AND length(${table.content}) <= 50000`
     ),
     chunkParamsCheck: check(
-      'vector_embeddings_768_chunk_params_check',
+      "",
       sql`${table.chunkSize} > 0 AND ${table.chunkSize} <= 50000 AND ${table.chunkOverlap} >= 0 AND ${table.chunkOverlap} < ${table.chunkSize}`
     ),

[Survived] StringLiteral
src/infrastructure/database/schema.ts:689:10
     ),
     chunkParamsCheck: check(
       'vector_embeddings_768_chunk_params_check',
-      sql`${table.chunkSize} > 0 AND ${table.chunkSize} <= 50000 AND ${table.chunkOverlap} >= 0 AND ${table.chunkOverlap} < ${table.chunkSize}`
+      sql``
     ),
     embeddingDimensionCheck: check(

[Killed] StringLiteral
src/infrastructure/database/schema.ts:726:33
      */
     embeddingModelId: uuid('embedding_model_id').notNull(),
     // NOTE: SQL schema previously had DEFAULT 3072 / CHECK (= 3072) here — copy-paste error from vector_embeddings_3072.
-    embeddingDimension: integer('embedding_dimension').notNull().default(384),
+    embeddingDimension: integer("").notNull().default(384),
     /**
      * Position of this chunk within its document, used to reconstruct ordering.
killedBy: Database Schema vectorEmbeddings tables vectorEmbeddings384 columns should have embeddingDimension column
statusReason: expected 'embeddingDimension' to be 'embedding_dimension' // Object.is equality

[Survived] StringLiteral
src/infrastructure/database/schema.ts:738:19
      */
     metadata: jsonb('metadata')
       .notNull()
-      .default(sql`'{}'::jsonb`),
+      .default(sql``),
     /**
      * Vector embedding representation of the content

[Killed] StringLiteral
src/infrastructure/database/schema.ts:764:26
      * Number of overlapping tokens (or characters) between consecutive chunks.
      */
     chunkOverlap: integer('chunk_overlap').notNull().default(120),
-    createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
+    createdAt: timestamp("", { withTimezone: true }).notNull().defaultNow(),
     updatedAt: timestamp('updated_at', { withTimezone: true }).notNull().defaultNow(),
   },
killedBy: Database Schema vectorEmbeddings tables vectorEmbeddings384 columns should have createdAt column
statusReason: expected 'createdAt' to be 'created_at' // Object.is equality

[Survived] StringLiteral
src/infrastructure/database/schema.ts:768:31
     updatedAt: timestamp('updated_at', { withTimezone: true }).notNull().defaultNow(),
   },
   (table) => ({
-    embeddingCosineIdx: index('vector_embeddings_384_embedding_cosine_idx').using(
+    embeddingCosineIdx: index("").using(
       'ivfflat',
       table.embedding.asc().op('vector_cosine_ops')

[Survived] StringLiteral
src/infrastructure/database/schema.ts:772:29
       'ivfflat',
       table.embedding.asc().op('vector_cosine_ops')
     ),
-    documentChunkIdx: index('vector_embeddings_384_document_chunk_idx').on(
+    documentChunkIdx: index("").on(
       table.documentId,
       table.chunkIndex

[Survived] StringLiteral
src/infrastructure/database/schema.ts:776:32
       table.documentId,
       table.chunkIndex
     ),
-    embeddingModelIdIdx: index('vector_embeddings_384_embedding_model_id_idx').on(
+    embeddingModelIdIdx: index("").on(
       table.embeddingModelId
     ),

[Survived] StringLiteral
src/infrastructure/database/schema.ts:785:7
       table.chunkIndex
     ),
     contentLengthCheck: check(
-      'vector_embeddings_384_content_length_check',
+      "",
       sql`length(${table.content}) >= 1 AND length(${table.content}) <= 50000`
     ),

[Survived] StringLiteral
src/infrastructure/database/schema.ts:789:7
       sql`length(${table.content}) >= 1 AND length(${table.content}) <= 50000`
     ),
     chunkParamsCheck: check(
-      'vector_embeddings_384_chunk_params_check',
+      "",
       sql`${table.chunkSize} > 0 AND ${table.chunkSize} <= 50000 AND ${table.chunkOverlap} >= 0 AND ${table.chunkOverlap} < ${table.chunkSize}`
     ),

[Survived] StringLiteral
src/infrastructure/database/schema.ts:790:10
     ),
     chunkParamsCheck: check(
       'vector_embeddings_384_chunk_params_check',
-      sql`${table.chunkSize} > 0 AND ${table.chunkSize} <= 50000 AND ${table.chunkOverlap} >= 0 AND ${table.chunkOverlap} < ${table.chunkSize}`
+      sql``
     ),
     embeddingDimensionCheck: check(

[Survived] StringLiteral
src/infrastructure/database/schema.ts:794:10
     ),
     embeddingDimensionCheck: check(
       'vector_embeddings_384_embedding_dimension_check',
-      sql`${table.embeddingDimension} = 384`
+      sql``
     ),
     embeddingModelCompositeFk: foreignKey({

[Survived] StringLiteral
src/infrastructure/database/schema.ts:816:16
     id: uuid('id')
       .primaryKey()
       .default(sql`uuidv7()`),
-    name: text('name').notNull(),
+    name: text("").notNull(),
     embeddingModelId: uuid('embedding_model_id')
       .notNull()

[Killed] StringLiteral
src/infrastructure/database/schema.ts:817:28
       .primaryKey()
       .default(sql`uuidv7()`),
     name: text('name').notNull(),
-    embeddingModelId: uuid('embedding_model_id')
+    embeddingModelId: uuid("")
       .notNull()
       .references(() => embeddingModels.id, { onDelete: 'restrict' }),
killedBy: Database Schema chatTypes table properties (additional) vectorStores table columns should have embeddingModelId column
statusReason: expected 'embeddingModelId' to be 'embedding_model_id' // Object.is equality

[Survived] ObjectLiteral
src/infrastructure/database/schema.ts:819:45
     name: text('name').notNull(),
     embeddingModelId: uuid('embedding_model_id')
       .notNull()
-      .references(() => embeddingModels.id, { onDelete: 'restrict' }),
+      .references(() => embeddingModels.id, {}),
     createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
     updatedAt: timestamp('updated_at', { withTimezone: true }).notNull().defaultNow(),

[Survived] BooleanLiteral
src/infrastructure/database/schema.ts:820:56
     embeddingModelId: uuid('embedding_model_id')
       .notNull()
       .references(() => embeddingModels.id, { onDelete: 'restrict' }),
-    createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
+    createdAt: timestamp('created_at', { withTimezone: false }).notNull().defaultNow(),
     updatedAt: timestamp('updated_at', { withTimezone: true }).notNull().defaultNow(),
   },

[Survived] ObjectLiteral
src/infrastructure/database/schema.ts:820:40
     embeddingModelId: uuid('embedding_model_id')
       .notNull()
       .references(() => embeddingModels.id, { onDelete: 'restrict' }),
-    createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
+    createdAt: timestamp('created_at', {}).notNull().defaultNow(),
     updatedAt: timestamp('updated_at', { withTimezone: true }).notNull().defaultNow(),
   },

[Survived] StringLiteral
src/infrastructure/database/schema.ts:825:32
   },
   (table) => ({
     nameCheck: check('vector_stores_name_check', sql`length(trim(${table.name})) > 0`),
-    embeddingModelIdIdx: index('vector_stores_embedding_model_id_idx').on(table.embeddingModelId),
+    embeddingModelIdIdx: index("").on(table.embeddingModelId),
   })
 )

[Survived] ObjectLiteral
src/infrastructure/database/schema.ts:845:39
       .references(() => vectorStores.id, { onDelete: 'cascade' }),
     documentId: uuid('document_id')
       .notNull()
-      .references(() => documents.id, { onDelete: 'cascade' }),
+      .references(() => documents.id, {}),
     addedAt: timestamp('added_at', { withTimezone: true }).notNull().defaultNow(),
   },

[Survived] BooleanLiteral
src/infrastructure/database/schema.ts:846:52
     documentId: uuid('document_id')
       .notNull()
       .references(() => documents.id, { onDelete: 'cascade' }),
-    addedAt: timestamp('added_at', { withTimezone: true }).notNull().defaultNow(),
+    addedAt: timestamp('added_at', { withTimezone: false }).notNull().defaultNow(),
   },
   (table) => ({

[Killed] StringLiteral
src/infrastructure/database/schema.ts:846:24
     documentId: uuid('document_id')
       .notNull()
       .references(() => documents.id, { onDelete: 'cascade' }),
-    addedAt: timestamp('added_at', { withTimezone: true }).notNull().defaultNow(),
+    addedAt: timestamp("", { withTimezone: true }).notNull().defaultNow(),
   },
   (table) => ({
killedBy: Database Schema chatTypes table properties (additional) vectorStoreDocuments table columns should have addedAt column
statusReason: expected 'addedAt' to be 'added_at' // Object.is equality

[Killed] StringLiteral
src/infrastructure/database/schema.ts:864:3
  * Vector Embeddings table: Stores 3072-dimension vector embeddings for RAG
  */
 export const vectorEmbeddings3072 = pgTable(
-  'vector_embeddings_3072',
+  "",
   {
     id: uuid('id')
killedBy: Database Schema Table names should have correct table name for vector_embeddings_3072
statusReason: expected '' to be 'vector_embeddings_3072' // Object.is equality

[Survived] StringLiteral
src/infrastructure/database/schema.ts:910:23
      * Largest storage footprint and index size
      * Higher latency per query vs smaller dimensions
      */
-    embedding: vector('embedding', { dimension: 3072 }).notNull(),
+    embedding: vector("", { dimension: 3072 }).notNull(),
     /**
      * Number of tokens (or characters) in each chunk.

[Survived] ObjectLiteral
src/infrastructure/database/schema.ts:920:40
      */
     chunkOverlap: integer('chunk_overlap').notNull().default(120),
     createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
-    updatedAt: timestamp('updated_at', { withTimezone: true }).notNull().defaultNow(),
+    updatedAt: timestamp('updated_at', {}).notNull().defaultNow(),
   },
   (table) => ({

[Survived] StringLiteral
src/infrastructure/database/schema.ts:923:31
     updatedAt: timestamp('updated_at', { withTimezone: true }).notNull().defaultNow(),
   },
   (table) => ({
-    embeddingCosineIdx: index('vector_embeddings_3072_embedding_cosine_idx').using(
+    embeddingCosineIdx: index("").using(
       'hnsw',
       sql`(embedding::halfvec(3072)) halfvec_cosine_ops`

[Survived] StringLiteral
src/infrastructure/database/schema.ts:940:7
       table.chunkIndex
     ),
     contentLengthCheck: check(
-      'vector_embeddings_3072_content_length_check',
+      "",
       sql`length(${table.content}) >= 1 AND length(${table.content}) <= 50000`
     ),

[Killed] StringLiteral
src/infrastructure/database/schema.ts:948:7
       sql`${table.chunkSize} > 0 AND ${table.chunkSize} <= 50000 AND ${table.chunkOverlap} >= 0 AND ${table.chunkOverlap} < ${table.chunkSize}`
     ),
     embeddingDimensionCheck: check(
-      'vector_embeddings_3072_embedding_dimension_check',
+      "",
       sql`${table.embeddingDimension} = 3072`
     ),
killedBy: Database Schema vectorEmbeddings tables vectorEmbeddings3072 embeddingDimension constraints and composite FK should have embeddingDimensionCheck enforcing dimension = 3072
statusReason: expected undefined to be defined

[Survived] StringLiteral
src/infrastructure/database/schema.ts:1013:23
      * Cons:
      * Slightly lower resolution than 1536/3072 models
      */
-    embedding: vector('embedding', { dimension: 1024 }).notNull(),
+    embedding: vector("", { dimension: 1024 }).notNull(),
     /**
      * Number of tokens (or characters) in each chunk.

[Survived] StringLiteral
src/infrastructure/database/schema.ts:1043:7
       table.chunkIndex
     ),
     contentLengthCheck: check(
-      'vector_embeddings_1024_content_length_check',
+      "",
       sql`length(${table.content}) >= 1 AND length(${table.content}) <= 50000`
     ),

[Survived] StringLiteral
src/infrastructure/database/schema.ts:1047:7
       sql`length(${table.content}) >= 1 AND length(${table.content}) <= 50000`
     ),
     chunkParamsCheck: check(
-      'vector_embeddings_1024_chunk_params_check',
+      "",
       sql`${table.chunkSize} > 0 AND ${table.chunkSize} <= 50000 AND ${table.chunkOverlap} >= 0 AND ${table.chunkOverlap} < ${table.chunkSize}`
     ),

[Killed] StringLiteral
src/infrastructure/database/schema.ts:1068:3
  * Chat Types table: Stores reusable chat templates/configurations
  */
 export const chatTypes = pgTable(
-  'chat_types',
+  "",
   {
     id: uuid('id')
killedBy: Database Schema Table names should have correct table name for chat_types
statusReason: expected '' to be 'chat_types' // Object.is equality

[Survived] StringLiteral
src/infrastructure/database/schema.ts:1073:16
     id: uuid('id')
       .primaryKey()
       .default(sql`uuidv7()`),
-    name: text('name').notNull().unique(),
+    name: text("").notNull().unique(),
     seoFriendlyId: citext('seo_friendly_id').notNull().unique(),
     seoFriendlyBase64Id: text('seo_friendly_base64_id').notNull().unique(),

[Killed] StringLiteral
src/infrastructure/database/schema.ts:1074:27
       .primaryKey()
       .default(sql`uuidv7()`),
     name: text('name').notNull().unique(),
-    seoFriendlyId: citext('seo_friendly_id').notNull().unique(),
+    seoFriendlyId: citext("").notNull().unique(),
     seoFriendlyBase64Id: text('seo_friendly_base64_id').notNull().unique(),
     description: text('description').notNull(),
killedBy: Database Schema Table columns chatTypes table columns should have seoFriendlyId column
statusReason: expected 'seoFriendlyId' to be 'seo_friendly_id' // Object.is equality

[Killed] BooleanLiteral
src/infrastructure/database/schema.ts:1077:43
     seoFriendlyId: citext('seo_friendly_id').notNull().unique(),
     seoFriendlyBase64Id: text('seo_friendly_base64_id').notNull().unique(),
     description: text('description').notNull(),
-    rag: boolean('rag').notNull().default(false),
+    rag: boolean('rag').notNull().default(true),
     createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
     updatedAt: timestamp('updated_at', { withTimezone: true }).notNull().defaultNow(),
killedBy: Database Schema chatTypes table properties (additional) chatTypes table constraints should have default value of false on rag
statusReason: expected true to be false // Object.is equality

[Survived] BooleanLiteral
src/infrastructure/database/schema.ts:1078:56
     seoFriendlyBase64Id: text('seo_friendly_base64_id').notNull().unique(),
     description: text('description').notNull(),
     rag: boolean('rag').notNull().default(false),
-    createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
+    createdAt: timestamp('created_at', { withTimezone: false }).notNull().defaultNow(),
     updatedAt: timestamp('updated_at', { withTimezone: true }).notNull().defaultNow(),
   },
