[Killed] StringLiteral
src/infrastructure/database/schema.ts:1078:26
     seoFriendlyBase64Id: text('seo_friendly_base64_id').notNull().unique(),
     description: text('description').notNull(),
     rag: boolean('rag').notNull().default(false),
-    createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
+    createdAt: timestamp("", { withTimezone: true }).notNull().defaultNow(),
     updatedAt: timestamp('updated_at', { withTimezone: true }).notNull().defaultNow(),
   },
killedBy: Database Schema Table columns chatTypes table columns should have createdAt column
statusReason: expected 'createdAt' to be 'created_at' // Object.is equality

[NoCoverage] StringLiteral
src/infrastructure/database/schema.ts:1088:7
       sql`length(${table.name}) >= 1 AND length(${table.name}) <= 200`
     ),
     seoFriendlyIdLengthCheck: check(
-      'chat_types_seo_friendly_id_length_check',
+      "",
       sql`length(${table.seoFriendlyId}) >= 1 AND length(${table.seoFriendlyId}) <= 200 AND ${table.seoFriendlyId} ~ '^[a-z0-9]+(?:-[a-z0-9]+)*$'`
     ),

[NoCoverage] StringLiteral
src/infrastructure/database/schema.ts:1092:7
       sql`length(${table.seoFriendlyId}) >= 1 AND length(${table.seoFriendlyId}) <= 200 AND ${table.seoFriendlyId} ~ '^[a-z0-9]+(?:-[a-z0-9]+)*$'`
     ),
     seoFriendlyBase64IdLengthCheck: check(
-      'chat_types_seo_friendly_base64_id_length_check',
+      "",
       sql`length(${table.seoFriendlyBase64Id}) = 22`
     ),

[NoCoverage] StringLiteral
src/infrastructure/database/schema.ts:1097:10
     ),
     descriptionLengthCheck: check(
       'chat_types_description_length_check',
-      sql`length(${table.description}) >= 1 AND length(${table.description}) <= 500`
+      sql``
     ),
   })

[Killed] StringLiteral
src/infrastructure/database/schema.ts:1115:22
     userId: uuid('user_id')
       .notNull()
       .references(() => user.userId, { onDelete: 'cascade' }),
-    chatTypeId: uuid('chat_type_id')
+    chatTypeId: uuid("")
       .notNull()
       .references(() => chatTypes.id, { onDelete: 'restrict' }),
killedBy: Database Schema Table columns chats table columns should have chatTypeId column
statusReason: expected 'chatTypeId' to be 'chat_type_id' // Object.is equality

[Survived] BooleanLiteral
src/infrastructure/database/schema.ts:1118:56
     chatTypeId: uuid('chat_type_id')
       .notNull()
       .references(() => chatTypes.id, { onDelete: 'restrict' }),
-    createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
+    createdAt: timestamp('created_at', { withTimezone: false }).notNull().defaultNow(),
     updatedAt: timestamp('updated_at', { withTimezone: true }).notNull().defaultNow(),
   },

[Survived] ObjectLiteral
src/infrastructure/database/schema.ts:1118:40
     chatTypeId: uuid('chat_type_id')
       .notNull()
       .references(() => chatTypes.id, { onDelete: 'restrict' }),
-    createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
+    createdAt: timestamp('created_at', {}).notNull().defaultNow(),
     updatedAt: timestamp('updated_at', { withTimezone: true }).notNull().defaultNow(),
   },

[NoCoverage] StringLiteral
src/infrastructure/database/schema.ts:1122:22
     updatedAt: timestamp('updated_at', { withTimezone: true }).notNull().defaultNow(),
   },
   (table) => ({
-    userIdIdx: index('chats_user_id_idx').on(table.userId),
+    userIdIdx: index("").on(table.userId),
     userIdUpdatedAtIdx: index('chats_user_id_updated_at_idx').on(
       table.userId,

[NoCoverage] StringLiteral
src/infrastructure/database/schema.ts:1123:31
   },
   (table) => ({
     userIdIdx: index('chats_user_id_idx').on(table.userId),
-    userIdUpdatedAtIdx: index('chats_user_id_updated_at_idx').on(
+    userIdUpdatedAtIdx: index("").on(
       table.userId,
       sql`${table.updatedAt} DESC`

[NoCoverage] StringLiteral
src/infrastructure/database/schema.ts:1127:26
       table.userId,
       sql`${table.updatedAt} DESC`
     ),
-    chatTypeIdIdx: index('chats_chat_type_id_idx').on(table.chatTypeId),
+    chatTypeIdIdx: index("").on(table.chatTypeId),
   })
 )

[Survived] BooleanLiteral
src/infrastructure/database/schema.ts:1143:56
     chatId: uuid('chat_id')
       .notNull()
       .references(() => chats.id, { onDelete: 'cascade' }),
-    createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
+    createdAt: timestamp('created_at', { withTimezone: false }).notNull().defaultNow(),
     role: varchar('role').notNull(),
   },

[Survived] ObjectLiteral
src/infrastructure/database/schema.ts:1143:40
     chatId: uuid('chat_id')
       .notNull()
       .references(() => chats.id, { onDelete: 'cascade' }),
-    createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
+    createdAt: timestamp('created_at', {}).notNull().defaultNow(),
     role: varchar('role').notNull(),
   },

[Survived] StringLiteral
src/infrastructure/database/schema.ts:1160:3
  * AI options table: Stores model configuration parameters for each chat type
  */
 export const chatAiOptions = pgTable(
-  'chat_ai_options',
+  "",
   {
     id: uuid('id')

[Killed] StringLiteral
src/infrastructure/database/schema.ts:1165:22
     id: uuid('id')
       .primaryKey()
       .default(sql`uuidv7()`),
-    chatTypeId: uuid('chat_type_id')
+    chatTypeId: uuid("")
       .notNull()
       .unique()
killedBy: Database Schema chatTypes table properties (additional) chatAiOptions table columns should have chatTypeId column
statusReason: expected 'chatTypeId' to be 'chat_type_id' // Object.is equality

[Killed] StringLiteral
src/infrastructure/database/schema.ts:1172:19
     prompt: text('prompt').notNull(),
     maxTokens: integer('max_tokens'),
     temperature: numeric('temperature'),
-    topP: numeric('top_p'),
+    topP: numeric(""),
     frequencyPenalty: numeric('frequency_penalty'),
     presencePenalty: numeric('presence_penalty'),
killedBy: Database Schema chatTypes table properties (additional) chatAiOptions table columns should have topP column
statusReason: expected 'topP' to be 'top_p' // Object.is equality

[Killed] StringLiteral
src/infrastructure/database/schema.ts:1173:31
     maxTokens: integer('max_tokens'),
     temperature: numeric('temperature'),
     topP: numeric('top_p'),
-    frequencyPenalty: numeric('frequency_penalty'),
+    frequencyPenalty: numeric(""),
     presencePenalty: numeric('presence_penalty'),
     topK: integer('top_k'),
killedBy: Database Schema chatTypes table properties (additional) chatAiOptions table columns should have frequencyPenalty column
statusReason: expected 'frequencyPenalty' to be 'frequency_penalty' // Object.is equality

[Killed] StringLiteral
src/infrastructure/database/schema.ts:1174:30
     temperature: numeric('temperature'),
     topP: numeric('top_p'),
     frequencyPenalty: numeric('frequency_penalty'),
-    presencePenalty: numeric('presence_penalty'),
+    presencePenalty: numeric(""),
     topK: integer('top_k'),
     stopSequences: text('stop_sequences').array(),
killedBy: Database Schema chatTypes table properties (additional) chatAiOptions table columns should have presencePenalty column
statusReason: expected 'presencePenalty' to be 'presence_penalty' // Object.is equality

[Survived] StringLiteral
src/infrastructure/database/schema.ts:1177:25
     presencePenalty: numeric('presence_penalty'),
     topK: integer('top_k'),
     stopSequences: text('stop_sequences').array(),
-    maxRetries: integer('max_retries'),
+    maxRetries: integer(""),
     createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
     updatedAt: timestamp('updated_at', { withTimezone: true }).notNull().defaultNow(),

[Survived] BooleanLiteral
src/infrastructure/database/schema.ts:1178:56
     topK: integer('top_k'),
     stopSequences: text('stop_sequences').array(),
     maxRetries: integer('max_retries'),
-    createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
+    createdAt: timestamp('created_at', { withTimezone: false }).notNull().defaultNow(),
     updatedAt: timestamp('updated_at', { withTimezone: true }).notNull().defaultNow(),
   },

[NoCoverage] StringLiteral
src/infrastructure/database/schema.ts:1189:10
     ),
     temperatureRange: check(
       'temperature_range',
-      sql`${table.temperature} IS NULL OR (${table.temperature} >= 0 AND ${table.temperature} <= 2)`
+      sql``
     ),
     topPRange: check(

[NoCoverage] StringLiteral
src/infrastructure/database/schema.ts:1201:10
     ),
     presencePenaltyRange: check(
       'presence_penalty_range',
-      sql`${table.presencePenalty} IS NULL OR (${table.presencePenalty} >= -2 AND ${table.presencePenalty} <= 2)`
+      sql``
     ),
     topKCheck: check(

[NoCoverage] StringLiteral
src/infrastructure/database/schema.ts:1208:7
       sql`${table.topK} IS NULL OR (${table.topK} > 0 AND ${table.topK} <= 100)`
     ),
     maxRetriesCheck: check(
-      'max_retries_check',
+      "",
       sql`${table.maxRetries} IS NULL OR (${table.maxRetries} >= 0 AND ${table.maxRetries} <= 10)`
     ),

[Survived] StringLiteral
src/infrastructure/database/schema.ts:1231:19
     messageId: uuid('message_id')
       .notNull()
       .references(() => messages.id, { onDelete: 'cascade' }),
-    type: varchar('type').notNull(),
+    type: varchar("").notNull(),
     createdAt: timestamp('created_at', { withTimezone: true })
       .notNull()

[Survived] BooleanLiteral
src/infrastructure/database/schema.ts:1232:56
       .notNull()
       .references(() => messages.id, { onDelete: 'cascade' }),
     type: varchar('type').notNull(),
-    createdAt: timestamp('created_at', { withTimezone: true })
+    createdAt: timestamp('created_at', { withTimezone: false })
       .notNull()
       .default(sql`now()`),

[Survived] ObjectLiteral
src/infrastructure/database/schema.ts:1232:40
       .notNull()
       .references(() => messages.id, { onDelete: 'cascade' }),
     type: varchar('type').notNull(),
-    createdAt: timestamp('created_at', { withTimezone: true })
+    createdAt: timestamp('created_at', {})
       .notNull()
       .default(sql`now()`),

[Survived] StringLiteral
src/infrastructure/database/schema.ts:1235:20
     createdAt: timestamp('created_at', { withTimezone: true })
       .notNull()
       .default(sql`now()`),
-    order: integer('order').notNull().default(0),
+    order: integer("").notNull().default(0),
 
     // Text fields

[Killed] StringLiteral
src/infrastructure/database/schema.ts:1241:25
     textText: text('text_text'),
 
     // Reasoning fields
-    reasoningText: text('reasoning_text'),
+    reasoningText: text(""),
 
     // File fields
killedBy: Database Schema chatTypes table properties (additional) parts table columns should have reasoning part columns
statusReason: expected 'reasoningText' to be 'reasoning_text' // Object.is equality

[Killed] StringLiteral
src/infrastructure/database/schema.ts:1251:29
     // Source URL fields
     sourceUrlSourceId: varchar('source_url_source_id'),
     sourceUrlUrl: varchar('source_url_url'),
-    sourceUrlTitle: varchar('source_url_title'),
+    sourceUrlTitle: varchar(""),
 
     // Source document fields
killedBy: Database Schema chatTypes table properties (additional) parts table columns should have source URL part columns
statusReason: expected 'sourceUrlTitle' to be 'source_url_title' // Object.is equality

[Killed] StringLiteral
src/infrastructure/database/schema.ts:1257:37
     sourceDocumentSourceId: varchar('source_document_source_id'),
     sourceDocumentMediaType: varchar('source_document_media_type'),
     sourceDocumentTitle: varchar('source_document_title'),
-    sourceDocumentFilename: varchar('source_document_filename'),
+    sourceDocumentFilename: varchar(""),
 
     // Shared tool call columns
killedBy: Database Schema chatTypes table properties (additional) parts table columns should have source document part columns
statusReason: expected 'sourceDocumentFilename' to be 'source_document_filename' // Object.is equality

[Killed] StringLiteral
src/infrastructure/database/schema.ts:1260:29
     sourceDocumentFilename: varchar('source_document_filename'),
 
     // Shared tool call columns
-    toolToolCallId: varchar('tool_tool_call_id'),
+    toolToolCallId: varchar(""),
     toolState: varchar('tool_state'),
     toolErrorText: varchar('tool_error_text'),
killedBy: Database Schema chatTypes table properties (additional) parts table columns should have tool call columns
statusReason: expected 'toolToolCallId' to be 'tool_tool_call_id' // Object.is equality

[Killed] StringLiteral
src/infrastructure/database/schema.ts:1262:28
     // Shared tool call columns
     toolToolCallId: varchar('tool_tool_call_id'),
     toolState: varchar('tool_state'),
-    toolErrorText: varchar('tool_error_text'),
+    toolErrorText: varchar(""),
 
     // Tool-specific fields for heartOfDarknessQA
killedBy: Database Schema chatTypes table properties (additional) parts table columns should have tool call columns
statusReason: expected 'toolErrorText' to be 'tool_error_text' // Object.is equality

[Survived] StringLiteral
src/infrastructure/database/schema.ts:1270:24
     toolHeartOfDarknessQAErrorText: varchar('tool_heart_of_darkness_qa_error_text'),
 
     // Data part fields (for custom data parts)
-    dataContent: jsonb('data_content'),
+    dataContent: jsonb(""),
 
     // Provider metadata

[NoCoverage] StringLiteral
src/infrastructure/database/schema.ts:1279:7
     messageIdIdx: index('parts_message_id_idx').on(table.messageId),
     messageIdOrderIdx: index('parts_message_id_order_idx').on(table.messageId, table.order),
     textTextRequiredIfTypeIsText: check(
-      'text_text_required_if_type_is_text',
+      "",
       sql`CASE WHEN ${table.type} = 'text' THEN ${table.textText} IS NOT NULL ELSE TRUE END`
     ),

[NoCoverage] StringLiteral
src/infrastructure/database/schema.ts:1284:10
     ),
     reasoningTextRequiredIfTypeIsReasoning: check(
       'reasoning_text_required_if_type_is_reasoning',
-      sql`CASE WHEN ${table.type} = 'reasoning' THEN ${table.reasoningText} IS NOT NULL ELSE TRUE END`
+      sql``
     ),
     fileFieldsRequiredIfTypeIsFile: check(

[NoCoverage] StringLiteral
src/infrastructure/database/schema.ts:1287:7
       sql`CASE WHEN ${table.type} = 'reasoning' THEN ${table.reasoningText} IS NOT NULL ELSE TRUE END`
     ),
     fileFieldsRequiredIfTypeIsFile: check(
-      'file_fields_required_if_type_is_file',
+      "",
       sql`CASE WHEN ${table.type} = 'file' THEN ${table.fileMediaType} IS NOT NULL AND ${table.fileUrl} IS NOT NULL ELSE TRUE END`
     ),

[Survived] ObjectLiteral
src/infrastructure/database/schema.ts:1315:59
     id: uuid('id')
       .primaryKey()
       .default(sql`uuidv7()`),
-    userId: uuid('user_id').references(() => user.userId, {
-      onDelete: 'set null',
-    }),
+    userId: uuid('user_id').references(() => user.userId, {}),
     entityType: varchar('entity_type', { length: 50 }).notNull(),
     entityId: text('entity_id'),

[Survived] ObjectLiteral
src/infrastructure/database/schema.ts:1318:40
     userId: uuid('user_id').references(() => user.userId, {
       onDelete: 'set null',
     }),
-    entityType: varchar('entity_type', { length: 50 }).notNull(),
+    entityType: varchar('entity_type', {}).notNull(),
     entityId: text('entity_id'),
     action: varchar('action', { length: 50 }).notNull(),

[Survived] StringLiteral
src/infrastructure/database/schema.ts:1320:21
     }),
     entityType: varchar('entity_type', { length: 50 }).notNull(),
     entityId: text('entity_id'),
-    action: varchar('action', { length: 50 }).notNull(),
+    action: varchar("", { length: 50 }).notNull(),
     changes: jsonb('changes'),
     /**

[Survived] ObjectLiteral
src/infrastructure/database/schema.ts:1320:31
     }),
     entityType: varchar('entity_type', { length: 50 }).notNull(),
     entityId: text('entity_id'),
-    action: varchar('action', { length: 50 }).notNull(),
+    action: varchar('action', {}).notNull(),
     changes: jsonb('changes'),
     /**

[Survived] BooleanLiteral
src/infrastructure/database/schema.ts:1328:56
      */
     ipAddress: text('ip_address'),
     userAgent: text('user_agent'),
-    createdAt: timestamp('created_at', { withTimezone: true }).notNull().defaultNow(),
+    createdAt: timestamp('created_at', { withTimezone: false }).notNull().defaultNow(),
   },
   (table) => ({

[NoCoverage] StringLiteral
src/infrastructure/database/schema.ts:1332:34
   },
   (table) => ({
     userIdIdx: index('audit_log_user_id_idx').on(table.userId),
-    entityTypeEntityIdIdx: index('audit_log_entity_type_entity_id_idx').on(
+    entityTypeEntityIdIdx: index("").on(
       table.entityType,
       table.entityId

[NoCoverage] StringLiteral
src/infrastructure/database/schema.ts:1336:59
       table.entityType,
       table.entityId
     ),
-    createdAtIdx: index('audit_log_created_at_idx').on(sql`${table.createdAt} DESC`),
+    createdAtIdx: index('audit_log_created_at_idx').on(sql``),
     actionIdx: index('audit_log_action_idx').on(table.action),
   })

[NoCoverage] StringLiteral
src/infrastructure/database/schema.ts:1337:22
       table.entityId
     ),
     createdAtIdx: index('audit_log_created_at_idx').on(sql`${table.createdAt} DESC`),
-    actionIdx: index('audit_log_action_idx').on(table.action),
+    actionIdx: index("").on(table.action),
   })
 )

[NoCoverage] ObjectLiteral
src/infrastructure/database/schema.ts:1395:92
   vectorStores: many(vectorStores),
 }))
 
-export const vectorEmbeddings1536Relations = relations(vectorEmbeddings1536, ({ one }) => ({
-  document: one(documents, {
-    fields: [vectorEmbeddings1536.documentId],
-    references: [documents.id],
-  }),
-  embeddingModel: one(embeddingModels, {
-    fields: [vectorEmbeddings1536.embeddingModelId],
-    references: [embeddingModels.id],
-  }),
-}))
+export const vectorEmbeddings1536Relations = relations(vectorEmbeddings1536, ({ one }) => ({}))
 
 export const vectorEmbeddings768Relations = relations(vectorEmbeddings768, ({ one }) => ({
