[NoCoverage] ObjectLiteral
src/application/use-cases/get-embedding-model-by-id.use-case.ts:15:51
     private readonly aiRagRepository: AIRAGRepository
   ) {}
   public async execute(id: string): Promise<DBEmbeddingModelSelect | undefined> {
-    this.logger.info('Fetching embedding models', { event: 'embedding_model.fetch.attempt' })
+    this.logger.info('Fetching embedding models', {})
     return this.aiRagRepository.getEmbeddingModelById(id)
   }
