[Survived] BlockStatement
src/shared/mapper/index.ts:13:15
   messageId: string,
   logger?: LoggerPort
 ): MyDBUIMessagePart[] => {
-  if (logger) {
-    logger.info('messageParts keys:', {
-      parts: messageParts.map((part, idx) => ({ index: idx, keys: Object.keys(part) })),
-    })
-  }
+  if (logger) {}
   return messageParts.map((part, index) => {
     switch (part.type) {

[Survived] ArrowFunction
src/shared/mapper/index.ts:15:31
 ): MyDBUIMessagePart[] => {
   if (logger) {
     logger.info('messageParts keys:', {
-      parts: messageParts.map((part, idx) => ({ index: idx, keys: Object.keys(part) })),
+      parts: messageParts.map(() => undefined),
     })
   }

[Killed] ConditionalExpression
src/shared/mapper/index.ts:20:7
   }
   return messageParts.map((part, index) => {
     switch (part.type) {
-      case 'text':
-        return {
-          messageId,
-          order: index,
-          type: part.type,
-          textText: part.text,
-        }
+      case 'text':
       case 'reasoning':
         return {
killedBy: AIRepository createChat should successfully create chat with specific chat ID, user ID, and message with parts
statusReason: expected "vi.fn()" to be called with arguments: [ [ { …(4) } ] ]

Received:

  1st vi.fn() call:

  [
    [

[NoCoverage] ConditionalExpression
src/shared/mapper/index.ts:53:7
           sourceDocumentTitle: part.title,
           sourceDocumentFilename: part.filename,
         }
-      case 'source-url':
-        return {
-          messageId,
-          order: index,
-          type: part.type,
-          sourceUrlSourceId: part.sourceId,
-          sourceUrlUrl: part.url,
-          sourceUrlTitle: part.title,
-        }
+      case 'source-url':
       case 'step-start':
         return {

[NoCoverage] ConditionalExpression
src/shared/mapper/index.ts:68:7
           order: index,
           type: part.type,
         }
-      case 'tool-heartOfDarknessQA':
-        return {
-          messageId,
-          order: index,
-          type: part.type,
-          toolToolCallId: part.toolCallId,
-          toolState: part.state,
-          toolHeartOfDarknessQAInput:
-            part.state === 'input-available' ||
-            part.state === 'output-available' ||
-            part.state === 'output-error'
-              ? part.input
-              : undefined,
-          toolHeartOfDarknessQAOutput: part.state === 'output-available' ? part.output : undefined,
-          toolHeartOfDarknessQAErrorText:
-            part.state === 'output-error' ? part.errorText : undefined,
-        }
+      case 'tool-heartOfDarknessQA':
       default:
         throw new Error(`Unsupported part type: ${JSON.stringify(part)}`)

[NoCoverage] ConditionalExpression
src/shared/mapper/index.ts:76:13
           toolToolCallId: part.toolCallId,
           toolState: part.state,
           toolHeartOfDarknessQAInput:
-            part.state === 'input-available' ||
-            part.state === 'output-available' ||
-            part.state === 'output-error'
+            true
               ? part.input
               : undefined,

[NoCoverage] ConditionalExpression
src/shared/mapper/index.ts:76:13
           toolToolCallId: part.toolCallId,
           toolState: part.state,
           toolHeartOfDarknessQAInput:
-            part.state === 'input-available' ||
-            part.state === 'output-available' ||
+            false ||
             part.state === 'output-error'
               ? part.input

[NoCoverage] ConditionalExpression
src/shared/mapper/index.ts:77:13
           toolState: part.state,
           toolHeartOfDarknessQAInput:
             part.state === 'input-available' ||
-            part.state === 'output-available' ||
+            false ||
             part.state === 'output-error'
               ? part.input

[NoCoverage] EqualityOperator
src/shared/mapper/index.ts:78:13
           toolHeartOfDarknessQAInput:
             part.state === 'input-available' ||
             part.state === 'output-available' ||
-            part.state === 'output-error'
+            part.state !== 'output-error'
               ? part.input
               : undefined,

[NoCoverage] ConditionalExpression
src/shared/mapper/index.ts:78:13
           toolHeartOfDarknessQAInput:
             part.state === 'input-available' ||
             part.state === 'output-available' ||
-            part.state === 'output-error'
+            false
               ? part.input
               : undefined,

[NoCoverage] ConditionalExpression
src/shared/mapper/index.ts:81:40
             part.state === 'output-error'
               ? part.input
               : undefined,
-          toolHeartOfDarknessQAOutput: part.state === 'output-available' ? part.output : undefined,
+          toolHeartOfDarknessQAOutput: true ? part.output : undefined,
           toolHeartOfDarknessQAErrorText:
             part.state === 'output-error' ? part.errorText : undefined,

[NoCoverage] EqualityOperator
src/shared/mapper/index.ts:81:40
             part.state === 'output-error'
               ? part.input
               : undefined,
-          toolHeartOfDarknessQAOutput: part.state === 'output-available' ? part.output : undefined,
+          toolHeartOfDarknessQAOutput: part.state !== 'output-available' ? part.output : undefined,
           toolHeartOfDarknessQAErrorText:
             part.state === 'output-error' ? part.errorText : undefined,

[NoCoverage] EqualityOperator
src/shared/mapper/index.ts:83:13
               : undefined,
           toolHeartOfDarknessQAOutput: part.state === 'output-available' ? part.output : undefined,
           toolHeartOfDarknessQAErrorText:
-            part.state === 'output-error' ? part.errorText : undefined,
+            part.state !== 'output-error' ? part.errorText : undefined,
         }
       default:

[NoCoverage] ConditionalExpression
src/shared/mapper/index.ts:83:13
               : undefined,
           toolHeartOfDarknessQAOutput: part.state === 'output-available' ? part.output : undefined,
           toolHeartOfDarknessQAErrorText:
-            part.state === 'output-error' ? part.errorText : undefined,
+            true ? part.errorText : undefined,
         }
       default:

[NoCoverage] StringLiteral
src/shared/mapper/index.ts:86:25
             part.state === 'output-error' ? part.errorText : undefined,
         }
       default:
-        throw new Error(`Unsupported part type: ${JSON.stringify(part)}`)
+        throw new Error(``)
     }
   })

[Killed] ConditionalExpression
src/shared/mapper/index.ts:93:5
 
 export const mapDBPartToUIMessagePart = (part: MyDBUIMessagePartSelect): MyUIMessagePart => {
   switch (part.type) {
-    case 'text':
-      return {
-        type: part.type,
-        text: part.textText!,
-      }
+    case 'text':
     case 'reasoning':
       return {
killedBy: Mapper mapDBPartToUIMessagePart should map text parts from DB to UI correctly
statusReason: expected { type: 'text', text: null } to deeply equal { type: 'text', text: 'Hello world' }

[NoCoverage] ConditionalExpression
src/shared/mapper/index.ts:125:5
         url: part.sourceUrlUrl!,
         title: part.sourceUrlTitle!,
       }
-    case 'step-start':
-      return {
-        type: part.type,
-      }
+    case 'step-start':
     case 'tool-heartOfDarknessQA': {
       const baseToolPart = {

[NoCoverage] ConditionalExpression
src/shared/mapper/index.ts:137:11
       }
 
       // Return appropriate structure based on state
-      if (part.toolState === 'input-available') {
+      if (false) {
         return {
           ...baseToolPart,

[NoCoverage] ConditionalExpression
src/shared/mapper/index.ts:137:11
       }
 
       // Return appropriate structure based on state
-      if (part.toolState === 'input-available') {
+      if (true) {
         return {
           ...baseToolPart,

[NoCoverage] ConditionalExpression
src/shared/mapper/index.ts:143:18
           state: 'input-available' as const,
           input: part.toolHeartOfDarknessQAInput,
         }
-      } else if (part.toolState === 'output-available') {
+      } else if (true) {
         return {
           ...baseToolPart,

[NoCoverage] ConditionalExpression
src/shared/mapper/index.ts:143:18
           state: 'input-available' as const,
           input: part.toolHeartOfDarknessQAInput,
         }
-      } else if (part.toolState === 'output-available') {
+      } else if (false) {
         return {
           ...baseToolPart,

[NoCoverage] ConditionalExpression
src/shared/mapper/index.ts:150:18
           input: part.toolHeartOfDarknessQAInput,
           output: part.toolHeartOfDarknessQAOutput,
         }
-      } else if (part.toolState === 'output-error') {
+      } else if (false) {
         return {
           ...baseToolPart,

[NoCoverage] EqualityOperator
src/shared/mapper/index.ts:150:18
           input: part.toolHeartOfDarknessQAInput,
           output: part.toolHeartOfDarknessQAOutput,
         }
-      } else if (part.toolState === 'output-error') {
+      } else if (part.toolState !== 'output-error') {
         return {
           ...baseToolPart,

[NoCoverage] StringLiteral
src/shared/mapper/index.ts:159:25
         }
       } else {
         // Treat missing or unknown tool state as a data integrity error
-        throw new Error(`Invalid tool state for heartOfDarknessQA: ${String(part.toolState)}`)
+        throw new Error(``)
       }
     }

[NoCoverage] StringLiteral
src/shared/mapper/index.ts:163:23
       }
     }
     default:
-      throw new Error(`Unsupported part type: ${part.type}`)
+      throw new Error(``)
   }
 }
