[Killed] BlockStatement
src/domain/value-objects/chatID.ts:151:43
    * ```
    */
   private processChatUUID(userUUID: string): ChatIdType<T> {
-    if (!Uuid7Util.isValidUUID(userUUID)) {
-      throw new Error('Invalid chatId UUID format provided')
-    }
+    if (!Uuid7Util.isValidUUID(userUUID)) {}
     // Validate the UUID version but return the UUID itself, not the version string
     const version = Uuid7Util.uuidVersionValidation(userUUID)
killedBy: ChatId Value Object Constructor should throw error for invalid UUID format
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/domain/value-objects/chatID.ts:151:9
    * ```
    */
   private processChatUUID(userUUID: string): ChatIdType<T> {
-    if (!Uuid7Util.isValidUUID(userUUID)) {
+    if (false) {
       throw new Error('Invalid chatId UUID format provided')
     }
killedBy: ChatId Value Object Constructor should validate UUID format using Uuid7Util.isValidUUID
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] StringLiteral
src/domain/value-objects/chatID.ts:152:23
    */
   private processChatUUID(userUUID: string): ChatIdType<T> {
     if (!Uuid7Util.isValidUUID(userUUID)) {
-      throw new Error('Invalid chatId UUID format provided')
+      throw new Error("")
     }
     // Validate the UUID version but return the UUID itself, not the version string
killedBy: ChatId Value Object Constructor should throw error for invalid UUID format
statusReason: expected [Function] to throw error including 'Invalid chatId UUID format provided' but got ''

[Killed] ConditionalExpression
src/domain/value-objects/chatID.ts:156:9
     }
     // Validate the UUID version but return the UUID itself, not the version string
     const version = Uuid7Util.uuidVersionValidation(userUUID)
-    if (version !== 'v7') {
+    if (false) {
       throw new Error(`Invalid chatId UUID version: ${version}`)
     }
killedBy: PostChatDto validate() — id field should throw ValidationException for a UUIDv4 id
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
src/domain/value-objects/chatID.ts:156:9
     }
     // Validate the UUID version but return the UUID itself, not the version string
     const version = Uuid7Util.uuidVersionValidation(userUUID)
-    if (version !== 'v7') {
+    if (true) {
       throw new Error(`Invalid chatId UUID version: ${version}`)
     }
killedBy: GetChatContentByChatIdUseCase Successful scenarios should return chat content with single message and part
statusReason: Invalid chatId UUID version: v7
