[Killed] Regex
src/shared/utils/prompt-injection-guard.utils.ts:18:8
     const reasons: string[] = []
 
     const checks: Array<[RegExp, number, string]> = [
-      [/\bignore (all|any|previous|prior) instructions?\b/i, 4, 'instruction-override'],
+      [/\bignore (all|any|previous|prior) instructions\b/i, 4, 'instruction-override'],
       [/\byou are now\b/i, 3, 'role-reassignment'],
       [/(\brole\s*:\s*system\b|<system>|\[system\])/i, 5, 'system-role-spoofing'],
killedBy: PromptInjectionGuard individual pattern checks instruction-override — "ignore prior instruction" singular (score 4)
statusReason: expected +0 to be 4 // Object.is equality

[Killed] StringLiteral
src/shared/utils/prompt-injection-guard.utils.ts:19:31
 
     const checks: Array<[RegExp, number, string]> = [
       [/\bignore (all|any|previous|prior) instructions?\b/i, 4, 'instruction-override'],
-      [/\byou are now\b/i, 3, 'role-reassignment'],
+      [/\byou are now\b/i, 3, ""],
       [/(\brole\s*:\s*system\b|<system>|\[system\])/i, 5, 'system-role-spoofing'],
       [
killedBy: PromptInjectionGuard decision: flag (4 ≤ score < 8) should flag role-reassignment combined with concealment-language (score = 5)
statusReason: expected [ '', 'concealment-language' ] to include 'role-reassignment'

[Killed] Regex
src/shared/utils/prompt-injection-guard.utils.ts:20:8
     const checks: Array<[RegExp, number, string]> = [
       [/\bignore (all|any|previous|prior) instructions?\b/i, 4, 'instruction-override'],
       [/\byou are now\b/i, 3, 'role-reassignment'],
-      [/(\brole\s*:\s*system\b|<system>|\[system\])/i, 5, 'system-role-spoofing'],
+      [/(\brole\s:\s*system\b|<system>|\[system\])/i, 5, 'system-role-spoofing'],
       [
         /\b(reveal|show|print|dump).{0,40}\b(system prompt|hidden prompt|developer message|internal instructions?)\b/i,
killedBy: PromptInjectionGuard decision: flag (4 ≤ score < 8) should flag system-role-spoofing with "role: system" (score = 5)
statusReason: expected 'allow' to be 'flag' // Object.is equality

[Killed] Regex
src/shared/utils/prompt-injection-guard.utils.ts:20:8
     const checks: Array<[RegExp, number, string]> = [
       [/\bignore (all|any|previous|prior) instructions?\b/i, 4, 'instruction-override'],
       [/\byou are now\b/i, 3, 'role-reassignment'],
-      [/(\brole\s*:\s*system\b|<system>|\[system\])/i, 5, 'system-role-spoofing'],
+      [/(\brole\s*:\S*system\b|<system>|\[system\])/i, 5, 'system-role-spoofing'],
       [
         /\b(reveal|show|print|dump).{0,40}\b(system prompt|hidden prompt|developer message|internal instructions?)\b/i,
killedBy: PromptInjectionGuard decision: flag (4 ≤ score < 8) should flag system-role-spoofing with "role: system" (score = 5)
statusReason: expected 'allow' to be 'flag' // Object.is equality

[Survived] Regex
src/shared/utils/prompt-injection-guard.utils.ts:22:9
       [/\byou are now\b/i, 3, 'role-reassignment'],
       [/(\brole\s*:\s*system\b|<system>|\[system\])/i, 5, 'system-role-spoofing'],
       [
-        /\b(reveal|show|print|dump).{0,40}\b(system prompt|hidden prompt|developer message|internal instructions?)\b/i,
+        /\b(reveal|show|print|dump).{0,40}\b(system prompt|hidden prompt|developer message|internal instructions)\b/i,
         6,
         'prompt-exfiltration',

[Killed] BlockStatement
src/shared/utils/prompt-injection-guard.utils.ts:30:53
       [/\b(base64|decode this|hex decode|rot13)\b/i, 2, 'obfuscation-indicator'],
     ]
 
-    for (const [pattern, points, reason] of checks) {
-      if (pattern.test(normalized)) {
-        score += points
-        reasons.push(reason)
-      }
-    }
+    for (const [pattern, points, reason] of checks) {}
 
     const decision: PromptRiskDecision = score >= 8 ? 'block' : score >= 4 ? 'flag' : 'allow'
killedBy: PromptInjectionGuard decision: allow (score < 4) should allow a message with a single low-weight pattern (score = 2, under flag threshold)
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
src/shared/utils/prompt-injection-guard.utils.ts:31:37
     ]
 
     for (const [pattern, points, reason] of checks) {
-      if (pattern.test(normalized)) {
-        score += points
-        reasons.push(reason)
-      }
+      if (pattern.test(normalized)) {}
     }
 
killedBy: PromptInjectionGuard decision: allow (score < 4) should allow a message with a single low-weight pattern (score = 2, under flag threshold)
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/shared/utils/prompt-injection-guard.utils.ts:31:11
     ]
 
     for (const [pattern, points, reason] of checks) {
-      if (pattern.test(normalized)) {
+      if (true) {
         score += points
         reasons.push(reason)
killedBy: PromptInjectionGuard decision: allow (score < 4) should allow a plain conversational message
statusReason: expected 'block' to be 'allow' // Object.is equality

[Killed] AssignmentOperator
src/shared/utils/prompt-injection-guard.utils.ts:32:9
 
     for (const [pattern, points, reason] of checks) {
       if (pattern.test(normalized)) {
-        score += points
+        score -= points
         reasons.push(reason)
       }
killedBy: PromptInjectionGuard decision: allow (score < 4) should allow a message with a single low-weight pattern (score = 2, under flag threshold)
statusReason: expected -2 to be 2 // Object.is equality

[Killed] EqualityOperator
src/shared/utils/prompt-injection-guard.utils.ts:37:65
       }
     }
 
-    const decision: PromptRiskDecision = score >= 8 ? 'block' : score >= 4 ? 'flag' : 'allow'
+    const decision: PromptRiskDecision = score >= 8 ? 'block' : score > 4 ? 'flag' : 'allow'
 
     return {
killedBy: PromptInjectionGuard decision: flag (4 ≤ score < 8) should flag "ignore previous instructions" (score = 4)
statusReason: expected 'allow' to be 'flag' // Object.is equality

[Killed] ConditionalExpression
src/shared/utils/prompt-injection-guard.utils.ts:37:65
       }
     }
 
-    const decision: PromptRiskDecision = score >= 8 ? 'block' : score >= 4 ? 'flag' : 'allow'
+    const decision: PromptRiskDecision = score >= 8 ? 'block' : false ? 'flag' : 'allow'
 
     return {
killedBy: PromptInjectionGuard decision: flag (4 ≤ score < 8) should flag "ignore previous instructions" (score = 4)
statusReason: expected 'allow' to be 'flag' // Object.is equality

[Killed] MethodExpression
src/shared/utils/prompt-injection-guard.utils.ts:49:10
 }
 
 function normalizePrompt(input: string): string {
-  return input
-    .normalize('NFKC')
-    .replace(/[\u200B-\u200D\uFEFF]/g, '') // zero-width chars
-    .replace(/\s+/g, ' ')
-    .trim()
-    .toLowerCase()
+  return input.normalize('NFKC').replace(/[\u200B-\u200D\uFEFF]/g, '') // zero-width chars
+.replace(/\s+/g, ' ').trim().toUpperCase()
 }
 
killedBy: PromptInjectionGuard input normalisation should lower-case the normalizedText
statusReason: expected 'HELLO WORLD' to be 'hello world' // Object.is equality

[Killed] MethodExpression
src/shared/utils/prompt-injection-guard.utils.ts:49:10
 }
 
 function normalizePrompt(input: string): string {
-  return input
-    .normalize('NFKC')
-    .replace(/[\u200B-\u200D\uFEFF]/g, '') // zero-width chars
-    .replace(/\s+/g, ' ')
-    .trim()
+  return input.normalize('NFKC').replace(/[\u200B-\u200D\uFEFF]/g, '') // zero-width chars
+.replace(/\s+/g, ' ')
     .toLowerCase()
 }
killedBy: PromptInjectionGuard input normalisation should trim leading and trailing whitespace
statusReason: expected ' hello world ' to be 'hello world' // Object.is equality

[Killed] StringLiteral
src/shared/utils/prompt-injection-guard.utils.ts:50:16
 
 function normalizePrompt(input: string): string {
   return input
-    .normalize('NFKC')
+    .normalize("")
     .replace(/[\u200B-\u200D\uFEFF]/g, '') // zero-width chars
     .replace(/\s+/g, ' ')
killedBy: PromptInjectionGuard assess() should return an object with score, decision, reasons, and normalizedText
statusReason: The normalization form should be one of NFC, NFD, NFKC, NFKD.

[Killed] StringLiteral
src/shared/utils/prompt-injection-guard.utils.ts:52:22
   return input
     .normalize('NFKC')
     .replace(/[\u200B-\u200D\uFEFF]/g, '') // zero-width chars
-    .replace(/\s+/g, ' ')
+    .replace(/\s+/g, "")
     .trim()
     .toLowerCase()
killedBy: PromptInjectionGuard decision: allow (score < 4) should allow a message with a single low-weight pattern (score = 2, under flag threshold)
statusReason: expected +0 to be 2 // Object.is equality

[Killed] Regex
src/shared/utils/prompt-injection-guard.utils.ts:52:14
   return input
     .normalize('NFKC')
     .replace(/[\u200B-\u200D\uFEFF]/g, '') // zero-width chars
-    .replace(/\s+/g, ' ')
+    .replace(/\s/g, ' ')
     .trim()
     .toLowerCase()
killedBy: PromptInjectionGuard input normalisation should collapse multiple whitespace to a single space
statusReason: expected 'hello   world  foo' to be 'hello world foo' // Object.is equality
