[Killed] BooleanLiteral
src/domain/value-objects/userID.ts:152:9
    * ```
    */
   private processUserIdUUID(userUUID: string): UserIdType<T> {
-    if (!Uuid7Util.isValidUUID(userUUID)) {
+    if (Uuid7Util.isValidUUID(userUUID)) {
       throw new Error('Invalid userID UUID format provided')
     }
killedBy: UserId Value Object Constructor should create a UserId with a valid UUID
statusReason: Invalid userID UUID format provided

[Killed] ConditionalExpression
src/domain/value-objects/userID.ts:152:9
    * ```
    */
   private processUserIdUUID(userUUID: string): UserIdType<T> {
-    if (!Uuid7Util.isValidUUID(userUUID)) {
+    if (false) {
       throw new Error('Invalid userID UUID format provided')
     }
killedBy: UserId Value Object Constructor should validate UUID format using Uuid7Util.isValidUUID
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BlockStatement
src/domain/value-objects/userID.ts:157:27
     }
     // Validate the UUID version but return the UUID itself, not the version string
     const version = Uuid7Util.uuidVersionValidation(userUUID)
-    if (version !== 'v7') {
-      throw new Error(`Invalid userID UUID version: ${version}`)
-    }
+    if (version !== 'v7') {}
     return brandUserId<T>(userUUID)
   }
killedBy: UserId Value Object Constructor should throw error when version validation returns undefined
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/domain/value-objects/userID.ts:158:23
     // Validate the UUID version but return the UUID itself, not the version string
     const version = Uuid7Util.uuidVersionValidation(userUUID)
     if (version !== 'v7') {
-      throw new Error(`Invalid userID UUID version: ${version}`)
+      throw new Error(``)
     }
     return brandUserId<T>(userUUID)
killedBy: UserId Value Object Constructor should throw error when version validation returns undefined
statusReason: expected [Function] to throw error including 'Invalid userID UUID version: undefined' but got ''
