[Killed] StringLiteral
src/infrastructure/config/env.config.ts:12:3
 
 const requiredEnvs: string[] = [
   'DATABASE_URL',
-  'GOOGLE_GENERATIVE_AI_API_KEY',
+  "",
   'MODEL_NAME',
   'RESEND_API_KEY',
killedBy: EnvConfig validate() should not throw when ENCRYPTION_KEY is present alongside all other required vars
statusReason: expected [Function] to not throw an error but 'Error: Missing required environment v…' was thrown

[Killed] StringLiteral
src/infrastructure/config/env.config.ts:13:3
 const requiredEnvs: string[] = [
   'DATABASE_URL',
   'GOOGLE_GENERATIVE_AI_API_KEY',
-  'MODEL_NAME',
+  "",
   'RESEND_API_KEY',
   'JWT_SECRET',
killedBy: EnvConfig validate() should not throw when ENCRYPTION_KEY is present alongside all other required vars
statusReason: expected [Function] to not throw an error but 'Error: Missing required environment v…' was thrown

[Killed] StringLiteral
src/infrastructure/config/env.config.ts:15:3
   'GOOGLE_GENERATIVE_AI_API_KEY',
   'MODEL_NAME',
   'RESEND_API_KEY',
-  'JWT_SECRET',
+  "",
   'API_VERSION',
   'OAUTH_SYNC_SECRET',
killedBy: EnvConfig validate() should not throw when ENCRYPTION_KEY is present alongside all other required vars
statusReason: expected [Function] to not throw an error but 'Error: Missing required environment v…' was thrown

[Killed] StringLiteral
src/infrastructure/config/env.config.ts:16:3
   'MODEL_NAME',
   'RESEND_API_KEY',
   'JWT_SECRET',
-  'API_VERSION',
+  "",
   'OAUTH_SYNC_SECRET',
   'CLOUDFLARE_API',
killedBy: EnvConfig validate() should not throw when ENCRYPTION_KEY is present alongside all other required vars
statusReason: expected [Function] to not throw an error but 'Error: Missing required environment v…' was thrown

[Killed] StringLiteral
src/infrastructure/config/env.config.ts:18:3
   'JWT_SECRET',
   'API_VERSION',
   'OAUTH_SYNC_SECRET',
-  'CLOUDFLARE_API',
+  "",
   'JWT_ISSUER',
   'ENCRYPTION_KEY',
killedBy: EnvConfig validate() should not throw when ENCRYPTION_KEY is present alongside all other required vars
statusReason: expected [Function] to not throw an error but 'Error: Missing required environment v…' was thrown

[Killed] StringLiteral
src/infrastructure/config/env.config.ts:24:46
 ]
 
 export class EnvConfig {
-  static readonly NODE_ENV = ENV.NODE_ENV || 'development'
+  static readonly NODE_ENV = ENV.NODE_ENV || ""
   static readonly DATABASE_URL = obscured.make(ENV.DATABASE_URL)
   static readonly DATABASE_SSL_ENABLED = ENV.DATABASE_SSL_ENABLED ?? false
killedBy: EnvConfig NODE_ENV should default to "development" when NODE_ENV is not set
statusReason: expected '' to be 'development' // Object.is equality

[Killed] LogicalOperator
src/infrastructure/config/env.config.ts:26:42
 export class EnvConfig {
   static readonly NODE_ENV = ENV.NODE_ENV || 'development'
   static readonly DATABASE_URL = obscured.make(ENV.DATABASE_URL)
-  static readonly DATABASE_SSL_ENABLED = ENV.DATABASE_SSL_ENABLED ?? false
+  static readonly DATABASE_SSL_ENABLED = ENV.DATABASE_SSL_ENABLED && false
   static readonly DATABASE_SSL_REJECT_UNAUTHORIZED = ENV.DATABASE_SSL_REJECT_UNAUTHORIZED ?? true
   static readonly GOOGLE_GENERATIVE_AI_API_KEY = obscured.make(ENV.GOOGLE_GENERATIVE_AI_API_KEY)
killedBy: Database Index Pool Configuration should enable SSL when DATABASE_SSL_ENABLED is true
statusReason: expected false not to be false // Object.is equality

[NoCoverage] BooleanLiteral
src/infrastructure/config/env.config.ts:26:70
 export class EnvConfig {
   static readonly NODE_ENV = ENV.NODE_ENV || 'development'
   static readonly DATABASE_URL = obscured.make(ENV.DATABASE_URL)
-  static readonly DATABASE_SSL_ENABLED = ENV.DATABASE_SSL_ENABLED ?? false
+  static readonly DATABASE_SSL_ENABLED = ENV.DATABASE_SSL_ENABLED ?? true
   static readonly DATABASE_SSL_REJECT_UNAUTHORIZED = ENV.DATABASE_SSL_REJECT_UNAUTHORIZED ?? true
   static readonly GOOGLE_GENERATIVE_AI_API_KEY = obscured.make(ENV.GOOGLE_GENERATIVE_AI_API_KEY)

[Killed] LogicalOperator
src/infrastructure/config/env.config.ts:27:54
   static readonly NODE_ENV = ENV.NODE_ENV || 'development'
   static readonly DATABASE_URL = obscured.make(ENV.DATABASE_URL)
   static readonly DATABASE_SSL_ENABLED = ENV.DATABASE_SSL_ENABLED ?? false
-  static readonly DATABASE_SSL_REJECT_UNAUTHORIZED = ENV.DATABASE_SSL_REJECT_UNAUTHORIZED ?? true
+  static readonly DATABASE_SSL_REJECT_UNAUTHORIZED = ENV.DATABASE_SSL_REJECT_UNAUTHORIZED && true
   static readonly GOOGLE_GENERATIVE_AI_API_KEY = obscured.make(ENV.GOOGLE_GENERATIVE_AI_API_KEY)
   static readonly MODEL_NAME = ENV.MODEL_NAME
killedBy: Database Index Pool Configuration should set rejectUnauthorized to false when DATABASE_SSL_REJECT_UNAUTHORIZED is false
statusReason: expected { rejectUnauthorized: true } to match object { rejectUnauthorized: false }

[Killed] BooleanLiteral
src/infrastructure/config/env.config.ts:27:94
   static readonly NODE_ENV = ENV.NODE_ENV || 'development'
   static readonly DATABASE_URL = obscured.make(ENV.DATABASE_URL)
   static readonly DATABASE_SSL_ENABLED = ENV.DATABASE_SSL_ENABLED ?? false
-  static readonly DATABASE_SSL_REJECT_UNAUTHORIZED = ENV.DATABASE_SSL_REJECT_UNAUTHORIZED ?? true
+  static readonly DATABASE_SSL_REJECT_UNAUTHORIZED = ENV.DATABASE_SSL_REJECT_UNAUTHORIZED ?? false
   static readonly GOOGLE_GENERATIVE_AI_API_KEY = obscured.make(ENV.GOOGLE_GENERATIVE_AI_API_KEY)
   static readonly MODEL_NAME = ENV.MODEL_NAME
killedBy: Database Index Pool Configuration should enable SSL with rejectUnauthorized true by default when DATABASE_SSL_ENABLED is true
statusReason: expected { rejectUnauthorized: false } to match object { rejectUnauthorized: true }

[Survived] LogicalOperator
src/infrastructure/config/env.config.ts:30:26
   static readonly DATABASE_SSL_REJECT_UNAUTHORIZED = ENV.DATABASE_SSL_REJECT_UNAUTHORIZED ?? true
   static readonly GOOGLE_GENERATIVE_AI_API_KEY = obscured.make(ENV.GOOGLE_GENERATIVE_AI_API_KEY)
   static readonly MODEL_NAME = ENV.MODEL_NAME
-  static readonly PORT = ENV.PORT ?? 3001
+  static readonly PORT = ENV.PORT && 3001
   static readonly LOG_LEVEL = ENV.LOG_LEVEL || 'info'
   static readonly DATABASE_CONNECTION_TIMEOUT_MS = ENV.DATABASE_CONNECTION_TIMEOUT_MS ?? 5000

[Survived] LogicalOperator
src/infrastructure/config/env.config.ts:31:31
   static readonly GOOGLE_GENERATIVE_AI_API_KEY = obscured.make(ENV.GOOGLE_GENERATIVE_AI_API_KEY)
   static readonly MODEL_NAME = ENV.MODEL_NAME
   static readonly PORT = ENV.PORT ?? 3001
-  static readonly LOG_LEVEL = ENV.LOG_LEVEL || 'info'
+  static readonly LOG_LEVEL = ENV.LOG_LEVEL && 'info'
   static readonly DATABASE_CONNECTION_TIMEOUT_MS = ENV.DATABASE_CONNECTION_TIMEOUT_MS ?? 5000
   static readonly DATABASE_IDLE_TIMEOUT_MS = ENV.DATABASE_IDLE_TIMEOUT_MS ?? 30000

[Survived] LogicalOperator
src/infrastructure/config/env.config.ts:32:52
   static readonly MODEL_NAME = ENV.MODEL_NAME
   static readonly PORT = ENV.PORT ?? 3001
   static readonly LOG_LEVEL = ENV.LOG_LEVEL || 'info'
-  static readonly DATABASE_CONNECTION_TIMEOUT_MS = ENV.DATABASE_CONNECTION_TIMEOUT_MS ?? 5000
+  static readonly DATABASE_CONNECTION_TIMEOUT_MS = ENV.DATABASE_CONNECTION_TIMEOUT_MS && 5000
   static readonly DATABASE_IDLE_TIMEOUT_MS = ENV.DATABASE_IDLE_TIMEOUT_MS ?? 30000
   static readonly DATABASE_POOL_MAX = ENV.DATABASE_POOL_MAX ?? 20

[Survived] LogicalOperator
src/infrastructure/config/env.config.ts:33:46
   static readonly PORT = ENV.PORT ?? 3001
   static readonly LOG_LEVEL = ENV.LOG_LEVEL || 'info'
   static readonly DATABASE_CONNECTION_TIMEOUT_MS = ENV.DATABASE_CONNECTION_TIMEOUT_MS ?? 5000
-  static readonly DATABASE_IDLE_TIMEOUT_MS = ENV.DATABASE_IDLE_TIMEOUT_MS ?? 30000
+  static readonly DATABASE_IDLE_TIMEOUT_MS = ENV.DATABASE_IDLE_TIMEOUT_MS && 30000
   static readonly DATABASE_POOL_MAX = ENV.DATABASE_POOL_MAX ?? 20
   static readonly DATABASE_POOL_MIN = ENV.DATABASE_POOL_MIN ?? 5

[Survived] LogicalOperator
src/infrastructure/config/env.config.ts:34:39
   static readonly LOG_LEVEL = ENV.LOG_LEVEL || 'info'
   static readonly DATABASE_CONNECTION_TIMEOUT_MS = ENV.DATABASE_CONNECTION_TIMEOUT_MS ?? 5000
   static readonly DATABASE_IDLE_TIMEOUT_MS = ENV.DATABASE_IDLE_TIMEOUT_MS ?? 30000
-  static readonly DATABASE_POOL_MAX = ENV.DATABASE_POOL_MAX ?? 20
+  static readonly DATABASE_POOL_MAX = ENV.DATABASE_POOL_MAX && 20
   static readonly DATABASE_POOL_MIN = ENV.DATABASE_POOL_MIN ?? 5
   static readonly DATABASE_POOL_MAX_LIFETIME_SECONDS = ENV.DATABASE_POOL_MAX_LIFETIME_SECONDS ?? 60

[Survived] LogicalOperator
src/infrastructure/config/env.config.ts:35:39
   static readonly DATABASE_CONNECTION_TIMEOUT_MS = ENV.DATABASE_CONNECTION_TIMEOUT_MS ?? 5000
   static readonly DATABASE_IDLE_TIMEOUT_MS = ENV.DATABASE_IDLE_TIMEOUT_MS ?? 30000
   static readonly DATABASE_POOL_MAX = ENV.DATABASE_POOL_MAX ?? 20
-  static readonly DATABASE_POOL_MIN = ENV.DATABASE_POOL_MIN ?? 5
+  static readonly DATABASE_POOL_MIN = ENV.DATABASE_POOL_MIN && 5
   static readonly DATABASE_POOL_MAX_LIFETIME_SECONDS = ENV.DATABASE_POOL_MAX_LIFETIME_SECONDS ?? 60
   static readonly RESEND_API_KEY = obscured.make(ENV.RESEND_API_KEY)

[Survived] LogicalOperator
src/infrastructure/config/env.config.ts:36:56
   static readonly DATABASE_IDLE_TIMEOUT_MS = ENV.DATABASE_IDLE_TIMEOUT_MS ?? 30000
   static readonly DATABASE_POOL_MAX = ENV.DATABASE_POOL_MAX ?? 20
   static readonly DATABASE_POOL_MIN = ENV.DATABASE_POOL_MIN ?? 5
-  static readonly DATABASE_POOL_MAX_LIFETIME_SECONDS = ENV.DATABASE_POOL_MAX_LIFETIME_SECONDS ?? 60
+  static readonly DATABASE_POOL_MAX_LIFETIME_SECONDS = ENV.DATABASE_POOL_MAX_LIFETIME_SECONDS && 60
   static readonly RESEND_API_KEY = obscured.make(ENV.RESEND_API_KEY)
   static readonly EMAIL_FROM_ADDRESS = ENV.EMAIL_FROM_ADDRESS || ''

[Killed] LogicalOperator
src/infrastructure/config/env.config.ts:38:40
   static readonly DATABASE_POOL_MIN = ENV.DATABASE_POOL_MIN ?? 5
   static readonly DATABASE_POOL_MAX_LIFETIME_SECONDS = ENV.DATABASE_POOL_MAX_LIFETIME_SECONDS ?? 60
   static readonly RESEND_API_KEY = obscured.make(ENV.RESEND_API_KEY)
-  static readonly EMAIL_FROM_ADDRESS = ENV.EMAIL_FROM_ADDRESS || ''
+  static readonly EMAIL_FROM_ADDRESS = ENV.EMAIL_FROM_ADDRESS && ''
   static readonly HOST = ENV.HOST || '127.0.0.1'
   static readonly USE_HTTPS = ENV.USE_HTTPS ?? true
killedBy: EnvConfig EMAIL_FROM_ADDRESS should use EMAIL_FROM_ADDRESS from environment when set
statusReason: expected '' to be 'test@example.com' // Object.is equality

[Killed] StringLiteral
src/infrastructure/config/env.config.ts:38:66
   static readonly DATABASE_POOL_MIN = ENV.DATABASE_POOL_MIN ?? 5
   static readonly DATABASE_POOL_MAX_LIFETIME_SECONDS = ENV.DATABASE_POOL_MAX_LIFETIME_SECONDS ?? 60
   static readonly RESEND_API_KEY = obscured.make(ENV.RESEND_API_KEY)
-  static readonly EMAIL_FROM_ADDRESS = ENV.EMAIL_FROM_ADDRESS || ''
+  static readonly EMAIL_FROM_ADDRESS = ENV.EMAIL_FROM_ADDRESS || "Stryker was here!"
   static readonly HOST = ENV.HOST || '127.0.0.1'
   static readonly USE_HTTPS = ENV.USE_HTTPS ?? true
killedBy: EnvConfig EMAIL_FROM_ADDRESS should default to empty string when EMAIL_FROM_ADDRESS is not set
statusReason: expected 'Stryker was here!' to be '' // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/config/env.config.ts:39:26
   static readonly DATABASE_POOL_MAX_LIFETIME_SECONDS = ENV.DATABASE_POOL_MAX_LIFETIME_SECONDS ?? 60
   static readonly RESEND_API_KEY = obscured.make(ENV.RESEND_API_KEY)
   static readonly EMAIL_FROM_ADDRESS = ENV.EMAIL_FROM_ADDRESS || ''
-  static readonly HOST = ENV.HOST || '127.0.0.1'
+  static readonly HOST = true
   static readonly USE_HTTPS = ENV.USE_HTTPS ?? true
   static readonly JWT_SECRET = ENV.JWT_SECRET
killedBy: EnvConfig HOST should use HOST from environment when set
statusReason: expected true to be '0.0.0.0' // Object.is equality

[Killed] LogicalOperator
src/infrastructure/config/env.config.ts:39:26
   static readonly DATABASE_POOL_MAX_LIFETIME_SECONDS = ENV.DATABASE_POOL_MAX_LIFETIME_SECONDS ?? 60
   static readonly RESEND_API_KEY = obscured.make(ENV.RESEND_API_KEY)
   static readonly EMAIL_FROM_ADDRESS = ENV.EMAIL_FROM_ADDRESS || ''
-  static readonly HOST = ENV.HOST || '127.0.0.1'
+  static readonly HOST = ENV.HOST && '127.0.0.1'
   static readonly USE_HTTPS = ENV.USE_HTTPS ?? true
   static readonly JWT_SECRET = ENV.JWT_SECRET
killedBy: EnvConfig HOST should use HOST from environment when set
statusReason: expected '127.0.0.1' to be '0.0.0.0' // Object.is equality

[Killed] BooleanLiteral
src/infrastructure/config/env.config.ts:40:48
   static readonly RESEND_API_KEY = obscured.make(ENV.RESEND_API_KEY)
   static readonly EMAIL_FROM_ADDRESS = ENV.EMAIL_FROM_ADDRESS || ''
   static readonly HOST = ENV.HOST || '127.0.0.1'
-  static readonly USE_HTTPS = ENV.USE_HTTPS ?? true
+  static readonly USE_HTTPS = ENV.USE_HTTPS ?? false
   static readonly JWT_SECRET = ENV.JWT_SECRET
   static readonly JWT_EXPIRATION = ENV.JWT_EXPIRATION ?? 3600 // 1 hour in seconds
killedBy: EnvConfig USE_HTTPS should default to "true" when USE_HTTPS is not set
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/infrastructure/config/env.config.ts:40:31
   static readonly RESEND_API_KEY = obscured.make(ENV.RESEND_API_KEY)
   static readonly EMAIL_FROM_ADDRESS = ENV.EMAIL_FROM_ADDRESS || ''
   static readonly HOST = ENV.HOST || '127.0.0.1'
-  static readonly USE_HTTPS = ENV.USE_HTTPS ?? true
+  static readonly USE_HTTPS = ENV.USE_HTTPS && true
   static readonly JWT_SECRET = ENV.JWT_SECRET
   static readonly JWT_EXPIRATION = ENV.JWT_EXPIRATION ?? 3600 // 1 hour in seconds
killedBy: EnvConfig USE_HTTPS should default to "true" when USE_HTTPS is not set
statusReason: expected undefined to be true // Object.is equality

[Survived] LogicalOperator
src/infrastructure/config/env.config.ts:42:36
   static readonly HOST = ENV.HOST || '127.0.0.1'
   static readonly USE_HTTPS = ENV.USE_HTTPS ?? true
   static readonly JWT_SECRET = ENV.JWT_SECRET
-  static readonly JWT_EXPIRATION = ENV.JWT_EXPIRATION ?? 3600 // 1 hour in seconds
+  static readonly JWT_EXPIRATION = ENV.JWT_EXPIRATION && 3600 // 1 hour in seconds
   static readonly JWT_ISSUER = ENV.JWT_ISSUER || 'my-app'
   static readonly API_VERSION = ENV.API_VERSION || 'v1'

[Killed] LogicalOperator
src/infrastructure/config/env.config.ts:43:32
   static readonly USE_HTTPS = ENV.USE_HTTPS ?? true
   static readonly JWT_SECRET = ENV.JWT_SECRET
   static readonly JWT_EXPIRATION = ENV.JWT_EXPIRATION ?? 3600 // 1 hour in seconds
-  static readonly JWT_ISSUER = ENV.JWT_ISSUER || 'my-app'
+  static readonly JWT_ISSUER = ENV.JWT_ISSUER && 'my-app'
   static readonly API_VERSION = ENV.API_VERSION || 'v1'
   static readonly UPSTASH_REDIS_REST_URL = obscured.make(ENV.UPSTASH_REDIS_REST_URL)
killedBy: EnvConfig validate() should throw when ENCRYPTION_KEY is missing
statusReason: expected [Function] to throw error matching /Missing required environment variable…/ but got 'Invalid JWT_ISSUER value \'my-app\'. …'

[Killed] LogicalOperator
src/infrastructure/config/env.config.ts:44:33
   static readonly JWT_SECRET = ENV.JWT_SECRET
   static readonly JWT_EXPIRATION = ENV.JWT_EXPIRATION ?? 3600 // 1 hour in seconds
   static readonly JWT_ISSUER = ENV.JWT_ISSUER || 'my-app'
-  static readonly API_VERSION = ENV.API_VERSION || 'v1'
+  static readonly API_VERSION = ENV.API_VERSION && 'v1'
   static readonly UPSTASH_REDIS_REST_URL = obscured.make(ENV.UPSTASH_REDIS_REST_URL)
   static readonly UPSTASH_REDIS_REST_TOKEN = obscured.make(ENV.UPSTASH_REDIS_REST_TOKEN)
killedBy: EnvConfig API_VERSION should default to "v1" when API_VERSION is not set
statusReason: expected undefined to be 'v1' // Object.is equality

[Killed] BooleanLiteral
src/infrastructure/config/env.config.ts:49:82
   static readonly UPSTASH_REDIS_REST_TOKEN = obscured.make(ENV.UPSTASH_REDIS_REST_TOKEN)
   static readonly OAUTH_SYNC_SECRET = obscured.make(ENV.OAUTH_SYNC_SECRET)
   static readonly SENTRY_DSN = obscured.make(ENV.SENTRY_DSN)
-  static readonly SENTRY_ENABLED = EnvConfig.parseBooleanEnv(ENV.SENTRY_ENABLED, false)
+  static readonly SENTRY_ENABLED = EnvConfig.parseBooleanEnv(ENV.SENTRY_ENABLED, true)
   static readonly SENTRY_AUTH_TOKEN = ENV.SENTRY_AUTH_TOKEN || ''
   static readonly SENTRY_PROJECT = ENV.SENTRY_PROJECT || ''
killedBy: EnvConfig SENTRY_ENABLED should have type string
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/config/env.config.ts:50:39
   static readonly OAUTH_SYNC_SECRET = obscured.make(ENV.OAUTH_SYNC_SECRET)
   static readonly SENTRY_DSN = obscured.make(ENV.SENTRY_DSN)
   static readonly SENTRY_ENABLED = EnvConfig.parseBooleanEnv(ENV.SENTRY_ENABLED, false)
-  static readonly SENTRY_AUTH_TOKEN = ENV.SENTRY_AUTH_TOKEN || ''
+  static readonly SENTRY_AUTH_TOKEN = true
   static readonly SENTRY_PROJECT = ENV.SENTRY_PROJECT || ''
   static readonly SENTRY_ORG = ENV.SENTRY_ORG || ''
killedBy: EnvConfig SENTRY_AUTH_TOKEN should use SENTRY_AUTH_TOKEN from environment when set
statusReason: expected true to be 'sntrys_production_token_abc123' // Object.is equality

[Killed] LogicalOperator
src/infrastructure/config/env.config.ts:50:39
   static readonly OAUTH_SYNC_SECRET = obscured.make(ENV.OAUTH_SYNC_SECRET)
   static readonly SENTRY_DSN = obscured.make(ENV.SENTRY_DSN)
   static readonly SENTRY_ENABLED = EnvConfig.parseBooleanEnv(ENV.SENTRY_ENABLED, false)
-  static readonly SENTRY_AUTH_TOKEN = ENV.SENTRY_AUTH_TOKEN || ''
+  static readonly SENTRY_AUTH_TOKEN = ENV.SENTRY_AUTH_TOKEN && ''
   static readonly SENTRY_PROJECT = ENV.SENTRY_PROJECT || ''
   static readonly SENTRY_ORG = ENV.SENTRY_ORG || ''
killedBy: EnvConfig SENTRY_AUTH_TOKEN should use SENTRY_AUTH_TOKEN from environment when set
statusReason: expected '' to be 'sntrys_production_token_abc123' // Object.is equality

[Killed] LogicalOperator
src/infrastructure/config/env.config.ts:51:36
   static readonly SENTRY_DSN = obscured.make(ENV.SENTRY_DSN)
   static readonly SENTRY_ENABLED = EnvConfig.parseBooleanEnv(ENV.SENTRY_ENABLED, false)
   static readonly SENTRY_AUTH_TOKEN = ENV.SENTRY_AUTH_TOKEN || ''
-  static readonly SENTRY_PROJECT = ENV.SENTRY_PROJECT || ''
+  static readonly SENTRY_PROJECT = ENV.SENTRY_PROJECT && ''
   static readonly SENTRY_ORG = ENV.SENTRY_ORG || ''
   static readonly CLOUDFLARE_ACCESS_SECRET = obscured.make(ENV.CLOUDFLARE_ACCESS_SECRET) || ''
killedBy: EnvConfig SENTRY_PROJECT should use SENTRY_PROJECT from environment when set
statusReason: expected '' to be 'production-project' // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/config/env.config.ts:51:36
   static readonly SENTRY_DSN = obscured.make(ENV.SENTRY_DSN)
   static readonly SENTRY_ENABLED = EnvConfig.parseBooleanEnv(ENV.SENTRY_ENABLED, false)
   static readonly SENTRY_AUTH_TOKEN = ENV.SENTRY_AUTH_TOKEN || ''
-  static readonly SENTRY_PROJECT = ENV.SENTRY_PROJECT || ''
+  static readonly SENTRY_PROJECT = true
   static readonly SENTRY_ORG = ENV.SENTRY_ORG || ''
   static readonly CLOUDFLARE_ACCESS_SECRET = obscured.make(ENV.CLOUDFLARE_ACCESS_SECRET) || ''
killedBy: EnvConfig SENTRY_PROJECT should use SENTRY_PROJECT from environment when set
statusReason: expected true to be 'production-project' // Object.is equality

[Killed] LogicalOperator
src/infrastructure/config/env.config.ts:52:32
   static readonly SENTRY_ENABLED = EnvConfig.parseBooleanEnv(ENV.SENTRY_ENABLED, false)
   static readonly SENTRY_AUTH_TOKEN = ENV.SENTRY_AUTH_TOKEN || ''
   static readonly SENTRY_PROJECT = ENV.SENTRY_PROJECT || ''
-  static readonly SENTRY_ORG = ENV.SENTRY_ORG || ''
+  static readonly SENTRY_ORG = ENV.SENTRY_ORG && ''
   static readonly CLOUDFLARE_ACCESS_SECRET = obscured.make(ENV.CLOUDFLARE_ACCESS_SECRET) || ''
   static readonly CLOUDFLARE_ACCESS_ID = obscured.make(ENV.CLOUDFLARE_ACCESS_ID) || ''
killedBy: EnvConfig SENTRY_ORG should use SENTRY_ORG from environment when set
statusReason: expected '' to be 'acme-corp' // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/config/env.config.ts:52:32
   static readonly SENTRY_ENABLED = EnvConfig.parseBooleanEnv(ENV.SENTRY_ENABLED, false)
   static readonly SENTRY_AUTH_TOKEN = ENV.SENTRY_AUTH_TOKEN || ''
   static readonly SENTRY_PROJECT = ENV.SENTRY_PROJECT || ''
-  static readonly SENTRY_ORG = ENV.SENTRY_ORG || ''
+  static readonly SENTRY_ORG = false
   static readonly CLOUDFLARE_ACCESS_SECRET = obscured.make(ENV.CLOUDFLARE_ACCESS_SECRET) || ''
   static readonly CLOUDFLARE_ACCESS_ID = obscured.make(ENV.CLOUDFLARE_ACCESS_ID) || ''
killedBy: EnvConfig SENTRY_ORG should use SENTRY_ORG from environment when set
statusReason: expected false to be 'acme-corp' // Object.is equality

[Killed] LogicalOperator
src/infrastructure/config/env.config.ts:55:41
   static readonly SENTRY_ORG = ENV.SENTRY_ORG || ''
   static readonly CLOUDFLARE_ACCESS_SECRET = obscured.make(ENV.CLOUDFLARE_ACCESS_SECRET) || ''
   static readonly CLOUDFLARE_ACCESS_ID = obscured.make(ENV.CLOUDFLARE_ACCESS_ID) || ''
-  static readonly CLOUDFLARE_ENDPOINT = ENV.CLOUDFLARE_ENDPOINT || ''
+  static readonly CLOUDFLARE_ENDPOINT = ENV.CLOUDFLARE_ENDPOINT && ''
   static readonly CLOUDFLARE_API = obscured.make(ENV.CLOUDFLARE_API) || ''
   static readonly BUCKET = ENV.BUCKET || ''
killedBy: EnvConfig CLOUDFLARE_ENDPOINT should use CLOUDFLARE_ENDPOINT from environment when set
statusReason: expected '' to be 'https://cf.example.com' // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/config/env.config.ts:56:36
   static readonly CLOUDFLARE_ACCESS_SECRET = obscured.make(ENV.CLOUDFLARE_ACCESS_SECRET) || ''
   static readonly CLOUDFLARE_ACCESS_ID = obscured.make(ENV.CLOUDFLARE_ACCESS_ID) || ''
   static readonly CLOUDFLARE_ENDPOINT = ENV.CLOUDFLARE_ENDPOINT || ''
-  static readonly CLOUDFLARE_API = obscured.make(ENV.CLOUDFLARE_API) || ''
+  static readonly CLOUDFLARE_API = false
   static readonly BUCKET = ENV.BUCKET || ''
   static readonly OTEL_CAPTURE_QUERY_TEXT = ENV.OTEL_CAPTURE_QUERY_TEXT ?? false
killedBy: EnvConfig CLOUDFLARE_API should have type Obscured<string | undefined> | ""
statusReason: expected 'boolean' to be 'object' // Object.is equality

[Killed] LogicalOperator
src/infrastructure/config/env.config.ts:56:36
   static readonly CLOUDFLARE_ACCESS_SECRET = obscured.make(ENV.CLOUDFLARE_ACCESS_SECRET) || ''
   static readonly CLOUDFLARE_ACCESS_ID = obscured.make(ENV.CLOUDFLARE_ACCESS_ID) || ''
   static readonly CLOUDFLARE_ENDPOINT = ENV.CLOUDFLARE_ENDPOINT || ''
-  static readonly CLOUDFLARE_API = obscured.make(ENV.CLOUDFLARE_API) || ''
+  static readonly CLOUDFLARE_API = obscured.make(ENV.CLOUDFLARE_API) && ''
   static readonly BUCKET = ENV.BUCKET || ''
   static readonly OTEL_CAPTURE_QUERY_TEXT = ENV.OTEL_CAPTURE_QUERY_TEXT ?? false
killedBy: EnvConfig CLOUDFLARE_API should have type Obscured<string | undefined> | ""
statusReason: expected 'string' to be 'object' // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/config/env.config.ts:57:28
   static readonly CLOUDFLARE_ACCESS_ID = obscured.make(ENV.CLOUDFLARE_ACCESS_ID) || ''
   static readonly CLOUDFLARE_ENDPOINT = ENV.CLOUDFLARE_ENDPOINT || ''
   static readonly CLOUDFLARE_API = obscured.make(ENV.CLOUDFLARE_API) || ''
-  static readonly BUCKET = ENV.BUCKET || ''
+  static readonly BUCKET = false
   static readonly OTEL_CAPTURE_QUERY_TEXT = ENV.OTEL_CAPTURE_QUERY_TEXT ?? false
   static readonly ENCRYPTION_KEY = obscured.make(ENV.ENCRYPTION_KEY) || ''
killedBy: EnvConfig BUCKET should use BUCKET from environment when set
statusReason: expected false to be 'production-bucket' // Object.is equality

[Killed] LogicalOperator
src/infrastructure/config/env.config.ts:57:28
   static readonly CLOUDFLARE_ACCESS_ID = obscured.make(ENV.CLOUDFLARE_ACCESS_ID) || ''
   static readonly CLOUDFLARE_ENDPOINT = ENV.CLOUDFLARE_ENDPOINT || ''
   static readonly CLOUDFLARE_API = obscured.make(ENV.CLOUDFLARE_API) || ''
-  static readonly BUCKET = ENV.BUCKET || ''
+  static readonly BUCKET = ENV.BUCKET && ''
   static readonly OTEL_CAPTURE_QUERY_TEXT = ENV.OTEL_CAPTURE_QUERY_TEXT ?? false
   static readonly ENCRYPTION_KEY = obscured.make(ENV.ENCRYPTION_KEY) || ''
killedBy: EnvConfig BUCKET should use BUCKET from environment when set
statusReason: expected '' to be 'production-bucket' // Object.is equality

[Survived] LogicalOperator
src/infrastructure/config/env.config.ts:58:45
   static readonly CLOUDFLARE_ENDPOINT = ENV.CLOUDFLARE_ENDPOINT || ''
   static readonly CLOUDFLARE_API = obscured.make(ENV.CLOUDFLARE_API) || ''
   static readonly BUCKET = ENV.BUCKET || ''
-  static readonly OTEL_CAPTURE_QUERY_TEXT = ENV.OTEL_CAPTURE_QUERY_TEXT ?? false
+  static readonly OTEL_CAPTURE_QUERY_TEXT = ENV.OTEL_CAPTURE_QUERY_TEXT && false
   static readonly ENCRYPTION_KEY = obscured.make(ENV.ENCRYPTION_KEY) || ''
   static readonly REFRESH_TOKEN_EXPIRATION = ENV.REFRESH_TOKEN_EXPIRATION ?? 604800 // 7 days in seconds

[Survived] BooleanLiteral
src/infrastructure/config/env.config.ts:58:76
   static readonly CLOUDFLARE_ENDPOINT = ENV.CLOUDFLARE_ENDPOINT || ''
   static readonly CLOUDFLARE_API = obscured.make(ENV.CLOUDFLARE_API) || ''
   static readonly BUCKET = ENV.BUCKET || ''
-  static readonly OTEL_CAPTURE_QUERY_TEXT = ENV.OTEL_CAPTURE_QUERY_TEXT ?? false
+  static readonly OTEL_CAPTURE_QUERY_TEXT = ENV.OTEL_CAPTURE_QUERY_TEXT ?? true
   static readonly ENCRYPTION_KEY = obscured.make(ENV.ENCRYPTION_KEY) || ''
   static readonly REFRESH_TOKEN_EXPIRATION = ENV.REFRESH_TOKEN_EXPIRATION ?? 604800 // 7 days in seconds

[Killed] LogicalOperator
src/infrastructure/config/env.config.ts:60:46
   static readonly BUCKET = ENV.BUCKET || ''
   static readonly OTEL_CAPTURE_QUERY_TEXT = ENV.OTEL_CAPTURE_QUERY_TEXT ?? false
   static readonly ENCRYPTION_KEY = obscured.make(ENV.ENCRYPTION_KEY) || ''
-  static readonly REFRESH_TOKEN_EXPIRATION = ENV.REFRESH_TOKEN_EXPIRATION ?? 604800 // 7 days in seconds
+  static readonly REFRESH_TOKEN_EXPIRATION = ENV.REFRESH_TOKEN_EXPIRATION && 604800 // 7 days in seconds
   static readonly ACCESS_TOKEN_BUFFER = ENV.ACCESS_TOKEN_BUFFER ?? 300 // 5 minutes in seconds
   static readonly SERVICE_NAME = ENV.SERVICE_NAME || 'norberts-spark-backend'
killedBy: EnvConfig REFRESH_TOKEN_EXPIRATION should use REFRESH_TOKEN_EXPIRATION from environment when set
statusReason: expected 604800 to be 1209600 // Object.is equality

[Killed] LogicalOperator
src/infrastructure/config/env.config.ts:61:41
   static readonly OTEL_CAPTURE_QUERY_TEXT = ENV.OTEL_CAPTURE_QUERY_TEXT ?? false
   static readonly ENCRYPTION_KEY = obscured.make(ENV.ENCRYPTION_KEY) || ''
   static readonly REFRESH_TOKEN_EXPIRATION = ENV.REFRESH_TOKEN_EXPIRATION ?? 604800 // 7 days in seconds
-  static readonly ACCESS_TOKEN_BUFFER = ENV.ACCESS_TOKEN_BUFFER ?? 300 // 5 minutes in seconds
+  static readonly ACCESS_TOKEN_BUFFER = ENV.ACCESS_TOKEN_BUFFER && 300 // 5 minutes in seconds
   static readonly SERVICE_NAME = ENV.SERVICE_NAME || 'norberts-spark-backend'
   static readonly APP_VERSION = ENV.APP_VERSION || version
killedBy: EnvConfig ACCESS_TOKEN_BUFFER should use ACCESS_TOKEN_BUFFER from environment when set
statusReason: expected 300 to be '600' // Object.is equality

[Survived] LogicalOperator
src/infrastructure/config/env.config.ts:62:34
   static readonly ENCRYPTION_KEY = obscured.make(ENV.ENCRYPTION_KEY) || ''
   static readonly REFRESH_TOKEN_EXPIRATION = ENV.REFRESH_TOKEN_EXPIRATION ?? 604800 // 7 days in seconds
   static readonly ACCESS_TOKEN_BUFFER = ENV.ACCESS_TOKEN_BUFFER ?? 300 // 5 minutes in seconds
-  static readonly SERVICE_NAME = ENV.SERVICE_NAME || 'norberts-spark-backend'
+  static readonly SERVICE_NAME = ENV.SERVICE_NAME && 'norberts-spark-backend'
   static readonly APP_VERSION = ENV.APP_VERSION || version
   static readonly REDIS_URL = obscured.make(ENV.REDIS_URL)

[Survived] ConditionalExpression
src/infrastructure/config/env.config.ts:62:34
   static readonly ENCRYPTION_KEY = obscured.make(ENV.ENCRYPTION_KEY) || ''
   static readonly REFRESH_TOKEN_EXPIRATION = ENV.REFRESH_TOKEN_EXPIRATION ?? 604800 // 7 days in seconds
   static readonly ACCESS_TOKEN_BUFFER = ENV.ACCESS_TOKEN_BUFFER ?? 300 // 5 minutes in seconds
-  static readonly SERVICE_NAME = ENV.SERVICE_NAME || 'norberts-spark-backend'
+  static readonly SERVICE_NAME = true
   static readonly APP_VERSION = ENV.APP_VERSION || version
   static readonly REDIS_URL = obscured.make(ENV.REDIS_URL)

[Survived] ConditionalExpression
src/infrastructure/config/env.config.ts:63:33
   static readonly REFRESH_TOKEN_EXPIRATION = ENV.REFRESH_TOKEN_EXPIRATION ?? 604800 // 7 days in seconds
   static readonly ACCESS_TOKEN_BUFFER = ENV.ACCESS_TOKEN_BUFFER ?? 300 // 5 minutes in seconds
   static readonly SERVICE_NAME = ENV.SERVICE_NAME || 'norberts-spark-backend'
-  static readonly APP_VERSION = ENV.APP_VERSION || version
+  static readonly APP_VERSION = false
   static readonly REDIS_URL = obscured.make(ENV.REDIS_URL)
   static readonly APPLICATION_NAME = ENV.APPLICATION_NAME || "Norbert's Spark Backend"

[Survived] ConditionalExpression
src/infrastructure/config/env.config.ts:63:33
   static readonly REFRESH_TOKEN_EXPIRATION = ENV.REFRESH_TOKEN_EXPIRATION ?? 604800 // 7 days in seconds
   static readonly ACCESS_TOKEN_BUFFER = ENV.ACCESS_TOKEN_BUFFER ?? 300 // 5 minutes in seconds
   static readonly SERVICE_NAME = ENV.SERVICE_NAME || 'norberts-spark-backend'
-  static readonly APP_VERSION = ENV.APP_VERSION || version
+  static readonly APP_VERSION = true
   static readonly REDIS_URL = obscured.make(ENV.REDIS_URL)
   static readonly APPLICATION_NAME = ENV.APPLICATION_NAME || "Norbert's Spark Backend"
