[Killed] ConditionalExpression
src/domain/value-objects/uuid.ts:31:9
   }
 
   private processUserUUID(userUUID: string): UUIDType<T> {
-    if (!Uuid7Util.isValidUUID(userUUID)) {
+    if (false) {
       throw new Error('Invalid userID UUID format provided')
     }
killedBy: Uuid Value Object Constructor should validate UUID format using Uuid7Util.isValidUUID
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] ConditionalExpression
src/domain/value-objects/uuid.ts:31:9
   }
 
   private processUserUUID(userUUID: string): UUIDType<T> {
-    if (!Uuid7Util.isValidUUID(userUUID)) {
+    if (true) {
       throw new Error('Invalid userID UUID format provided')
     }
killedBy: PutChatTypeDto constructor should create PutChatTypeDto with all fields
statusReason: Invalid userID UUID format provided

[Killed] StringLiteral
src/domain/value-objects/uuid.ts:32:23
 
   private processUserUUID(userUUID: string): UUIDType<T> {
     if (!Uuid7Util.isValidUUID(userUUID)) {
-      throw new Error('Invalid userID UUID format provided')
+      throw new Error("")
     }
     // Validate the UUID version but return the UUID itself, not the version string
killedBy: Uuid Value Object Constructor should throw error for invalid UUID format
statusReason: expected [Function] to throw error including 'Invalid userID UUID format provided' but got ''
