[Killed] ConditionalExpression
src/shared/utils/uuid7.util.ts:45:9
    * ```
    */
   static uuidVersionValidation(uuid: Uuid7UtilInputType): string | undefined {
-    if (!isString(uuid)) return undefined
+    if (true) return undefined
     return uuidVersionValidation(uuid)
   }
killedBy: LoginUserUseCase execute() successful login should login user successfully with valid credentials
statusReason: Invalid userID UUID version: undefined

[Killed] BooleanLiteral
src/shared/utils/uuid7.util.ts:45:9
    * ```
    */
   static uuidVersionValidation(uuid: Uuid7UtilInputType): string | undefined {
-    if (!isString(uuid)) return undefined
+    if (isString(uuid)) return undefined
     return uuidVersionValidation(uuid)
   }
killedBy: ResolveChatTypeUseCase successful resolution by UUID should resolve chat type when param is a valid UUID
statusReason: Invalid userID UUID version: undefined

[Killed] BooleanLiteral
src/shared/utils/uuid7.util.ts:64:9
    * ```
    */
   static isValidUUID(uuid: Uuid7UtilInputType): boolean {
-    if (!isString(uuid)) return false
+    if (isString(uuid)) return false
     return isValidUUID(uuid)
   }
killedBy: GetCompanyDetailsUseCase execute() - successful scenarios should retrieve company and key person details successfully
statusReason: Invalid userID UUID format provided

[Killed] ConditionalExpression
src/shared/utils/uuid7.util.ts:64:9
    * ```
    */
   static isValidUUID(uuid: Uuid7UtilInputType): boolean {
-    if (!isString(uuid)) return false
+    if (true) return false
     return isValidUUID(uuid)
   }
killedBy: User Entity Constructor should create a user with all required fields
statusReason: Invalid userID UUID format provided

[Killed] ConditionalExpression
src/shared/utils/uuid7.util.ts:118:9
    * ```
    */
   static toBase64(uuid: Uuid7UtilInputType): string | undefined {
-    if (!isString(uuid)) return undefined
+    if (true) return undefined
     if (this.uuidVersionValidation(uuid) !== 'v7') return undefined
     const hex = uuid.replace(/-/g, '')
killedBy: PostChatTypesUseCase execute() - successful scenarios should call createChatType with correctly shaped data
statusReason: Failed to generate a valid base64 ID for the new chat type

[Survived] ConditionalExpression
src/shared/utils/uuid7.util.ts:118:9
    * ```
    */
   static toBase64(uuid: Uuid7UtilInputType): string | undefined {
-    if (!isString(uuid)) return undefined
+    if (false) return undefined
     if (this.uuidVersionValidation(uuid) !== 'v7') return undefined
     const hex = uuid.replace(/-/g, '')

[Killed] ConditionalExpression
src/shared/utils/uuid7.util.ts:119:9
    */
   static toBase64(uuid: Uuid7UtilInputType): string | undefined {
     if (!isString(uuid)) return undefined
-    if (this.uuidVersionValidation(uuid) !== 'v7') return undefined
+    if (false) return undefined
     const hex = uuid.replace(/-/g, '')
     const buffer = Buffer.from(hex, 'hex')
killedBy: Chat Types Seed Script Base64 URL Encoding should only accept v7 UUIDs
statusReason: expected 'VQ6EAOKbQdSnFkRmVUQAAA' to be undefined

[Killed] ConditionalExpression
src/shared/utils/uuid7.util.ts:119:9
    */
   static toBase64(uuid: Uuid7UtilInputType): string | undefined {
     if (!isString(uuid)) return undefined
-    if (this.uuidVersionValidation(uuid) !== 'v7') return undefined
+    if (true) return undefined
     const hex = uuid.replace(/-/g, '')
     const buffer = Buffer.from(hex, 'hex')
killedBy: Chat Types Seed Script Chat Type Preparation Logic should generate base64-encoded ID from UUID
statusReason: expected undefined to be truthy
