[Killed] BlockStatement
src/shared/exceptions/base.exception.ts:17:12
     Error.captureStackTrace(this, this.constructor)
   }
 
-  toJSON() {
-    return {
-      name: this.name,
-      message: this.message,
-      code: this.code,
-      statusCode: this.statusCode,
-      details: this.details,
-    }
-  }
+  toJSON() {}
 }
 
killedBy: UnprocessableEntityException toJSON should serialize with all properties using default code
statusReason: expected undefined to deeply equal { …(5) }
