[NoCoverage] BlockStatement
infrastructure/di/container/index.ts:3:23
 import { Container } from '../container.js'
 
-async function main() {
-  const container = Container.getInstance()
-  await container.start()
-
-  // Graceful shutdown
-  let isShuttingDown = false
-  const shutdown = async () => {
-    if (isShuttingDown) return
-    isShuttingDown = true
-    try {
-      await container.stop()
-      process.exit(0)
-    } catch (err) {
-      console.error('Error during shutdown:', err)
-      process.exit(1)
-    }
-  }
-
-  process.once('SIGINT', shutdown)
-  process.once('SIGTERM', shutdown)
-}
+async function main() {}
 
 main().catch(console.error)

[NoCoverage] BooleanLiteral
infrastructure/di/container/index.ts:8:24
   await container.start()
 
   // Graceful shutdown
-  let isShuttingDown = false
+  let isShuttingDown = true
   const shutdown = async () => {
     if (isShuttingDown) return

[NoCoverage] BlockStatement
infrastructure/di/container/index.ts:9:32
 
   // Graceful shutdown
   let isShuttingDown = false
-  const shutdown = async () => {
-    if (isShuttingDown) return
-    isShuttingDown = true
-    try {
-      await container.stop()
-      process.exit(0)
-    } catch (err) {
-      console.error('Error during shutdown:', err)
-      process.exit(1)
-    }
-  }
+  const shutdown = async () => {}
 
   process.once('SIGINT', shutdown)

[NoCoverage] ConditionalExpression
infrastructure/di/container/index.ts:10:9
   // Graceful shutdown
   let isShuttingDown = false
   const shutdown = async () => {
-    if (isShuttingDown) return
+    if (false) return
     isShuttingDown = true
     try {

[NoCoverage] ConditionalExpression
infrastructure/di/container/index.ts:10:9
   // Graceful shutdown
   let isShuttingDown = false
   const shutdown = async () => {
-    if (isShuttingDown) return
+    if (true) return
     isShuttingDown = true
     try {

[NoCoverage] BooleanLiteral
infrastructure/di/container/index.ts:11:22
   let isShuttingDown = false
   const shutdown = async () => {
     if (isShuttingDown) return
-    isShuttingDown = true
+    isShuttingDown = false
     try {
       await container.stop()

[NoCoverage] BlockStatement
infrastructure/di/container/index.ts:12:9
   const shutdown = async () => {
     if (isShuttingDown) return
     isShuttingDown = true
-    try {
-      await container.stop()
-      process.exit(0)
-    } catch (err) {
+    try {} catch (err) {
       console.error('Error during shutdown:', err)
       process.exit(1)

[NoCoverage] BlockStatement
infrastructure/di/container/index.ts:15:19
     try {
       await container.stop()
       process.exit(0)
-    } catch (err) {
-      console.error('Error during shutdown:', err)
-      process.exit(1)
-    }
+    } catch (err) {}
   }
 
