[Survived] ConditionalExpression
src/infrastructure/di/container.ts:188:29
       const __filename = fileURLToPath(import.meta.url)
       const __dirname = dirname(__filename)
 
-      const isDevelopment = EnvConfig.NODE_ENV !== 'production'
+      const isDevelopment = false
       const useHttps = isDevelopment && String(EnvConfig.USE_HTTPS) === 'true'
 

[Survived] LogicalOperator
src/infrastructure/di/container.ts:189:24
       const __dirname = dirname(__filename)
 
       const isDevelopment = EnvConfig.NODE_ENV !== 'production'
-      const useHttps = isDevelopment && String(EnvConfig.USE_HTTPS) === 'true'
+      const useHttps = isDevelopment || String(EnvConfig.USE_HTTPS) === 'true'
 
       let httpsOptions: FastifyServerOptions | undefined

[Survived] ConditionalExpression
src/infrastructure/di/container.ts:189:24
       const __dirname = dirname(__filename)
 
       const isDevelopment = EnvConfig.NODE_ENV !== 'production'
-      const useHttps = isDevelopment && String(EnvConfig.USE_HTTPS) === 'true'
+      const useHttps = true
 
       let httpsOptions: FastifyServerOptions | undefined

[Survived] ConditionalExpression
src/infrastructure/di/container.ts:192:11
       const useHttps = isDevelopment && String(EnvConfig.USE_HTTPS) === 'true'
 
       let httpsOptions: FastifyServerOptions | undefined
-      if (useHttps) {
+      if (false) {
         // __dirname points to src/infrastructure/di/ directory
         // Go up to backend root, then into certs/

[Survived] ConditionalExpression
src/infrastructure/di/container.ts:192:11
       const useHttps = isDevelopment && String(EnvConfig.USE_HTTPS) === 'true'
 
       let httpsOptions: FastifyServerOptions | undefined
-      if (useHttps) {
+      if (true) {
         // __dirname points to src/infrastructure/di/ directory
         // Go up to backend root, then into certs/

[Survived] StringLiteral
src/infrastructure/di/container.ts:195:43
       if (useHttps) {
         // __dirname points to src/infrastructure/di/ directory
         // Go up to backend root, then into certs/
-        const certsPath = join(__dirname, '../../..', 'certs')
+        const certsPath = join(__dirname, "", 'certs')
 
         try {

[Survived] BlockStatement
src/infrastructure/di/container.ts:197:13
         // Go up to backend root, then into certs/
         const certsPath = join(__dirname, '../../..', 'certs')
 
-        try {
-          httpsOptions = {
-            https: {
-              key: readFileSync(join(certsPath, 'key.pem')),
-              cert: readFileSync(join(certsPath, 'cert.pem')),
-            },
-          } as FastifyServerOptions
-          this.logger.info('🔒 HTTPS enabled for development')
-        } catch {
+        try {} catch {
           const instructions = `To generate certificates with proper Subject Alternative Names:
 cd apps/backend/certs && mkcert -key-file key.pem -cert-file cert.pem \\

[NoCoverage] BlockStatement
src/infrastructure/di/container.ts:205:17
             },
           } as FastifyServerOptions
           this.logger.info('🔒 HTTPS enabled for development')
-        } catch {
-          const instructions = `To generate certificates with proper Subject Alternative Names:
-cd apps/backend/certs && mkcert -key-file key.pem -cert-file cert.pem \\
-  localhost \\
-  127.0.0.1 \\
-  ::1 \\
-  *.localhost \\
-  local.dev \\
-  0.0.0.0`
-
-          this.logger.warn('⚠️  HTTPS certificates not found, falling back to HTTP', {
-            certsPath,
-            instructions,
-          })
-        }
+        } catch {}
       }
 

[NoCoverage] ObjectLiteral
src/infrastructure/di/container.ts:215:86
   local.dev \\
   0.0.0.0`
 
-          this.logger.warn('⚠️  HTTPS certificates not found, falling back to HTTP', {
-            certsPath,
-            instructions,
-          })
+          this.logger.warn('⚠️  HTTPS certificates not found, falling back to HTTP', {})
         }
       }

[Killed] StringLiteral
src/infrastructure/di/container.ts:226:9
       this.app = createFastifyApp(httpsOptions)
     } catch (error) {
       throw new Error(
-        `Failed to initialize Fastify app: ${error instanceof Error ? error.message : error}`,
+        ``,
         { cause: error }
       )
killedBy: Container Error Handling should throw error when Fastify app initialization fails
statusReason: expected [Function] to throw error including 'Failed to initialize Fastify app' but got ''

[Survived] ObjectLiteral
src/infrastructure/di/container.ts:227:9
     } catch (error) {
       throw new Error(
         `Failed to initialize Fastify app: ${error instanceof Error ? error.message : error}`,
-        { cause: error }
+        {}
       )
     }

[Killed] BlockStatement
src/infrastructure/di/container.ts:445:34
    *
    * @private
    */
-  private registerRoutes(): void {
-    // Register all API routes under /api/v1 prefix
-    this.app.register(
-      (instance, _opts, done) => {
-        this.userController.registerRoutes(instance)
-        this.authController.registerRoutes(instance)
-        this.aiController.registerRoutes(instance)
-        this.aiConfigController.registerRoutes(instance)
-        this.aiExtractDataController.registerRoutes(instance)
-        this.aiAdminController.registerRoutes(instance)
-        this.companyController.registerRoutes(instance)
-        this.aiRagController.registerRoutes(instance)
-        done()
-      },
-      { prefix: `/api/${EnvConfig.API_VERSION}` }
-    )
-  }
+  private registerRoutes(): void {}
 
   /**
killedBy: Container Initialization should register routes during initialization
statusReason: expected "vi.fn()" to be called at least once

[NoCoverage] BlockStatement
src/infrastructure/di/container.ts:448:34
   private registerRoutes(): void {
     // Register all API routes under /api/v1 prefix
     this.app.register(
-      (instance, _opts, done) => {
-        this.userController.registerRoutes(instance)
-        this.authController.registerRoutes(instance)
-        this.aiController.registerRoutes(instance)
-        this.aiConfigController.registerRoutes(instance)
-        this.aiExtractDataController.registerRoutes(instance)
-        this.aiAdminController.registerRoutes(instance)
-        this.companyController.registerRoutes(instance)
-        this.aiRagController.registerRoutes(instance)
-        done()
-      },
+      (instance, _opts, done) => {},
       { prefix: `/api/${EnvConfig.API_VERSION}` }
     )

[Survived] ObjectLiteral
src/infrastructure/di/container.ts:459:7
         this.aiRagController.registerRoutes(instance)
         done()
       },
-      { prefix: `/api/${EnvConfig.API_VERSION}` }
+      {}
     )
   }

[Killed] BooleanLiteral
src/infrastructure/di/container.ts:478:9
    * ```
    */
   static getInstance(): Container {
-    if (!Container.instance) {
+    if (Container.instance) {
       Container.instance = new Container()
     }
killedBy: Container Singleton Pattern should create only one instance
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/infrastructure/di/container.ts:478:9
    * ```
    */
   static getInstance(): Container {
-    if (!Container.instance) {
+    if (false) {
       Container.instance = new Container()
     }
killedBy: Container Singleton Pattern should create only one instance
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/infrastructure/di/container.ts:500:32
    * * // Server is now listening on the configured host and port (HTTP or HTTPS)
    * ```
    */
-  async start(): Promise<void> {
-    try {
-      const port = Number(EnvConfig.PORT)
-      const host = String(EnvConfig.HOST)
-      const isDevelopment = EnvConfig.NODE_ENV !== 'production'
-      const useHttps = isDevelopment && String(EnvConfig.USE_HTTPS) === 'true'
-      const appName = EnvConfig.APPLICATION_NAME
-
-      await this.app.listen({ port, host })
-      const protocol = useHttps ? 'https' : 'http'
-      this.logger.info(`Server started successfully ${appName}`)
-      this.logger.info(`Server listening on ${protocol}://${host}:${port}`)
-      this.logger.info(`📚 API Documentation: ${protocol}://${host}:${port}/docs`)
-    } catch (error) {
-      this.logger.error('Failed to start server', error as Error)
-      process.exit(1)
-    }
-  }
+  async start(): Promise<void> {}
 
   /**
killedBy: Container start should start the Fastify server on specified port
statusReason: expected "vi.fn()" to be called with arguments: [ { port: 3000, host: '127.0.0.1' } ]

Number of calls: 0

[Killed] BlockStatement
src/infrastructure/di/container.ts:501:9
    * ```
    */
   async start(): Promise<void> {
-    try {
-      const port = Number(EnvConfig.PORT)
-      const host = String(EnvConfig.HOST)
-      const isDevelopment = EnvConfig.NODE_ENV !== 'production'
-      const useHttps = isDevelopment && String(EnvConfig.USE_HTTPS) === 'true'
-      const appName = EnvConfig.APPLICATION_NAME
-
-      await this.app.listen({ port, host })
-      const protocol = useHttps ? 'https' : 'http'
-      this.logger.info(`Server started successfully ${appName}`)
-      this.logger.info(`Server listening on ${protocol}://${host}:${port}`)
-      this.logger.info(`📚 API Documentation: ${protocol}://${host}:${port}/docs`)
-    } catch (error) {
+    try {} catch (error) {
       this.logger.error('Failed to start server', error as Error)
       process.exit(1)
killedBy: Container start should start the Fastify server on specified port
statusReason: expected "vi.fn()" to be called with arguments: [ { port: 3000, host: '127.0.0.1' } ]

Number of calls: 0

[Survived] ConditionalExpression
src/infrastructure/di/container.ts:504:29
     try {
       const port = Number(EnvConfig.PORT)
       const host = String(EnvConfig.HOST)
-      const isDevelopment = EnvConfig.NODE_ENV !== 'production'
+      const isDevelopment = false
       const useHttps = isDevelopment && String(EnvConfig.USE_HTTPS) === 'true'
       const appName = EnvConfig.APPLICATION_NAME

[Survived] EqualityOperator
src/infrastructure/di/container.ts:504:29
     try {
       const port = Number(EnvConfig.PORT)
       const host = String(EnvConfig.HOST)
-      const isDevelopment = EnvConfig.NODE_ENV !== 'production'
+      const isDevelopment = EnvConfig.NODE_ENV === 'production'
       const useHttps = isDevelopment && String(EnvConfig.USE_HTTPS) === 'true'
       const appName = EnvConfig.APPLICATION_NAME

[Survived] StringLiteral
src/infrastructure/di/container.ts:509:35
       const appName = EnvConfig.APPLICATION_NAME
 
       await this.app.listen({ port, host })
-      const protocol = useHttps ? 'https' : 'http'
+      const protocol = useHttps ? "" : 'http'
       this.logger.info(`Server started successfully ${appName}`)
       this.logger.info(`Server listening on ${protocol}://${host}:${port}`)

[Killed] BlockStatement
src/infrastructure/di/container.ts:513:21
       this.logger.info(`Server started successfully ${appName}`)
       this.logger.info(`Server listening on ${protocol}://${host}:${port}`)
       this.logger.info(`📚 API Documentation: ${protocol}://${host}:${port}/docs`)
-    } catch (error) {
-      this.logger.error('Failed to start server', error as Error)
-      process.exit(1)
-    }
+    } catch (error) {}
   }
 
killedBy: Container start should log error and exit on startup failure
statusReason: promise resolved "undefined" instead of rejecting

[Killed] StringLiteral
src/infrastructure/di/container.ts:514:25
       this.logger.info(`Server listening on ${protocol}://${host}:${port}`)
       this.logger.info(`📚 API Documentation: ${protocol}://${host}:${port}/docs`)
     } catch (error) {
-      this.logger.error('Failed to start server', error as Error)
+      this.logger.error("", error as Error)
       process.exit(1)
     }
killedBy: Container start should log error and exit on startup failure
statusReason: expected "vi.fn()" to be called with arguments: [ 'Failed to start server', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "Failed to start server",

[Killed] BlockStatement
src/infrastructure/di/container.ts:535:31
    * })
    * ```
    */
-  async stop(): Promise<void> {
-    let hadError = false
-    try {
-      await this.app.close()
-    } catch (error) {
-      hadError = true
-      this.logger.error('Error while closing server', error as Error)
-    } finally {
-      try {
-        await pool.end()
-      } catch (error) {
-        hadError = true
-        this.logger.error('Error while closing database pool', error as Error)
-      }
-      if (hadError) {
-        this.logger.warn('Server stop completed with errors, see previous logs for details')
-      } else {
-        this.logger.info('Server stopped')
-      }
-    }
-  }
+  async stop(): Promise<void> {}
 }
 
killedBy: Container stop should close the Fastify server
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BooleanLiteral
src/infrastructure/di/container.ts:536:20
    * ```
    */
   async stop(): Promise<void> {
-    let hadError = false
+    let hadError = true
     try {
       await this.app.close()
killedBy: Container stop should log server shutdown
statusReason: expected "vi.fn()" to be called with arguments: [ 'Server stopped' ]

Received:

  1st vi.fn() call:

  [
-   "Server stopped",

[Killed] BlockStatement
src/infrastructure/di/container.ts:537:9
    */
   async stop(): Promise<void> {
     let hadError = false
-    try {
-      await this.app.close()
-    } catch (error) {
+    try {} catch (error) {
       hadError = true
       this.logger.error('Error while closing server', error as Error)
killedBy: Container stop should close the Fastify server
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/infrastructure/di/container.ts:539:21
     let hadError = false
     try {
       await this.app.close()
-    } catch (error) {
-      hadError = true
-      this.logger.error('Error while closing server', error as Error)
-    } finally {
+    } catch (error) {} finally {
       try {
         await pool.end()
killedBy: Container stop should handle close errors gracefully
statusReason: expected "vi.fn()" to be called with arguments: [ 'Error while closing server', …(1) ]

Number of calls: 0

[Killed] BooleanLiteral
src/infrastructure/di/container.ts:540:18
     try {
       await this.app.close()
     } catch (error) {
-      hadError = true
+      hadError = false
       this.logger.error('Error while closing server', error as Error)
     } finally {
killedBy: Container stop should handle close errors gracefully
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BlockStatement
src/infrastructure/di/container.ts:542:15
     } catch (error) {
       hadError = true
       this.logger.error('Error while closing server', error as Error)
-    } finally {
-      try {
-        await pool.end()
-      } catch (error) {
-        hadError = true
-        this.logger.error('Error while closing database pool', error as Error)
-      }
-      if (hadError) {
-        this.logger.warn('Server stop completed with errors, see previous logs for details')
-      } else {
-        this.logger.info('Server stopped')
-      }
-    }
+    } finally {}
   }
 }
killedBy: Container stop should call pool.end() to close the database pool
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/infrastructure/di/container.ts:543:11
       hadError = true
       this.logger.error('Error while closing server', error as Error)
     } finally {
-      try {
-        await pool.end()
-      } catch (error) {
+      try {} catch (error) {
         hadError = true
         this.logger.error('Error while closing database pool', error as Error)
killedBy: Container stop should call pool.end() to close the database pool
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/infrastructure/di/container.ts:545:23
     } finally {
       try {
         await pool.end()
-      } catch (error) {
-        hadError = true
-        this.logger.error('Error while closing database pool', error as Error)
-      }
+      } catch (error) {}
       if (hadError) {
         this.logger.warn('Server stop completed with errors, see previous logs for details')
killedBy: Container stop should handle pool.end() errors gracefully
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0

[Killed] ConditionalExpression
src/infrastructure/di/container.ts:549:11
         hadError = true
         this.logger.error('Error while closing database pool', error as Error)
       }
-      if (hadError) {
+      if (false) {
         this.logger.warn('Server stop completed with errors, see previous logs for details')
       } else {
killedBy: Container stop should handle close errors gracefully
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] ConditionalExpression
src/infrastructure/di/container.ts:549:11
         hadError = true
         this.logger.error('Error while closing database pool', error as Error)
       }
-      if (hadError) {
+      if (true) {
         this.logger.warn('Server stop completed with errors, see previous logs for details')
       } else {
killedBy: Container stop should log server shutdown
statusReason: expected "vi.fn()" to be called with arguments: [ 'Server stopped' ]

Received:

  1st vi.fn() call:

  [
-   "Server stopped",

[Killed] BlockStatement
src/infrastructure/di/container.ts:551:14
       }
       if (hadError) {
         this.logger.warn('Server stop completed with errors, see previous logs for details')
-      } else {
-        this.logger.info('Server stopped')
-      }
+      } else {}
     }
   }
killedBy: Container stop should log server shutdown
statusReason: expected "vi.fn()" to be called with arguments: [ 'Server stopped' ]

Received:

  1st vi.fn() call:

  [
-   "Server stopped",
