[Survived] BooleanLiteral
src/shared/types/index.ts:15:34
 export const dataPartSchema = z.object({
   darkness: z.object({
     response: z.string().optional(),
-    loading: z.boolean().default(true),
+    loading: z.boolean().default(false),
   }),
 })
